[
    {
        "text": "This year we ran the third Summer of Math Exposition, which is a contest aimed at encouraging",
        "start": 0.0,
        "duration": 4.68
    },
    {
        "text": "more people to put up math explainers online, in whatever way they dream of doing that.",
        "start": 4.68,
        "duration": 4.42
    },
    {
        "text": "A lot of them are videos, not all of them are videos.",
        "start": 9.1,
        "duration": 2.58
    },
    {
        "text": "Every year we select some winners, but I say at every time the contest is not actually",
        "start": 11.68,
        "duration": 4.14
    },
    {
        "text": "about the winners, success looks like getting more good explanations online.",
        "start": 15.82,
        "duration": 4.7
    },
    {
        "text": "Now last year in the winner announcement video I talked all about the specific criteria I",
        "start": 20.52,
        "duration": 4.44
    },
    {
        "text": "try to think about.",
        "start": 24.96,
        "duration": 1.3
    },
    {
        "text": "I won't necessarily repeat that here, you can watch that one for all that.",
        "start": 26.26,
        "duration": 3.3
    },
    {
        "text": "Instead I thought I'd just go down 25 different entries and say a couple of words on what",
        "start": 29.56,
        "duration": 5.98
    },
    {
        "text": "I like about each one.",
        "start": 35.54,
        "duration": 1.94
    },
    {
        "text": "Before I dive in, I've got to be honest, I found it especially hard this year to actually",
        "start": 37.48,
        "duration": 4.14
    },
    {
        "text": "make the decisions for what constitutes an honorable mention, what constitutes a winner.",
        "start": 41.62,
        "duration": 5.02
    },
    {
        "text": "And to be clear, I'm not the only one making decisions here, we have a whole bunch of guest",
        "start": 46.64,
        "duration": 3.2
    },
    {
        "text": "judges who helped, I'm really just assembling my own feedback on everyone else's.",
        "start": 49.84,
        "duration": 4.2
    },
    {
        "text": "But nevertheless at some point you have to make a call that says this one is a winner,",
        "start": 54.04,
        "duration": 3.76
    },
    {
        "text": "this one is an honorable mention.",
        "start": 57.8,
        "duration": 2.44
    },
    {
        "text": "And I think I realized one of the reasons that it was so hard is I don't think there's",
        "start": 60.24,
        "duration": 4.44
    },
    {
        "text": "such a thing as a generally good math explainer for a general audience.",
        "start": 64.68,
        "duration": 5.68
    },
    {
        "text": "I think there's such a thing as a pretty good video for a general audience, and I think",
        "start": 70.36,
        "duration": 4.08
    },
    {
        "text": "there's such a thing as great videos for very specific audiences.",
        "start": 74.44,
        "duration": 3.92
    },
    {
        "text": "And in some ways it's that second category that is where the internet really shines,",
        "start": 78.36,
        "duration": 4.04
    },
    {
        "text": "where you have something that maybe isn't perfectly tailored for everyone because it",
        "start": 82.4,
        "duration": 3.32
    },
    {
        "text": "can't be, but for that particular audience that it's great for, it's kind of the best",
        "start": 85.72,
        "duration": 4.72
    },
    {
        "text": "thing you could have asked for.",
        "start": 90.44,
        "duration": 1.68
    },
    {
        "text": "And I'll actually give one example.",
        "start": 92.12,
        "duration": 1.88
    },
    {
        "text": "So one of the entries that I want to showcase for you is called Pixel Art Anti-Aliasing.",
        "start": 94.0,
        "duration": 4.92
    },
    {
        "text": "It's all about the task of taking a piece of two-dimensional really low resolution pixel",
        "start": 98.92,
        "duration": 3.76
    },
    {
        "text": "art, but displaying it in a three-dimensional potentially high resolution environment.",
        "start": 102.68,
        "duration": 5.0
    },
    {
        "text": "I found it fascinating, and I think anyone who's really into computer graphics, and especially",
        "start": 107.68,
        "duration": 4.14
    },
    {
        "text": "anyone who enjoys shader programming, would find this completely fascinating.",
        "start": 111.82,
        "duration": 4.08
    },
    {
        "text": "For that specific audience, I am very confident in saying, watch it, you'll enjoy it, you're",
        "start": 115.9,
        "duration": 4.08
    },
    {
        "text": "going to get something out of it.",
        "start": 119.98,
        "duration": 1.24
    },
    {
        "text": "Now this one does a good job of motivating the mathematical ideas that go into it, even",
        "start": 121.22,
        "duration": 3.92
    },
    {
        "text": "if you aren't necessarily into shader programming.",
        "start": 125.14,
        "duration": 2.72
    },
    {
        "text": "But if I'm expanding the scope of who I might be recommending this to, to any generally",
        "start": 127.86,
        "duration": 5.04
    },
    {
        "text": "math curious internet goer, well, you know, that makes a couple assumptions for things",
        "start": 132.9,
        "duration": 4.76
    },
    {
        "text": "you might know about that maybe not everyone does.",
        "start": 137.66,
        "duration": 2.8
    },
    {
        "text": "And to be fair, omitting certain fundamentals is the correct choice for the target audience.",
        "start": 140.46,
        "duration": 5.84
    },
    {
        "text": "Now the next entry, and by the way, I randomly sorted this list of content that I want to",
        "start": 146.3,
        "duration": 4.12
    },
    {
        "text": "go through ahead of time.",
        "start": 150.42,
        "duration": 1.0
    },
    {
        "text": "I'll talk about which ones were chosen as winners at the very end.",
        "start": 151.42,
        "duration": 3.32
    },
    {
        "text": "This next one is called The Math of Saving the Enola Gay.",
        "start": 154.74,
        "duration": 3.04
    },
    {
        "text": "So this is talking about the plane which dropped the nuclear bombs in World War II.",
        "start": 157.78,
        "duration": 4.24
    },
    {
        "text": "And the author acknowledges that there's some obvious moral questions associated with",
        "start": 162.02,
        "duration": 3.12
    },
    {
        "text": "the mission itself.",
        "start": 165.14,
        "duration": 1.32
    },
    {
        "text": "But the focus is on the surprisingly interesting physics question of the best route that the",
        "start": 166.46,
        "duration": 4.36
    },
    {
        "text": "plane should take after dropping the weapon to avoid paying potentially calamitous consequences",
        "start": 170.82,
        "duration": 5.16
    },
    {
        "text": "of the aftershock of the weapon itself.",
        "start": 175.98,
        "duration": 2.84
    },
    {
        "text": "And what I appreciate is that he really does go into the full detail of the problem itself.",
        "start": 178.82,
        "duration": 4.52
    },
    {
        "text": "And this is the kind of video lecture I could imagine as being a really, really excellent",
        "start": 183.34,
        "duration": 3.64
    },
    {
        "text": "case study that you could use in a high school physics class or something like that.",
        "start": 186.98,
        "duration": 4.28
    },
    {
        "text": "It's a worked example that covers a lot of very fundamental ideas that you would need",
        "start": 191.26,
        "duration": 3.68
    },
    {
        "text": "for a class like that.",
        "start": 194.94,
        "duration": 1.48
    },
    {
        "text": "And whereas often on YouTube it can make sense to kind of skip over some of the heavier details",
        "start": 196.42,
        "duration": 5.12
    },
    {
        "text": "and mention that this is best left as an exercise to the viewer or something like that.",
        "start": 201.54,
        "duration": 4.64
    },
    {
        "text": "I really respect those who actually do step through all of the detail because that most",
        "start": 206.18,
        "duration": 3.7
    },
    {
        "text": "authentically reflects what the feeling of doing math is and the amount of time that",
        "start": 209.88,
        "duration": 4.22
    },
    {
        "text": "it can take.",
        "start": 214.1,
        "duration": 1.0
    },
    {
        "text": "So it's definitely something to watch when you're in the mood for details.",
        "start": 215.1,
        "duration": 2.96
    },
    {
        "text": "But when you are, it's excellent.",
        "start": 218.06,
        "duration": 1.98
    },
    {
        "text": "Next up is Making a Pitch Shifter.",
        "start": 220.04,
        "duration": 2.14
    },
    {
        "text": "And so this is the technology that allows you to auto-tune and things like that.",
        "start": 222.18,
        "duration": 4.08
    },
    {
        "text": "And also it's an equivalent problem to how you speed up or slow down audio without changing",
        "start": 226.26,
        "duration": 4.92
    },
    {
        "text": "the pitch of it.",
        "start": 231.18,
        "duration": 1.0
    },
    {
        "text": "For example, I imagine a lot of you are watching this video at 1.5x or 2x.",
        "start": 232.18,
        "duration": 4.36
    },
    {
        "text": "And if you step back and think about what's required to make that work, it's actually",
        "start": 236.54,
        "duration": 3.3
    },
    {
        "text": "a very interesting question.",
        "start": 239.84,
        "duration": 1.9
    },
    {
        "text": "And this video goes through a lot of the different ways that you might think about it, some of",
        "start": 241.74,
        "duration": 3.36
    },
    {
        "text": "the initial approaches, quirks associated with those.",
        "start": 245.1,
        "duration": 2.8
    },
    {
        "text": "It shows the code that he's using along the way.",
        "start": 247.9,
        "duration": 2.24
    },
    {
        "text": "It's a great practical problem and who doesn't love a little more forte in their lives.",
        "start": 250.14,
        "duration": 4.2
    },
    {
        "text": "Next up we have a non-video entry.",
        "start": 254.42,
        "duration": 2.12
    },
    {
        "text": "This one is Cayley Graphs and Pretty Things.",
        "start": 256.54,
        "duration": 2.8
    },
    {
        "text": "This is another example where for the right audience, this is an excellent piece of content.",
        "start": 259.34,
        "duration": 5.04
    },
    {
        "text": "In this case, I think that audience would be students in group theory.",
        "start": 264.38,
        "duration": 3.84
    },
    {
        "text": "In particular, I think what it does an excellent job describing is the semi-direct product.",
        "start": 268.22,
        "duration": 5.52
    },
    {
        "text": "So it describes a lot of other things, but it builds up to this, which is a very specific",
        "start": 273.74,
        "duration": 3.84
    },
    {
        "text": "and kind of niche thing that a group theory student might come across.",
        "start": 277.58,
        "duration": 4.0
    },
    {
        "text": "Might be a little bit confusing in the book.",
        "start": 281.58,
        "duration": 2.04
    },
    {
        "text": "The way that everything is explained here gives a really satisfying mental image that",
        "start": 283.82,
        "duration": 4.6
    },
    {
        "text": "you can hold in your head for that, which is great.",
        "start": 288.42,
        "duration": 2.24
    },
    {
        "text": "Ah, okay.",
        "start": 290.66,
        "duration": 1.0
    },
    {
        "text": "The next one is the longest increasing subsequence.",
        "start": 291.66,
        "duration": 3.72
    },
    {
        "text": "I talk about one of the things I'm looking for as being memorable pieces of content.",
        "start": 295.38,
        "duration": 5.0
    },
    {
        "text": "This channel definitely satisfies that because for the last three years, I remember the entries",
        "start": 300.38,
        "duration": 4.64
    },
    {
        "text": "that they put in.",
        "start": 305.02,
        "duration": 1.0
    },
    {
        "text": "They have a very particular style, a very distinctively clear way of talking about what",
        "start": 306.02,
        "duration": 5.48
    },
    {
        "text": "would usually be rather technical topics.",
        "start": 311.54,
        "duration": 2.68
    },
    {
        "text": "And here I'm envisioning the target audience as probably being the same kind of people",
        "start": 314.22,
        "duration": 4.16
    },
    {
        "text": "who would attend like a seminar in a math department, curious undergrads or some of",
        "start": 318.38,
        "duration": 4.08
    },
    {
        "text": "the grad students in the department.",
        "start": 322.46,
        "duration": 2.48
    },
    {
        "text": "Because it describes a problem which to be perfectly fair, you might not care about if",
        "start": 324.94,
        "duration": 4.44
    },
    {
        "text": "you're not already super into math.",
        "start": 329.38,
        "duration": 1.68
    },
    {
        "text": "It's talking about if you have a random permutation, what might you expect the longest increasing",
        "start": 331.06,
        "duration": 4.68
    },
    {
        "text": "subsequence in that permutation to be?",
        "start": 335.74,
        "duration": 2.4
    },
    {
        "text": "So a very natural, but very pure question.",
        "start": 338.14,
        "duration": 2.6
    },
    {
        "text": "The tactics brought to studying this are surprising, but really well motivated in the context of",
        "start": 340.82,
        "duration": 5.28
    },
    {
        "text": "the video.",
        "start": 346.1,
        "duration": 1.0
    },
    {
        "text": "And I think just really beautiful to think about.",
        "start": 347.1,
        "duration": 2.16
    },
    {
        "text": "Next up, we've got another non-video entry, the Matrix Arcade.",
        "start": 349.26,
        "duration": 3.92
    },
    {
        "text": "And this one, I think I remember in the peer review, might've gotten marked down a little",
        "start": 353.18,
        "duration": 3.48
    },
    {
        "text": "bit more than some of the others.",
        "start": 356.66,
        "duration": 1.78
    },
    {
        "text": "And I'm guessing it's because one of the things we mentioned looking for in any given",
        "start": 358.44,
        "duration": 3.34
    },
    {
        "text": "content piece is novelty.",
        "start": 361.78,
        "duration": 2.04
    },
    {
        "text": "And in terms of topic matter, this one covers a lot of the same things as the Essence of",
        "start": 363.82,
        "duration": 3.8
    },
    {
        "text": "Linear Algebra series that I made way back when.",
        "start": 367.62,
        "duration": 2.84
    },
    {
        "text": "But I do actually think this one is worth highlighting because even if there's overlap",
        "start": 370.46,
        "duration": 3.62
    },
    {
        "text": "in the subject matter, I think presenting it in this mode in an interactive way where",
        "start": 374.08,
        "duration": 4.38
    },
    {
        "text": "at the end you offer a playground that someone can go through.",
        "start": 378.46,
        "duration": 2.76
    },
    {
        "text": "And along the way, each idea is really well illustrated on the main screen and really",
        "start": 381.22,
        "duration": 3.3
    },
    {
        "text": "well described in the text on the right.",
        "start": 384.52,
        "duration": 2.52
    },
    {
        "text": "That adds something that I've wanted to see added to the space for a long time.",
        "start": 387.04,
        "duration": 3.78
    },
    {
        "text": "And I could absolutely see recommending this to teachers of linear algebra.",
        "start": 390.82,
        "duration": 3.84
    },
    {
        "text": "It's a great link that you can send to someone.",
        "start": 394.66,
        "duration": 2.48
    },
    {
        "text": "Next in my randomly sorted list of featured content is a video called Watching Neural",
        "start": 397.14,
        "duration": 4.64
    },
    {
        "text": "Networks Learn.",
        "start": 401.78,
        "duration": 1.48
    },
    {
        "text": "And on the one hand, it's very beautiful.",
        "start": 403.26,
        "duration": 1.4
    },
    {
        "text": "A lot of the imagery comes from a certain way to visualize the gradient descent process",
        "start": 404.66,
        "duration": 5.16
    },
    {
        "text": "or what the neural network can do during that process.",
        "start": 409.82,
        "duration": 3.4
    },
    {
        "text": "But the thing that really sold this for me was not so much the nice visuals, but there's",
        "start": 413.22,
        "duration": 3.86
    },
    {
        "text": "a really thought provoking discussion in here on the choices that you can make as you set",
        "start": 417.08,
        "duration": 4.06
    },
    {
        "text": "up the network and what different features you can use.",
        "start": 421.14,
        "duration": 3.12
    },
    {
        "text": "And in the context of learning a function that describes a two dimensional image, why",
        "start": 424.26,
        "duration": 4.72
    },
    {
        "text": "Fourier series in particular end up giving dramatically better results.",
        "start": 428.98,
        "duration": 3.84
    },
    {
        "text": "And I had never thought about this particular combination of ideas before and I thought",
        "start": 432.82,
        "duration": 3.82
    },
    {
        "text": "it was just really fascinating.",
        "start": 436.64,
        "duration": 1.9
    },
    {
        "text": "Next up, we've got an article, Functions are Vectors.",
        "start": 438.54,
        "duration": 2.86
    },
    {
        "text": "This is one of those topics that's just very important.",
        "start": 441.4,
        "duration": 2.6
    },
    {
        "text": "There's a time in your life before you think about functions as vectors and there's a time",
        "start": 444.0,
        "duration": 3.52
    },
    {
        "text": "in your life after you think about functions as vectors.",
        "start": 447.52,
        "duration": 2.98
    },
    {
        "text": "And this article was just very thorough and well explained.",
        "start": 450.5,
        "duration": 2.36
    },
    {
        "text": "And I think it's one of the best resources out there to transition someone between those",
        "start": 452.86,
        "duration": 4.0
    },
    {
        "text": "two states.",
        "start": 456.86,
        "duration": 1.24
    },
    {
        "text": "Next up, we've got the Art of Linear Programming.",
        "start": 458.1,
        "duration": 2.42
    },
    {
        "text": "And this addresses a class of problems that come up in computer science and the algorithmic",
        "start": 460.52,
        "duration": 4.7
    },
    {
        "text": "way of thinking about a good way to solve them.",
        "start": 465.22,
        "duration": 2.68
    },
    {
        "text": "And the approach that the author takes, which I always think is a very good one in any kind",
        "start": 467.9,
        "duration": 3.04
    },
    {
        "text": "of education, is to just start with one of the most simple, non-trivial examples that",
        "start": 470.94,
        "duration": 4.76
    },
    {
        "text": "you can have and really just working through what everything looks like in that context",
        "start": 475.7,
        "duration": 4.48
    },
    {
        "text": "as he then goes on to describe the more general or sometimes more constrained situations where",
        "start": 480.18,
        "duration": 4.28
    },
    {
        "text": "those similar ideas can apply.",
        "start": 484.46,
        "duration": 2.4
    },
    {
        "text": "It's well illustrated, the ideas along the way are well motivated, so just a bang up",
        "start": 486.86,
        "duration": 4.38
    },
    {
        "text": "job all around.",
        "start": 491.24,
        "duration": 1.44
    },
    {
        "text": "This next one is actually a little different.",
        "start": 492.68,
        "duration": 2.02
    },
    {
        "text": "It's called The Mosaic Problem, How and Why to Do Math for Fun.",
        "start": 494.7,
        "duration": 3.94
    },
    {
        "text": "So the author is describing a very specific question that they were once contemplating.",
        "start": 498.64,
        "duration": 4.74
    },
    {
        "text": "You know, I think a criticism that you could lay is that there's not a lot of motivation",
        "start": 503.38,
        "duration": 3.12
    },
    {
        "text": "for why you might care about the problem.",
        "start": 506.5,
        "duration": 2.58
    },
    {
        "text": "But that's not actually what the video is about.",
        "start": 509.08,
        "duration": 2.74
    },
    {
        "text": "He's really just using this as an example of what he calls a backburner problem.",
        "start": 511.82,
        "duration": 3.76
    },
    {
        "text": "And this is an idea that I think is very much worth getting into the minds of more math",
        "start": 515.58,
        "duration": 3.62
    },
    {
        "text": "students out there.",
        "start": 519.2,
        "duration": 1.84
    },
    {
        "text": "Essentially it's that if you have some sort of problem that you care about and you think",
        "start": 521.04,
        "duration": 3.16
    },
    {
        "text": "about, even if no one else does, as long as it's brought out your own curiosity, and when",
        "start": 524.2,
        "duration": 4.3
    },
    {
        "text": "you go into new math classes, you have that as a problem that you can kind of turn to",
        "start": 528.5,
        "duration": 4.08
    },
    {
        "text": "every now and then, it offers a fertile ground for adding context to a lot of math out there,",
        "start": 532.58,
        "duration": 5.88
    },
    {
        "text": "which is sometimes so desperately lacking a good context that motivates the students.",
        "start": 538.5,
        "duration": 4.6
    },
    {
        "text": "So for his particular question, this mosaic problem, he talks about how it made relevant",
        "start": 543.1,
        "duration": 4.08
    },
    {
        "text": "certain ideas like generating functions and principles of inclusion and exclusion.",
        "start": 547.18,
        "duration": 5.18
    },
    {
        "text": "And his broader point is not that this particular problem is the most important in the world,",
        "start": 552.36,
        "duration": 3.9
    },
    {
        "text": "but that having a backburner problem of some kind is actually one of the best ways to stay",
        "start": 556.26,
        "duration": 4.14
    },
    {
        "text": "engaged with math.",
        "start": 560.4,
        "duration": 1.46
    },
    {
        "text": "And that I would definitely agree with.",
        "start": 561.86,
        "duration": 2.64
    },
    {
        "text": "And I guess on the topic of problems which probably don't really matter, but are fun",
        "start": 564.54,
        "duration": 4.68
    },
    {
        "text": "to think about and end up being a path to some actually interesting math, the next one,",
        "start": 569.22,
        "duration": 4.72
    },
    {
        "text": "affording a planet with geometry, is I think the only claymation entry that I saw this",
        "start": 573.94,
        "duration": 5.4
    },
    {
        "text": "year used to good effect in describing a certain optimization problem, framed in the context",
        "start": 579.34,
        "duration": 5.52
    },
    {
        "text": "of deciding what shape you want to turn your planet into if you want to experience a certain",
        "start": 584.86,
        "duration": 4.8
    },
    {
        "text": "amount of gravity, but not use too much mass to do it.",
        "start": 589.66,
        "duration": 3.22
    },
    {
        "text": "It's well explained.",
        "start": 592.92,
        "duration": 1.0
    },
    {
        "text": "If you're into that kind of problem, definitely check it out.",
        "start": 593.92,
        "duration": 2.5
    },
    {
        "text": "Next up we've got when can't math be generalized, the limits of analytic continuation.",
        "start": 596.42,
        "duration": 5.3
    },
    {
        "text": "And thinking in terms of target audiences, anyone who's taking a complex analysis class,",
        "start": 601.72,
        "duration": 4.36
    },
    {
        "text": "this is outstanding, perfect for them.",
        "start": 606.08,
        "duration": 2.16
    },
    {
        "text": "Anyone who might have a complex analysis class in their future, I think this does a good",
        "start": 608.24,
        "duration": 3.82
    },
    {
        "text": "job setting up some of the ideas that you run across in that.",
        "start": 612.06,
        "duration": 3.26
    },
    {
        "text": "It's not talking about generalizing math in the sense of applying it to a general set",
        "start": 615.32,
        "duration": 4.28
    },
    {
        "text": "of circumstances, but in a setting where sometimes you can take a function defined",
        "start": 619.6,
        "duration": 3.76
    },
    {
        "text": "on one domain and extend that definition beyond it, there are circumstances where you actually",
        "start": 623.36,
        "duration": 5.96
    },
    {
        "text": "can't do that.",
        "start": 629.32,
        "duration": 1.0
    },
    {
        "text": "And he offers a really clear description of what exactly we mean by extending in this",
        "start": 630.32,
        "duration": 3.72
    },
    {
        "text": "context and then an example where you can't do that that seems like it's sort of dropped",
        "start": 634.04,
        "duration": 4.62
    },
    {
        "text": "in from out of the blue, but it gives a really satisfying reason for why this example would",
        "start": 638.66,
        "duration": 4.32
    },
    {
        "text": "have the properties that it does with some suggestion for how you might have come up",
        "start": 642.98,
        "duration": 3.26
    },
    {
        "text": "with that.",
        "start": 646.24,
        "duration": 1.0
    },
    {
        "text": "And the next step is just a very cute example of an argument in geometry.",
        "start": 647.56,
        "duration": 4.08
    },
    {
        "text": "Some of you might have thought about this before, but if you translate something and",
        "start": 651.64,
        "duration": 3.2
    },
    {
        "text": "then rotate it, or maybe you rotate and then translate, it's always possible to express",
        "start": 654.84,
        "duration": 4.72
    },
    {
        "text": "the composite motion there as some kind of rotation about some point.",
        "start": 659.56,
        "duration": 4.76
    },
    {
        "text": "And of course, there's a slight caveat there where if you just translate it but rotate",
        "start": 664.32,
        "duration": 3.2
    },
    {
        "text": "it zero degrees, that's not the same as a rotation.",
        "start": 667.52,
        "duration": 2.5
    },
    {
        "text": "And this video offers just a really well illustrated proof of why that's the case.",
        "start": 670.02,
        "duration": 4.04
    },
    {
        "text": "And I think what stuck out to me is the way that the second half of the proof was framed",
        "start": 674.06,
        "duration": 3.72
    },
    {
        "text": "in terms of this kind of game that you're playing with a certain demon, which takes",
        "start": 677.78,
        "duration": 4.02
    },
    {
        "text": "what otherwise is maybe a little bit of a confusing set of logical steps that leads",
        "start": 681.8,
        "duration": 3.86
    },
    {
        "text": "to a contradiction, and instead just makes it a little easier to hold on to while you're",
        "start": 685.66,
        "duration": 3.84
    },
    {
        "text": "following all of the reasoning.",
        "start": 689.5,
        "duration": 1.44
    },
    {
        "text": "So I appreciated that.",
        "start": 690.94,
        "duration": 1.8
    },
    {
        "text": "Ah, so the next one, rethinking the real line.",
        "start": 692.74,
        "duration": 3.36
    },
    {
        "text": "I really liked this one, and it stood out from many others, for one thing just because",
        "start": 696.1,
        "duration": 4.72
    },
    {
        "text": "it felt very natural, like the presentation didn't feel like it was scripted or over-edited",
        "start": 700.82,
        "duration": 4.36
    },
    {
        "text": "in any way.",
        "start": 705.18,
        "duration": 1.0
    },
    {
        "text": "But what really shown is the subject matter.",
        "start": 706.18,
        "duration": 2.12
    },
    {
        "text": "And again, I think the sense in which it's great is for a particular target audience.",
        "start": 708.3,
        "duration": 4.76
    },
    {
        "text": "So in this case, if you've ever thought about visualizing rational numbers or rational approximations",
        "start": 713.06,
        "duration": 5.06
    },
    {
        "text": "of irrational numbers, it offers just a really dense set of very nice ideas for how to think",
        "start": 718.12,
        "duration": 5.62
    },
    {
        "text": "about these topics.",
        "start": 723.74,
        "duration": 1.58
    },
    {
        "text": "And they're all connected with each other very nicely.",
        "start": 725.32,
        "duration": 2.38
    },
    {
        "text": "And I, for one, felt like I came out of it armed with a few more mental constructs for",
        "start": 727.7,
        "duration": 3.92
    },
    {
        "text": "how to think about a few of these ideas, which is, of course, just such a nice feeling.",
        "start": 731.62,
        "duration": 4.0
    },
    {
        "text": "All right, next we've got how did the ancient Egyptians find this volume without algebra?",
        "start": 735.62,
        "duration": 5.66
    },
    {
        "text": "So this is a question which is interesting in terms of the history of math or what you",
        "start": 741.28,
        "duration": 4.1
    },
    {
        "text": "can do without certain ideas that we take for granted.",
        "start": 745.38,
        "duration": 3.08
    },
    {
        "text": "So the problem at hand is how you find the volume of essentially a pyramid where you",
        "start": 748.46,
        "duration": 4.14
    },
    {
        "text": "cut off the top of it.",
        "start": 752.6,
        "duration": 1.78
    },
    {
        "text": "The author talks about how the Egyptians had this formula for it, which is, of course,",
        "start": 754.38,
        "duration": 3.88
    },
    {
        "text": "not written algebraically.",
        "start": 758.26,
        "duration": 1.5
    },
    {
        "text": "People didn't think algebraically back then.",
        "start": 759.76,
        "duration": 2.78
    },
    {
        "text": "But he addresses how it's actually very surprising to get to that formula if you don't think",
        "start": 762.54,
        "duration": 5.08
    },
    {
        "text": "algebraically.",
        "start": 767.62,
        "duration": 1.46
    },
    {
        "text": "And so tries to address the problem of how might you find this idea as a algorithm for",
        "start": 769.08,
        "duration": 5.22
    },
    {
        "text": "finding the volume not expressed as a formula without being able to manipulate the formulas",
        "start": 774.3,
        "duration": 4.86
    },
    {
        "text": "that you or I would naturally manipulate to land on that idea.",
        "start": 779.16,
        "duration": 6.04
    },
    {
        "text": "This next one, I think, has one of the best hooks of any of the ones that I've seen before.",
        "start": 785.2,
        "duration": 5.06
    },
    {
        "text": "So he essentially asks if you're swinging a ball on a rope above your head, and then",
        "start": 790.26,
        "duration": 4.1
    },
    {
        "text": "at some point you release the rope, you let go of the rope, what happens to the ball with",
        "start": 794.36,
        "duration": 5.12
    },
    {
        "text": "the three possibilities that it continues on the circular path, that it continues on",
        "start": 799.48,
        "duration": 4.32
    },
    {
        "text": "the straight line path tangent to the circle, or it goes on this straight path away from",
        "start": 803.8,
        "duration": 4.46
    },
    {
        "text": "the circle.",
        "start": 808.26,
        "duration": 1.52
    },
    {
        "text": "And I guess I'll just say it's not the answer that most people say it is.",
        "start": 809.78,
        "duration": 3.6
    },
    {
        "text": "And he does, I think, a really good job laying out the intuition for why that's not the case,",
        "start": 813.38,
        "duration": 3.88
    },
    {
        "text": "and then demonstrating it experimentally.",
        "start": 817.26,
        "duration": 2.82
    },
    {
        "text": "Also on the more physics-oriented side of things, we have the math of bubbles, minimal",
        "start": 820.08,
        "duration": 5.06
    },
    {
        "text": "surfaces and the calculus of variations.",
        "start": 825.14,
        "duration": 2.88
    },
    {
        "text": "So again, there's a great hook here where the problem at hand is to understand the shape",
        "start": 828.02,
        "duration": 4.52
    },
    {
        "text": "of the surface that you get if you take two cylindrical boundaries and then form a bubble",
        "start": 832.54,
        "duration": 5.2
    },
    {
        "text": "in between them, where the relevant physics at play is that bubbles try to have the minimal",
        "start": 837.74,
        "duration": 4.96
    },
    {
        "text": "surface area that they can subject to some kind of boundary conditions.",
        "start": 842.7,
        "duration": 4.52
    },
    {
        "text": "The way to solve this problem is to bring in something known as the calculus of variations.",
        "start": 847.22,
        "duration": 4.42
    },
    {
        "text": "It's very important in other contexts.",
        "start": 851.64,
        "duration": 1.78
    },
    {
        "text": "For example, if any of you have ever heard of Lagrangian mechanics, and the author here",
        "start": 853.42,
        "duration": 3.7
    },
    {
        "text": "describes the general framework used for not just this problem, but a wide category of",
        "start": 857.12,
        "duration": 4.42
    },
    {
        "text": "problems and works through it for this particular case.",
        "start": 861.54,
        "duration": 3.24
    },
    {
        "text": "Again, it's one of those where to get the most out of it, you've got to be in the mood",
        "start": 864.82,
        "duration": 3.34
    },
    {
        "text": "for some details.",
        "start": 868.16,
        "duration": 1.42
    },
    {
        "text": "And in this one, he does leave a lot of room to kind of pause and think through things",
        "start": 869.58,
        "duration": 2.96
    },
    {
        "text": "where if certain steps are something you might have thought about before, you don't have",
        "start": 872.54,
        "duration": 3.18
    },
    {
        "text": "to linger on it too much.",
        "start": 875.72,
        "duration": 1.62
    },
    {
        "text": "But definitely if it's the first time you're going through any calculus of variation example,",
        "start": 877.34,
        "duration": 4.22
    },
    {
        "text": "it is something you kind of need to stop and digest for a bit.",
        "start": 881.56,
        "duration": 2.48
    },
    {
        "text": "And he leaves the room for that, which is nice.",
        "start": 884.04,
        "duration": 2.74
    },
    {
        "text": "Next up is another non-video entry, which I think is a really just perfect example for",
        "start": 886.78,
        "duration": 5.02
    },
    {
        "text": "any calculus 2 class out there.",
        "start": 891.8,
        "duration": 2.22
    },
    {
        "text": "Any teachers looking to pull in something, I think this is a really great resource.",
        "start": 894.26,
        "duration": 4.36
    },
    {
        "text": "The question is very simply, how do computers calculate logarithms?",
        "start": 898.62,
        "duration": 3.4
    },
    {
        "text": "What happens when you're clicking that button?",
        "start": 902.02,
        "duration": 2.28
    },
    {
        "text": "He goes into things like Taylor series, but then perhaps more importantly, why the simple",
        "start": 904.3,
        "duration": 4.68
    },
    {
        "text": "naive Taylor series approach here doesn't necessarily get you something as good as you",
        "start": 908.98,
        "duration": 3.76
    },
    {
        "text": "might want.",
        "start": 912.74,
        "duration": 1.1
    },
    {
        "text": "That last step is really well motivated, really well described.",
        "start": 913.84,
        "duration": 2.6
    },
    {
        "text": "So if you're curious, go take a look.",
        "start": 916.44,
        "duration": 2.38
    },
    {
        "text": "Next on the docket, we have what happens if you add fractions incorrectly?",
        "start": 918.82,
        "duration": 4.16
    },
    {
        "text": "So if you ask elementary schoolers to add fractions together, there's kind of this instinct",
        "start": 922.98,
        "duration": 4.36
    },
    {
        "text": "to just add the numerators and add the denominators.",
        "start": 927.34,
        "duration": 2.64
    },
    {
        "text": "If that's happening, it's probably a sign that the student doesn't appreciate what's",
        "start": 929.98,
        "duration": 3.1
    },
    {
        "text": "actually being represented or that the rules of math actually have a reason for them.",
        "start": 933.08,
        "duration": 4.1
    },
    {
        "text": "And you need to think through those reasons.",
        "start": 937.18,
        "duration": 2.08
    },
    {
        "text": "But the funny thing is that operation, which is not adding fractions, is actually the start",
        "start": 939.26,
        "duration": 4.88
    },
    {
        "text": "of a surprisingly far ranging set of ideas in other parts of math.",
        "start": 944.14,
        "duration": 3.88
    },
    {
        "text": "It has a special name, it's known as the mediant.",
        "start": 948.02,
        "duration": 2.66
    },
    {
        "text": "The author essentially walks through this pretty wide space of different things that",
        "start": 951.2,
        "duration": 4.12
    },
    {
        "text": "this seemingly arbitrary operation can lead you to.",
        "start": 955.32,
        "duration": 3.84
    },
    {
        "text": "It's actually pretty connected with the one we were talking about a couple minutes ago",
        "start": 959.16,
        "duration": 3.34
    },
    {
        "text": "on reimagining the reals, things like rational approximations.",
        "start": 962.5,
        "duration": 3.74
    },
    {
        "text": "It also talks about Dirichlet's theorem.",
        "start": 966.24,
        "duration": 2.2
    },
    {
        "text": "Forward circles are in there, who doesn't love a good forward circle?",
        "start": 968.44,
        "duration": 3.24
    },
    {
        "text": "So if you're curious about the meandering set of ideas that you can be led to here,",
        "start": 971.68,
        "duration": 4.08
    },
    {
        "text": "definitely do take a look.",
        "start": 975.76,
        "duration": 1.64
    },
    {
        "text": "Next we've got, can you guess a shape from its shadows?",
        "start": 977.4,
        "duration": 3.0
    },
    {
        "text": "So maybe you've thought about this kind of problem before.",
        "start": 980.4,
        "duration": 2.0
    },
    {
        "text": "If you take a 3D shape and you look at its shadow from one direction, shadow from another,",
        "start": 982.4,
        "duration": 3.96
    },
    {
        "text": "and then shadow from a third, can you reconstruct what that shape is?",
        "start": 986.36,
        "duration": 3.68
    },
    {
        "text": "And he mentions a seemingly obvious example where all three of those shadows are squares,",
        "start": 990.04,
        "duration": 4.04
    },
    {
        "text": "so you think the answer is a cube, but it's actually dramatically more interesting than",
        "start": 994.08,
        "duration": 3.8
    },
    {
        "text": "a cube.",
        "start": 997.88,
        "duration": 1.0
    },
    {
        "text": "And he talks about the set of shapes that you can get from this.",
        "start": 998.88,
        "duration": 2.68
    },
    {
        "text": "Ah, okay, so the next one, stylistically, is one of the most distinct of all of them,",
        "start": 1001.56,
        "duration": 6.8
    },
    {
        "text": "which I always appreciate, especially if I'm going through hundreds of different explainers",
        "start": 1008.44,
        "duration": 4.12
    },
    {
        "text": "and trying to make a decision.",
        "start": 1012.56,
        "duration": 1.84
    },
    {
        "text": "At first when I was watching this, I was like, wait, what's going on here?",
        "start": 1014.4,
        "duration": 2.76
    },
    {
        "text": "Why is he just kind of like walking around in a bunch of different places?",
        "start": 1017.16,
        "duration": 3.12
    },
    {
        "text": "But he has this really kind of calming way of incorporating a bunch of different environments",
        "start": 1020.28,
        "duration": 4.48
    },
    {
        "text": "and nature into these otherwise sometimes pretty technical descriptions of what he's",
        "start": 1024.76,
        "duration": 4.92
    },
    {
        "text": "talking about.",
        "start": 1029.68,
        "duration": 1.0
    },
    {
        "text": "And the topic matter, broadly speaking, is fixed point theorems.",
        "start": 1030.68,
        "duration": 3.76
    },
    {
        "text": "So this is one where I can imagine the target audience being like a math major or someone",
        "start": 1034.44,
        "duration": 3.64
    },
    {
        "text": "who has reason to care about fixed point theorems.",
        "start": 1038.08,
        "duration": 2.64
    },
    {
        "text": "And as it goes on, he does get into some real depth of it.",
        "start": 1040.72,
        "duration": 3.04
    },
    {
        "text": "We're closing in now towards the end of my randomly sorted list of featured videos.",
        "start": 1043.76,
        "duration": 4.4
    },
    {
        "text": "I guess the next one is not actually a video.",
        "start": 1048.16,
        "duration": 1.52
    },
    {
        "text": "I keep saying video is a generic stand in for content.",
        "start": 1049.68,
        "duration": 3.42
    },
    {
        "text": "But the next one is an article describing how computers represent numbers, in particular",
        "start": 1053.1,
        "duration": 3.98
    },
    {
        "text": "floating point numbers.",
        "start": 1057.08,
        "duration": 1.48
    },
    {
        "text": "And I've seen other explainers for floating point representations out there before, but",
        "start": 1058.56,
        "duration": 4.48
    },
    {
        "text": "I think this is the best one that I've seen.",
        "start": 1063.04,
        "duration": 2.0
    },
    {
        "text": "And I really appreciate the approach that he takes, which is to have you imagine that",
        "start": 1065.04,
        "duration": 3.68
    },
    {
        "text": "you want to represent them and go through a refined set of ideas where each one is not",
        "start": 1068.72,
        "duration": 4.88
    },
    {
        "text": "quite what the final answer ends up being, but motivates the next step in a nice way.",
        "start": 1073.6,
        "duration": 5.38
    },
    {
        "text": "This genre of discovery fiction, I think works especially well when you have topics that",
        "start": 1078.98,
        "duration": 4.46
    },
    {
        "text": "seem like they have a lot of arbitrary or unexpected choices along the way.",
        "start": 1083.44,
        "duration": 4.12
    },
    {
        "text": "It's just really well explained.",
        "start": 1087.56,
        "duration": 1.0
    },
    {
        "text": "I liked it a lot.",
        "start": 1088.56,
        "duration": 1.0
    },
    {
        "text": "All right, next on the list, we've got mathematical magic mirror ball.",
        "start": 1089.56,
        "duration": 3.94
    },
    {
        "text": "Say that five times fast.",
        "start": 1093.5,
        "duration": 2.4
    },
    {
        "text": "Essentially describing how if you take a picture of a spherical mirror, you can use that image",
        "start": 1095.9,
        "duration": 5.46
    },
    {
        "text": "to reconstruct a 360 degree view of the room all around it.",
        "start": 1101.36,
        "duration": 4.46
    },
    {
        "text": "And he described how that works, what it's used for, what the trade offs are all around",
        "start": 1105.82,
        "duration": 3.94
    },
    {
        "text": "just a great application of a pretty surprising phenomenon.",
        "start": 1109.76,
        "duration": 2.82
    },
    {
        "text": "All right, this penultimate one on my list is just actually kind of amazing.",
        "start": 1112.58,
        "duration": 5.6
    },
    {
        "text": "The person built this machine, which will weave a string along a whole bunch of pegs",
        "start": 1118.18,
        "duration": 5.48
    },
    {
        "text": "around a circle, such that as those strings intersect very densely at some points to make",
        "start": 1123.66,
        "duration": 5.0
    },
    {
        "text": "it dark and very sparsely at others to make it light, you can reconstruct an image.",
        "start": 1128.66,
        "duration": 5.16
    },
    {
        "text": "That's just amazing that such a thing is possible.",
        "start": 1133.82,
        "duration": 2.68
    },
    {
        "text": "And the author describes the process for how this was made and the various ideas that he",
        "start": 1136.5,
        "duration": 4.26
    },
    {
        "text": "tried, the reasons that they didn't work.",
        "start": 1140.76,
        "duration": 2.3
    },
    {
        "text": "It both motivates a lot of mathematical ideas, while also acknowledging that sometimes the",
        "start": 1143.06,
        "duration": 5.26
    },
    {
        "text": "thing that seems like very clever, pure math that you're bringing in to address a problem",
        "start": 1148.32,
        "duration": 4.58
    },
    {
        "text": "just isn't actually very effective.",
        "start": 1152.9,
        "duration": 2.26
    },
    {
        "text": "And that what's more important when you're applying math to the world is to find the",
        "start": 1155.16,
        "duration": 3.96
    },
    {
        "text": "right framing of the problem in the first place.",
        "start": 1159.12,
        "duration": 2.82
    },
    {
        "text": "And this is just a lesson I think is worth emphasizing a little bit more in math, that",
        "start": 1161.94,
        "duration": 3.48
    },
    {
        "text": "rather than trying to find a better solution to a particular problem, you want to instead",
        "start": 1165.42,
        "duration": 4.36
    },
    {
        "text": "ask whether the problem that you're solving is actually the right problem to be solving.",
        "start": 1169.78,
        "duration": 5.8
    },
    {
        "text": "And then last but not least on my list here is another one that I just recognize the author",
        "start": 1175.58,
        "duration": 5.32
    },
    {
        "text": "immediately because it's such a distinctive style that I've seen in the last two years,",
        "start": 1180.9,
        "duration": 4.36
    },
    {
        "text": "where the topic matter broadly speaking is infinity.",
        "start": 1185.26,
        "duration": 2.44
    },
    {
        "text": "What exactly does one mean by that?",
        "start": 1187.7,
        "duration": 2.16
    },
    {
        "text": "Like everything on this channel, it is unreasonably beautifully illustrated.",
        "start": 1189.86,
        "duration": 4.56
    },
    {
        "text": "And in just 20 minutes, you know, he hits on a lot of the really big important ideas",
        "start": 1194.42,
        "duration": 4.48
    },
    {
        "text": "around what exactly infinity means and how those ideas all relate to each other.",
        "start": 1198.94,
        "duration": 4.68
    },
    {
        "text": "So that's a wrap for the ones that I wanted to mention right now and highlight to you.",
        "start": 1203.62,
        "duration": 4.26
    },
    {
        "text": "There are many more, of course, that were submitted and quite a few that are worth looking",
        "start": 1207.88,
        "duration": 3.46
    },
    {
        "text": "at even if I didn't mention them here.",
        "start": 1211.34,
        "duration": 1.92
    },
    {
        "text": "Again, I do think what makes the judging here at the end so hard is that what makes something",
        "start": 1213.26,
        "duration": 4.32
    },
    {
        "text": "good is usually the sense in which it's good for a very specific audience and trying to",
        "start": 1217.58,
        "duration": 5.04
    },
    {
        "text": "come up with any notion of how to rank all of these against each other in an objective",
        "start": 1222.62,
        "duration": 4.2
    },
    {
        "text": "way.",
        "start": 1226.82,
        "duration": 1.0
    },
    {
        "text": "And for the different target audiences, it's just an apples to oranges comparison.",
        "start": 1227.86,
        "duration": 3.68
    },
    {
        "text": "With all of that said, the ones selected as winners, the ones collecting the golden pie",
        "start": 1231.54,
        "duration": 4.32
    },
    {
        "text": "creature prizes, are the mathematics of string art, minimal surfaces and the calculus of",
        "start": 1235.86,
        "duration": 5.6
    },
    {
        "text": "variations, rethinking the real line, pixel art anti-aliasing, and from the non-video",
        "start": 1241.46,
        "duration": 6.2
    },
    {
        "text": "category, how computers use numbers.",
        "start": 1247.66,
        "duration": 3.88
    },
    {
        "text": "So evidently, shortly after this point in the recording, my camera battery died, which",
        "start": 1251.54,
        "duration": 4.38
    },
    {
        "text": "I guess is almost perfect timing.",
        "start": 1255.92,
        "duration": 1.92
    },
    {
        "text": "I do want to close out though by saying a really big thanks to James Schloss for all",
        "start": 1257.84,
        "duration": 3.92
    },
    {
        "text": "the organization and helping to make this happen, to Fred Crozetier for the web development",
        "start": 1261.76,
        "duration": 4.88
    },
    {
        "text": "and putting together a new peer review system, which made everything this year just much,",
        "start": 1266.64,
        "duration": 3.84
    },
    {
        "text": "much smoother, and many, many thanks to the kind folks at Jane Street for providing the",
        "start": 1270.48,
        "duration": 4.54
    },
    {
        "text": "funding both for the prizes associated with the winners and honorable mentions, and also",
        "start": 1275.02,
        "duration": 4.62
    },
    {
        "text": "with other costs associated with running the event.",
        "start": 1279.64,
        "duration": 2.52
    },
    {
        "text": "Also, at the end of August, a ton of you participated in the peer review process, and I really just",
        "start": 1282.4,
        "duration": 4.24
    },
    {
        "text": "want to say thank you for donating your time to doing that.",
        "start": 1286.64,
        "duration": 2.64
    },
    {
        "text": "And then of course, thank you to everybody who made some kind of math explainer for the",
        "start": 1289.28,
        "duration": 3.64
    },
    {
        "text": "event.",
        "start": 1292.92,
        "duration": 1.0
    },
    {
        "text": "There are many really good ones that I didn't have the time to talk about in this video.",
        "start": 1293.92,
        "duration": 3.64
    },
    {
        "text": "In the description you'll find a link to a playlist for all the video entries, and",
        "start": 1297.56,
        "duration": 3.72
    },
    {
        "text": "then on the website we'll include a list of all the non-video entries.",
        "start": 1301.28,
        "duration": 3.28
    },
    {
        "text": "So do check them out, I can almost guarantee that if you scroll through and see what you're",
        "start": 1304.56,
        "duration": 3.44
    },
    {
        "text": "interested in, you'll find some hidden gems in there.",
        "start": 1308.0,
        "duration": 2.48
    }
]