[
    {
        "text": "The air around you is in constant and chaotic motion, ",
        "start": 3.72,
        "duration": 3.065
    },
    {
        "text": "replete with nearly impossible to predict swirls, ranging from large to minuscule.",
        "start": 6.785,
        "duration": 4.655
    },
    {
        "text": "What you're looking at right now is a cross-section of the flow in a typical room, ",
        "start": 11.94,
        "duration": 4.423
    },
    {
        "text": "made visible using a home demo involving a laser, a glass rod, and a fog machine.",
        "start": 16.363,
        "duration": 4.317
    },
    {
        "text": "Predicting the specifics of turbulent motion like this has long evaded ",
        "start": 21.4,
        "duration": 3.687
    },
    {
        "text": "mathematicians and physicists, but we are steadily getting closer to understanding ",
        "start": 25.087,
        "duration": 4.311
    },
    {
        "text": "some consistent patterns in this chaos, and in a minute I'll share with you ",
        "start": 29.398,
        "duration": 3.947
    },
    {
        "text": "one specific quantitative result describing a certain self-similarity to this motion.",
        "start": 33.345,
        "duration": 4.415
    },
    {
        "text": "To back up a bit, I was recently in San Diego and spent a day with Diana Cowern, ",
        "start": 38.86,
        "duration": 4.338
    },
    {
        "text": "aka Physics Girl, and her frequent collaborator, Dan Walsh, ",
        "start": 43.198,
        "duration": 3.214
    },
    {
        "text": "playing around with vortex rings.",
        "start": 46.412,
        "duration": 1.768
    },
    {
        "text": "This is a really surprising fluid flow phenomenon, ",
        "start": 48.66,
        "duration": 2.921
    },
    {
        "text": "where a donut-shaped region of fluid stays surprisingly stable as it moves through space.",
        "start": 51.581,
        "duration": 5.099
    },
    {
        "text": "If you take some open container with a lip and fill it with smoke or fog, ",
        "start": 57.46,
        "duration": 4.167
    },
    {
        "text": "you can use this to actually see the otherwise invisible ring.",
        "start": 61.627,
        "duration": 3.493
    },
    {
        "text": "Diana just published a video over on her channel showing much more ",
        "start": 65.86,
        "duration": 3.377
    },
    {
        "text": "of that particular demo, including a genuinely fascinating observation ",
        "start": 69.237,
        "duration": 3.578
    },
    {
        "text": "about what happens when you change the shape of the opening.",
        "start": 72.815,
        "duration": 3.025
    },
    {
        "text": "The story for you and me starts when her friend Dan had the clever idea to ",
        "start": 76.64,
        "duration": 4.041
    },
    {
        "text": "visualize a slice of what's going on with these vortex rings using a planar laser.",
        "start": 80.681,
        "duration": 4.419
    },
    {
        "text": "So you know how if you shine a laser through the fog, ",
        "start": 85.98,
        "duration": 2.725
    },
    {
        "text": "photons will occasionally bounce off of the particles in the fog ",
        "start": 88.705,
        "duration": 3.28
    },
    {
        "text": "along that beam towards your eye, thereby revealing the beam of the laser?",
        "start": 91.985,
        "duration": 3.735
    },
    {
        "text": "Well, Dan's thought was to refract that light through a glass rod so that ",
        "start": 96.56,
        "duration": 4.184
    },
    {
        "text": "it was relatively evenly spread across an entire plane, ",
        "start": 100.744,
        "duration": 3.166
    },
    {
        "text": "then the same phenomenon would reveal the laser light along a thin plane through that fog.",
        "start": 103.91,
        "duration": 5.09
    },
    {
        "text": "The result was awesome!",
        "start": 109.5,
        "duration": 1.52
    },
    {
        "text": "The cross-section of such a smoke ring looks like two hurricanes rotating next ",
        "start": 115.62,
        "duration": 4.604
    },
    {
        "text": "to each other, and this makes abundantly clear how the surface of these rings ",
        "start": 120.224,
        "duration": 4.546
    },
    {
        "text": "rotates as they travel, and also how chaotic they leave the air behind them.",
        "start": 124.77,
        "duration": 4.429
    },
    {
        "text": "And, as an added bonus, the setup doubles as a ",
        "start": 136.44,
        "duration": 2.183
    },
    {
        "text": "great Death Eater themed Halloween decoration.",
        "start": 138.623,
        "duration": 2.137
    },
    {
        "text": "If you do want to try this at home, I should say, ",
        "start": 141.56,
        "duration": 2.414
    },
    {
        "text": "be super careful with the laser, make sure not to point it near anyone's eyes.",
        "start": 143.974,
        "duration": 3.766
    },
    {
        "text": "This concern is especially relevant when the laser is spread along a full plane, ",
        "start": 148.14,
        "duration": 4.217
    },
    {
        "text": "basically treat it like a gun.",
        "start": 152.357,
        "duration": 1.563
    },
    {
        "text": "Also, credit where credit is due, I'd like to point out that ",
        "start": 154.62,
        "duration": 2.986
    },
    {
        "text": "after we did this we found that the channel Nighthawk and ",
        "start": 157.606,
        "duration": 2.84
    },
    {
        "text": "Light has a video doing a similar demo, link in the description.",
        "start": 160.446,
        "duration": 3.134
    },
    {
        "text": "Even though our original plan was to illuminate vortex rings, ",
        "start": 164.94,
        "duration": 3.263
    },
    {
        "text": "I actually think the most notable part of this visual is how it sheds ",
        "start": 168.203,
        "duration": 3.685
    },
    {
        "text": "light on what ordinary airflow in a room looks like, in all of its intricacy and detail.",
        "start": 171.888,
        "duration": 4.632
    },
    {
        "text": "We call this chaotic flow turbulence, and just as vortex rings give an example of ",
        "start": 177.04,
        "duration": 4.351
    },
    {
        "text": "unexpected order in the otherwise messy world of fluid dynamics, ",
        "start": 181.391,
        "duration": 3.448
    },
    {
        "text": "I'd like to share with you a more subtle instance of order amidst chaos in the ",
        "start": 184.839,
        "duration": 4.192
    },
    {
        "text": "math of turbulence.",
        "start": 189.031,
        "duration": 1.009
    },
    {
        "text": "First off, what exactly is turbulence?",
        "start": 191.16,
        "duration": 2.46
    },
    {
        "text": "The term is familiar to many of us as that annoying thing that makes plane rides bumpy, ",
        "start": 194.26,
        "duration": 4.387
    },
    {
        "text": "but nailing down a specific definition is a little tricky.",
        "start": 198.647,
        "duration": 2.893
    },
    {
        "text": "It's easiest to describe qualitatively.",
        "start": 202.16,
        "duration": 1.94
    },
    {
        "text": "Turbulence involves many swirling eddies, it's chaotic, and it mixes things together.",
        "start": 204.68,
        "duration": 4.88
    },
    {
        "text": "One approach here would be to describe turbulence based on what it's not, laminar flow.",
        "start": 210.38,
        "duration": 4.28
    },
    {
        "text": "This term stems from the same Latin word that lamination does lamina, ",
        "start": 215.24,
        "duration": 3.933
    },
    {
        "text": "meaning a thin layer of a material, and it refers to smooth flow in a fluid, ",
        "start": 219.173,
        "duration": 4.326
    },
    {
        "text": "where the moving particles stay largely confined to distinct layers.",
        "start": 223.499,
        "duration": 3.821
    },
    {
        "text": "Turbulence, in contrast, contains many eddies, points of some vorticity, ",
        "start": 228.04,
        "duration": 4.542
    },
    {
        "text": "also known as positive curl, also known as a high swirly swirly factor, ",
        "start": 232.582,
        "duration": 4.48
    },
    {
        "text": "breaking down the notion of distinct layers.",
        "start": 237.062,
        "duration": 2.738
    },
    {
        "text": "However, vorticity does not necessarily imply that a flow is turbulent.",
        "start": 240.56,
        "duration": 4.12
    },
    {
        "text": "Patterns like whirlpools or even smoke rings have high vorticity since ",
        "start": 245.54,
        "duration": 3.786
    },
    {
        "text": "the fluid is rotating, but can nevertheless be smooth and predictable.",
        "start": 249.326,
        "duration": 3.734
    },
    {
        "text": "Instead, turbulence is further characterized as being chaotic, ",
        "start": 253.82,
        "duration": 3.447
    },
    {
        "text": "meaning small changes to the initial conditions result in large changes to the ",
        "start": 257.267,
        "duration": 4.322
    },
    {
        "text": "ensuing patterns.",
        "start": 261.589,
        "duration": 0.931
    },
    {
        "text": "It's also diffusive in the sense of mixing together different parts of the fluid, ",
        "start": 263.2,
        "duration": 4.393
    },
    {
        "text": "and diffusing the energy and momentum from isolated parts of the fluid to the rest.",
        "start": 267.593,
        "duration": 4.447
    },
    {
        "text": "Notice how in this clip, over time, the image shifts from having a crisp ",
        "start": 272.62,
        "duration": 4.484
    },
    {
        "text": "delineation between fog and air to instead being a murky mixture of both of them.",
        "start": 277.104,
        "duration": 4.976
    },
    {
        "text": "As to something more mathematically precise, there's not really a single widely ",
        "start": 282.96,
        "duration": 4.506
    },
    {
        "text": "agreed upon clear-cut criterion the way there is for most other terms in math.",
        "start": 287.466,
        "duration": 4.394
    },
    {
        "text": "The intricacy of the patterns you're seeing is mirrored by a ",
        "start": 292.42,
        "duration": 3.137
    },
    {
        "text": "difficulty to parse the physics describing all of this, ",
        "start": 295.557,
        "duration": 2.88
    },
    {
        "text": "and that can make the notion of a rigorous definition somewhat slippery.",
        "start": 298.437,
        "duration": 3.703
    },
    {
        "text": "You see, the fundamental equations describing fluid dynamics, ",
        "start": 303.02,
        "duration": 3.3
    },
    {
        "text": "the Navier-Stokes equations, are famously challenging to understand.",
        "start": 306.32,
        "duration": 3.62
    },
    {
        "text": "We won't go through the full details here, but if you're curious, ",
        "start": 310.38,
        "duration": 3.634
    },
    {
        "text": "the main equation is essentially a form of Newton's second law, ",
        "start": 314.014,
        "duration": 3.524
    },
    {
        "text": "that the acceleration of a body times its mass equals the sum of the forces acting on it.",
        "start": 317.538,
        "duration": 4.902
    },
    {
        "text": "It's just that writing mass times acceleration looks a bit more complicated in this ",
        "start": 322.88,
        "duration": 4.561
    },
    {
        "text": "context, and the force is broken down into the different types of forces acting on ",
        "start": 327.441,
        "duration": 4.508
    },
    {
        "text": "a fluid, which again can look a bit intimidating in the context of continuum dynamics.",
        "start": 331.949,
        "duration": 4.671
    },
    {
        "text": "Not only are these hard to solve in the sense of feeding in some initial state ",
        "start": 337.52,
        "duration": 4.111
    },
    {
        "text": "of a fluid and figuring out how the equations predict that fluid will evolve, ",
        "start": 341.631,
        "duration": 4.059
    },
    {
        "text": "there are several unsolved problems around a much more modest task of ",
        "start": 345.69,
        "duration": 3.642
    },
    {
        "text": "understanding whether or not quote-unquote reasonable solutions will always exist.",
        "start": 349.332,
        "duration": 4.268
    },
    {
        "text": "Reasonable here means things like not blowing up to a point of having infinite ",
        "start": 354.6,
        "duration": 4.336
    },
    {
        "text": "kinetic energy, and that smooth initial states yield smooth solutions, ",
        "start": 358.936,
        "duration": 3.897
    },
    {
        "text": "where the word smooth carries with it a very precise meaning in this context.",
        "start": 362.833,
        "duration": 4.227
    },
    {
        "text": "The questions formalizing the idea of these equations predicting ",
        "start": 367.88,
        "duration": 3.591
    },
    {
        "text": "reasonable behavior actually have a $1 million prize associated with them.",
        "start": 371.471,
        "duration": 4.089
    },
    {
        "text": "And all of that is just for the case of incompressible fluid flow, ",
        "start": 376.0,
        "duration": 3.556
    },
    {
        "text": "where something compressible like air makes things trickier still.",
        "start": 379.556,
        "duration": 3.504
    },
    {
        "text": "And the heart of the difficulty, both for the specific solutions and the general ",
        "start": 383.68,
        "duration": 4.215
    },
    {
        "text": "theoretical results surrounding them, is that tricky-to-pin-down phenomenon of turbulence.",
        "start": 387.895,
        "duration": 4.685
    },
    {
        "text": "But we're not completely in the dark.",
        "start": 393.7,
        "duration": 1.8
    },
    {
        "text": "The hard work of a lot of smart people throughout history has led us to ",
        "start": 395.82,
        "duration": 3.515
    },
    {
        "text": "understanding some of the patterns underlying this chaos, ",
        "start": 399.335,
        "duration": 2.832
    },
    {
        "text": "and I'd like to share with you one found by the 19th century mathematician ",
        "start": 402.167,
        "duration": 3.662
    },
    {
        "text": "Andrei Komagorov.",
        "start": 405.829,
        "duration": 0.831
    },
    {
        "text": "It has to do with how kinetic energy in turbulent ",
        "start": 406.98,
        "duration": 2.666
    },
    {
        "text": "motion is distributed at different length scales.",
        "start": 409.646,
        "duration": 2.614
    },
    {
        "text": "In simpler-to-think-about physics, we often think about kinetic ",
        "start": 415.3,
        "duration": 3.699
    },
    {
        "text": "energy at two different length scales, a macroscale, ",
        "start": 418.999,
        "duration": 3.064
    },
    {
        "text": "say the energy carried by your moving car, or a molecular scale, which we call heat.",
        "start": 422.063,
        "duration": 4.857
    },
    {
        "text": "As you apply your brakes, energy is transferred more or less directly from that ",
        "start": 427.64,
        "duration": 4.345
    },
    {
        "text": "macroscale motion to the molecular scale motion, ",
        "start": 431.985,
        "duration": 2.662
    },
    {
        "text": "as your brakes and the surrounding air heats up, ",
        "start": 434.647,
        "duration": 2.662
    },
    {
        "text": "meaning all of their molecules start jiggling even faster.",
        "start": 437.309,
        "duration": 3.151
    },
    {
        "text": "Turbulence, on the other hand, is characterized by kinetic energy ",
        "start": 441.56,
        "duration": 3.388
    },
    {
        "text": "at a whole spectrum of length scales, from the movement of large ",
        "start": 444.948,
        "duration": 3.337
    },
    {
        "text": "eddies to smaller ones and smaller ones and smaller ones still.",
        "start": 448.285,
        "duration": 3.235
    },
    {
        "text": "Moreover, this energy tends to cascade down the spectrum, ",
        "start": 452.08,
        "duration": 3.402
    },
    {
        "text": "where what I mean by that is that the energy of large eddies gets ",
        "start": 455.482,
        "duration": 3.872
    },
    {
        "text": "converted into that of smaller eddies, which in turn bring about smaller eddies still.",
        "start": 459.354,
        "duration": 5.046
    },
    {
        "text": "This goes on until it's small enough that the energy dissipates directly ",
        "start": 464.9,
        "duration": 3.871
    },
    {
        "text": "to heat in the fluid, which is to say molecular scale jiggling, ",
        "start": 468.771,
        "duration": 3.394
    },
    {
        "text": "due to the fluid's viscosity, which is to say how much the particles tug at each other.",
        "start": 472.165,
        "duration": 4.615
    },
    {
        "text": "Or, as this was all phrased in a poem by Lewis F.",
        "start": 477.24,
        "duration": 3.0
    },
    {
        "text": "Richardson, Big whorls have little whorls which feed on their velocity, ",
        "start": 480.48,
        "duration": 3.8
    },
    {
        "text": "and little whorls have lesser whorls, and so on to viscosity.",
        "start": 484.28,
        "duration": 3.22
    },
    {
        "text": "Now you might wonder whether more of the kinetic energy of this fluid is ",
        "start": 488.5,
        "duration": 4.488
    },
    {
        "text": "carried by all of the larger eddies, say all those with diameter 1 meter, ",
        "start": 492.988,
        "duration": 4.55
    },
    {
        "text": "or by all of the smaller ones, say all those with diameter 1 cm, counted together.",
        "start": 497.538,
        "duration": 5.042
    },
    {
        "text": "Or more generally, if you were to look at all of the swirls with a diameter d, ",
        "start": 503.12,
        "duration": 4.124
    },
    {
        "text": "about how much of the fluid's total energy do they collectively carry?",
        "start": 507.244,
        "duration": 3.656
    },
    {
        "text": "Is that even an answerable question?",
        "start": 511.44,
        "duration": 1.9
    },
    {
        "text": "Komagorov hypothesized that the amount of energy in a turbulent flow carried by ",
        "start": 515.12,
        "duration": 4.858
    },
    {
        "text": "eddies with diameter d tends to be proportional to d to the power 5 thirds, ",
        "start": 519.978,
        "duration": 4.615
    },
    {
        "text": "at least within a specific range of length scales known fancifully as the inertial ",
        "start": 524.593,
        "duration": 5.04
    },
    {
        "text": "subrange.",
        "start": 529.633,
        "duration": 0.547
    },
    {
        "text": "For air, this ranges from about 0.1 cm up to 1 km.",
        "start": 530.84,
        "duration": 4.38
    },
    {
        "text": "This fact has since been verified by experiment many times over.",
        "start": 536.2,
        "duration": 3.3
    },
    {
        "text": "It would appear that 5 thirds is a sort of fundamental constant of turbulence.",
        "start": 539.5,
        "duration": 4.84
    },
    {
        "text": "It's an oddly specific fact, I know, but what I love about ",
        "start": 545.52,
        "duration": 3.024
    },
    {
        "text": "the existence of a constant like this is that it suggests there's some predictability, ",
        "start": 548.544,
        "duration": 4.461
    },
    {
        "text": "however slight, to this whole mass.",
        "start": 553.005,
        "duration": 1.795
    },
    {
        "text": "There is something ironic about talking about this energy cascade while viewing ",
        "start": 557.859,
        "duration": 4.333
    },
    {
        "text": "two-dimensional slices of a fluid, because it is a distinctly three-dimensional ",
        "start": 562.192,
        "duration": 4.332
    },
    {
        "text": "phenomenon.",
        "start": 566.524,
        "duration": 0.596
    },
    {
        "text": "While fluid flow in two dimensions can have a sort of turbulence, ",
        "start": 567.7,
        "duration": 3.725
    },
    {
        "text": "this energy transfer actually tends to go the other way, ",
        "start": 571.425,
        "duration": 3.217
    },
    {
        "text": "from the small scales up to larger ones.",
        "start": 574.642,
        "duration": 2.258
    },
    {
        "text": "So keep in mind, while you're looking at this 2d slice of turbulence, ",
        "start": 577.56,
        "duration": 3.52
    },
    {
        "text": "it's actually very different in character from turbulence in 2d.",
        "start": 581.08,
        "duration": 3.22
    },
    {
        "text": "One of the mechanisms behind this energy cascade, ",
        "start": 587.02,
        "duration": 2.735
    },
    {
        "text": "which could only ever happen in three dimensions, is a process known as vortex stretching.",
        "start": 589.755,
        "duration": 4.925
    },
    {
        "text": "A rotating part of the fluid will tend to stretch out perpendicular ",
        "start": 595.099,
        "duration": 4.14
    },
    {
        "text": "to the plane of rotation, resulting in smaller eddies spinning faster.",
        "start": 599.239,
        "duration": 4.261
    },
    {
        "text": "This transition from energy held in a large vortex to instead being held in smaller ",
        "start": 604.3,
        "duration": 4.77
    },
    {
        "text": "vortices would be impossible if there weren't another dimension to stretch in.",
        "start": 609.07,
        "duration": 4.43
    },
    {
        "text": "Or if this vortex were bent around to meet itself in a ring shape, ",
        "start": 613.82,
        "duration": 4.037
    },
    {
        "text": "in a way it's like a vortex which is blocking itself from stretching out this way.",
        "start": 617.857,
        "duration": 4.943
    },
    {
        "text": "And as mentioned earlier, this is indeed a surprisingly stable configuration for a fluid, ",
        "start": 623.23,
        "duration": 5.177
    },
    {
        "text": "order amidst chaos.",
        "start": 628.407,
        "duration": 1.093
    },
    {
        "text": "Interestingly though, when we made these vortex rings in practice and followed them ",
        "start": 630.72,
        "duration": 4.111
    },
    {
        "text": "over a long period of time, they do have a tendency to slowly stretch out, ",
        "start": 634.831,
        "duration": 3.67
    },
    {
        "text": "albeit at a much longer time scale than the vortex stretching I was just talking about.",
        "start": 638.501,
        "duration": 4.259
    },
    {
        "text": "Which brings us back to Diana and Dan.",
        "start": 643.44,
        "duration": 2.0
    },
    {
        "text": "Huge thanks to the both of them for getting so much footage and making all of this happen.",
        "start": 646.02,
        "duration": 3.48
    },
    {
        "text": "Make sure to hop over to Physics Girl now to see some of the vortex ring demos, ",
        "start": 649.86,
        "duration": 3.689
    },
    {
        "text": "and as I said, you'll also get to learn about something that happens ",
        "start": 653.549,
        "duration": 3.183
    },
    {
        "text": "when you change the shape of the hole in this vortex cannon.",
        "start": 656.732,
        "duration": 2.768
    },
    {
        "text": "The result and its specifics certainly surprised me, ",
        "start": 660.16,
        "duration": 9.575
    },
    {
        "text": "and you'll get to hear it through Diana's typical, and infectious, ",
        "start": 669.735,
        "duration": 12.104
    },
    {
        "text": "superhuman level of enthusiasm.",
        "start": 681.839,
        "duration": 5.601
    }
]