[
    {
        "text": "I've got several fun things for you this video.",
        "start": 4.3,
        "duration": 2.32
    },
    {
        "text": "An unsolved problem, a very elegant solution to a weaker version of the problem, ",
        "start": 7.12,
        "duration": 4.239
    },
    {
        "text": "and a little bit about what topology is and why people care.",
        "start": 11.359,
        "duration": 3.141
    },
    {
        "text": "But before I jump into it, it's worth saying a ",
        "start": 15.42,
        "duration": 2.202
    },
    {
        "text": "few words on why I'm excited to share this solution.",
        "start": 17.622,
        "duration": 2.438
    },
    {
        "text": "When I was a kid, since I loved math and sought out various mathy things, ",
        "start": 20.92,
        "duration": 3.873
    },
    {
        "text": "I would occasionally find myself in some talk or a seminar where people ",
        "start": 24.793,
        "duration": 3.768
    },
    {
        "text": "wanted to get the youth excited about things that mathematicians care about.",
        "start": 28.561,
        "duration": 3.979
    },
    {
        "text": "A very common go-to topic to excite our imaginations was topology.",
        "start": 33.34,
        "duration": 4.12
    },
    {
        "text": "We might be shown something like a mobius strip, ",
        "start": 38.18,
        "duration": 2.482
    },
    {
        "text": "maybe building it out of construction paper by twisting a rectangle and gluing its ends.",
        "start": 40.662,
        "duration": 4.458
    },
    {
        "text": "Look, we'd be told, as we were asked to draw a line along the surface.",
        "start": 45.64,
        "duration": 3.48
    },
    {
        "text": "It's a surface with just one side.",
        "start": 49.4,
        "duration": 2.3
    },
    {
        "text": "Or we might be told that topologists view coffee mugs and donuts as the same thing, ",
        "start": 52.42,
        "duration": 4.623
    },
    {
        "text": "since each has just one hole.",
        "start": 57.043,
        "duration": 1.597
    },
    {
        "text": "But these kinds of demos always left a lurking question.",
        "start": 59.58,
        "duration": 2.78
    },
    {
        "text": "How is this math?",
        "start": 63.0,
        "duration": 0.98
    },
    {
        "text": "How does any of this actually help to solve problems?",
        "start": 64.239,
        "duration": 2.421
    },
    {
        "text": "It wasn't until I saw the problem that I'm about to show you, ",
        "start": 67.74,
        "duration": 2.999
    },
    {
        "text": "with its elegant and surprising solution, that I started to understand why ",
        "start": 70.739,
        "duration": 3.628
    },
    {
        "text": "mathematicians actually care about some of these shapes and the properties they have.",
        "start": 74.367,
        "duration": 4.113
    },
    {
        "text": "So, there's this unsolved problem called the inscribed square problem.",
        "start": 80.88,
        "duration": 3.84
    },
    {
        "text": "If you have a closed loop, meaning you squiggle some line through space in a ",
        "start": 85.02,
        "duration": 3.906
    },
    {
        "text": "potentially crazy way and you end up back where you started, ",
        "start": 88.926,
        "duration": 3.094
    },
    {
        "text": "the question is whether or not you'll always be able to find four points on this ",
        "start": 92.02,
        "duration": 4.11
    },
    {
        "text": "loop that make up a square.",
        "start": 96.13,
        "duration": 1.37
    },
    {
        "text": "If your closed loop was a circle, for example, ",
        "start": 98.46,
        "duration": 2.272
    },
    {
        "text": "it's quite easy to find an inscribed square.",
        "start": 100.732,
        "duration": 2.128
    },
    {
        "text": "Infinitely many, in fact.",
        "start": 103.4,
        "duration": 1.16
    },
    {
        "text": "If your loop was instead an ellipse, it's still pretty easy to find an inscribed square.",
        "start": 108.96,
        "duration": 4.58
    },
    {
        "text": "The question is whether or not every possible closed loop, ",
        "start": 114.44,
        "duration": 3.281
    },
    {
        "text": "no matter how crazy, has at least one inscribed square.",
        "start": 117.721,
        "duration": 3.059
    },
    {
        "text": "Pretty interesting, right?",
        "start": 121.8,
        "duration": 0.92
    },
    {
        "text": "I mean, just the fact that this is unsolved is interesting, ",
        "start": 123.24,
        "duration": 3.393
    },
    {
        "text": "that the current tools of math can neither confirm nor deny that there's some loop with ",
        "start": 126.633,
        "duration": 4.976
    },
    {
        "text": "no inscribed square in it.",
        "start": 131.609,
        "duration": 1.471
    },
    {
        "text": "Now, if we weaken the question a bit and ask about inscribed rectangles ",
        "start": 133.92,
        "duration": 4.268
    },
    {
        "text": "instead of inscribed squares, it's still pretty hard, but there is a beautiful, ",
        "start": 138.188,
        "duration": 4.742
    },
    {
        "text": "video-worthy solution that might actually be my favorite piece of math.",
        "start": 142.93,
        "duration": 4.21
    },
    {
        "text": "The idea is to shift the focus away from individual ",
        "start": 148.24,
        "duration": 2.77
    },
    {
        "text": "points on the loop and instead onto pairs of points.",
        "start": 151.01,
        "duration": 2.77
    },
    {
        "text": "We'll use the following fact about rectangles.",
        "start": 154.96,
        "duration": 2.02
    },
    {
        "text": "Let's label the vertices of some rectangle ABCD.",
        "start": 157.619,
        "duration": 3.701
    },
    {
        "text": "Then the pair of points AC has a few things in common with the pair of points BD.",
        "start": 161.8,
        "duration": 4.6
    },
    {
        "text": "The distance between A and C equals the distance between B and D, ",
        "start": 167.34,
        "duration": 4.089
    },
    {
        "text": "and the midpoint of A and C is the same as the midpoint of B and D.",
        "start": 171.429,
        "duration": 4.151
    },
    {
        "text": "In fact, any time you have two separate pairs of points in space, AC and BD, ",
        "start": 176.38,
        "duration": 4.947
    },
    {
        "text": "if you can guarantee that they share a midpoint and that the distance between AC equals ",
        "start": 181.327,
        "duration": 5.655
    },
    {
        "text": "the distance between B and D, it's enough to guarantee that those four points make up ",
        "start": 186.982,
        "duration": 5.526
    },
    {
        "text": "a rectangle.",
        "start": 192.508,
        "duration": 0.772
    },
    {
        "text": "So what we're going to do is try to prove that for any closed loop, ",
        "start": 194.58,
        "duration": 3.492
    },
    {
        "text": "it's always possible to find two distinct pairs of points on that ",
        "start": 198.072,
        "duration": 3.389
    },
    {
        "text": "loop that share a midpoint and which are the same distance apart.",
        "start": 201.461,
        "duration": 3.339
    },
    {
        "text": "Take a moment to make sure that's clear.",
        "start": 205.74,
        "duration": 1.44
    },
    {
        "text": "We're finding two distinct pairs of points that share ",
        "start": 207.58,
        "duration": 3.014
    },
    {
        "text": "a common midpoint and which are the same distance apart.",
        "start": 210.594,
        "duration": 3.126
    },
    {
        "text": "The way we'll go about this is to define a function that takes ",
        "start": 217.96,
        "duration": 3.507
    },
    {
        "text": "in pairs of points on the loop and outputs a single point in 3D space, ",
        "start": 221.467,
        "duration": 3.952
    },
    {
        "text": "which kind of encodes the midpoint and distance information.",
        "start": 225.419,
        "duration": 3.341
    },
    {
        "text": "It will be sort of like a graph.",
        "start": 229.18,
        "duration": 1.48
    },
    {
        "text": "Consider the closed loop to be sitting on the xy-plane in 3D space.",
        "start": 232.44,
        "duration": 4.2
    },
    {
        "text": "For a given pair of points, label their midpoint m, ",
        "start": 237.38,
        "duration": 3.112
    },
    {
        "text": "which will be some point on the xy-plane, and label the distance between them d.",
        "start": 240.492,
        "duration": 4.788
    },
    {
        "text": "Plot the point, which is exactly d units above that midpoint m in the z-direction.",
        "start": 246.32,
        "duration": 5.46
    },
    {
        "text": "As you do this for many possible pairs of points, ",
        "start": 254.72,
        "duration": 3.051
    },
    {
        "text": "you'll effectively be drawing through 3D space.",
        "start": 257.771,
        "duration": 2.869
    },
    {
        "text": "And if you do it for all possible pairs of points on the loop, ",
        "start": 261.279,
        "duration": 3.313
    },
    {
        "text": "you'll draw out some kind of surface above the plane.",
        "start": 264.592,
        "duration": 2.788
    },
    {
        "text": "Now look at the surface, and notice how it seems to hug the loop itself.",
        "start": 268.8,
        "duration": 3.56
    },
    {
        "text": "This is actually going to be important later, so let's think about why it happens.",
        "start": 273.08,
        "duration": 3.28
    },
    {
        "text": "As the pair of points on the loop gets closer and closer, the plotted point gets lower, ",
        "start": 278.34,
        "duration": 4.837
    },
    {
        "text": "since its height is by definition equal to the distance between the points.",
        "start": 283.177,
        "duration": 4.123
    },
    {
        "text": "Also, the midpoint gets closer and closer to the loop as the points approach each other.",
        "start": 287.3,
        "duration": 4.82
    },
    {
        "text": "Once the pair of points coincides, meaning the input of our ",
        "start": 293.24,
        "duration": 3.498
    },
    {
        "text": "function looks like xx for some point x on the loop, ",
        "start": 296.738,
        "duration": 3.09
    },
    {
        "text": "the plotted point of the surface will be exactly on the loop at the point x.",
        "start": 299.828,
        "duration": 4.432
    },
    {
        "text": "Okay, so remember that.",
        "start": 305.52,
        "duration": 1.16
    },
    {
        "text": "Another important fact is that this function is continuous, ",
        "start": 307.22,
        "duration": 3.287
    },
    {
        "text": "and all that really means is that if you slightly adjust a given pair of points, ",
        "start": 310.507,
        "duration": 4.437
    },
    {
        "text": "then the corresponding output in 3D is only slightly adjusted as well.",
        "start": 314.944,
        "duration": 3.836
    },
    {
        "text": "There's never a sudden discontinuous jump.",
        "start": 319.22,
        "duration": 2.12
    },
    {
        "text": "Our goal, then, is to show that this function has a collision, ",
        "start": 322.56,
        "duration": 3.854
    },
    {
        "text": "that two distinct pairs of points each map to the same spot in 3D space.",
        "start": 326.414,
        "duration": 4.406
    },
    {
        "text": "Because the only way for that to happen is if they share a common midpoint, ",
        "start": 331.52,
        "duration": 4.072
    },
    {
        "text": "and if their distance d apart from each other is the same.",
        "start": 335.592,
        "duration": 3.108
    },
    {
        "text": "So in some sense, finding an inscribed rectangle comes ",
        "start": 340.18,
        "duration": 3.329
    },
    {
        "text": "down to showing that this surface has to intersect itself.",
        "start": 343.509,
        "duration": 3.511
    },
    {
        "text": "To move forward from here, we need to build up a ",
        "start": 351.54,
        "duration": 2.547
    },
    {
        "text": "relationship with the idea of pairs of points on a loop.",
        "start": 354.087,
        "duration": 2.913
    },
    {
        "text": "Think about how we represent pairs of real numbers ",
        "start": 358.68,
        "duration": 2.793
    },
    {
        "text": "using a two-dimensional coordinate plane.",
        "start": 361.473,
        "duration": 2.247
    },
    {
        "text": "Analogous to this, we're going to seek out a certain 2D surface ",
        "start": 368.08,
        "duration": 3.35
    },
    {
        "text": "which naturally represents all pairs of points on the loop.",
        "start": 371.43,
        "duration": 3.09
    },
    {
        "text": "Understanding the properties of this surface will help to show ",
        "start": 375.36,
        "duration": 3.532
    },
    {
        "text": "why the graph that we just defined has to intersect itself.",
        "start": 378.892,
        "duration": 3.308
    },
    {
        "text": "Now, when I say pair of points, there are two things that I could be talking about.",
        "start": 383.14,
        "duration": 3.72
    },
    {
        "text": "The first is ordered pairs of points, which would mean a ",
        "start": 387.48,
        "duration": 3.095
    },
    {
        "text": "pair like AB would be considered distinct from the pair BA.",
        "start": 390.575,
        "duration": 3.205
    },
    {
        "text": "That is, there's some notion of which point is the first one.",
        "start": 394.42,
        "duration": 2.96
    },
    {
        "text": "The second idea is unordered points, where AB and BA would be considered the same thing, ",
        "start": 399.12,
        "duration": 5.235
    },
    {
        "text": "where all that really matters is what the points are, ",
        "start": 404.355,
        "duration": 3.177
    },
    {
        "text": "and there's no meaning to which one is first.",
        "start": 407.532,
        "duration": 2.648
    },
    {
        "text": "Ultimately, we want to understand unordered pairs of points, ",
        "start": 411.0,
        "duration": 2.928
    },
    {
        "text": "but to get there, we need to take a path of thought through ordered pairs.",
        "start": 413.928,
        "duration": 3.552
    },
    {
        "text": "We'll start out by straightening out the loop, ",
        "start": 419.54,
        "duration": 2.345
    },
    {
        "text": "cutting it at some point, and deforming it into an interval.",
        "start": 421.885,
        "duration": 2.995
    },
    {
        "text": "For the sake of having some labels, let's say that ",
        "start": 425.44,
        "duration": 2.535
    },
    {
        "text": "this is the interval on the number line from 0 to 1.",
        "start": 427.975,
        "duration": 2.585
    },
    {
        "text": "By following where each point ends up, every point on the loop corresponds with a ",
        "start": 431.62,
        "duration": 5.183
    },
    {
        "text": "unique number on this interval, except for the point where the cut happened, ",
        "start": 436.803,
        "duration": 4.868
    },
    {
        "text": "which corresponds simultaneously to both endpoints of the interval, ",
        "start": 441.671,
        "duration": 4.298
    },
    {
        "text": "meaning the numbers 0 and 1.",
        "start": 445.969,
        "duration": 1.771
    },
    {
        "text": "Now, the benefit of straightening out this loop like this is that we can start ",
        "start": 448.96,
        "duration": 3.577
    },
    {
        "text": "thinking about pairs of points the same way we think about pairs of numbers.",
        "start": 452.537,
        "duration": 3.443
    },
    {
        "text": "Make a y-axis using a second interval, then associate each pair of values ",
        "start": 458.56,
        "duration": 5.01
    },
    {
        "text": "on the interval with a single point in this 1x1 square that they span out.",
        "start": 463.57,
        "duration": 5.01
    },
    {
        "text": "Every individual point of this square naturally corresponds to a pair of ",
        "start": 469.72,
        "duration": 4.306
    },
    {
        "text": "points on the loop, since its x and y coordinates are each numbers between 0 and 1, ",
        "start": 474.026,
        "duration": 4.956
    },
    {
        "text": "which are in turn associated to some unique point on the loop.",
        "start": 478.982,
        "duration": 3.658
    },
    {
        "text": "Remember, we're trying to find a surface that naturally represents the set of ",
        "start": 483.52,
        "duration": 3.973
    },
    {
        "text": "all pairs of points on the loop, and this square is the first step to doing that.",
        "start": 487.493,
        "duration": 4.127
    },
    {
        "text": "The problem is that there's some ambiguity when it comes to the edges of the square.",
        "start": 492.7,
        "duration": 3.86
    },
    {
        "text": "Remember, the endpoints 0 and 1 on the interval really correspond to ",
        "start": 497.68,
        "duration": 3.806
    },
    {
        "text": "the same point of the loop, as if to say that those endpoints need to ",
        "start": 501.486,
        "duration": 3.862
    },
    {
        "text": "be glued together if we're going to faithfully map back to the loop.",
        "start": 505.348,
        "duration": 3.752
    },
    {
        "text": "So all of the points on the left edge of the square, like 0, 0, 0.1, 0, 0.2, ",
        "start": 509.9,
        "duration": 5.112
    },
    {
        "text": "on and on and on, really represent the same pair of points on the loop as the ",
        "start": 515.012,
        "duration": 5.179
    },
    {
        "text": "corresponding coordinates on the right edge of the square, 1, 0.1, 1, 0.2, ",
        "start": 520.191,
        "duration": 4.98
    },
    {
        "text": "on and on and on.",
        "start": 525.171,
        "duration": 1.129
    },
    {
        "text": "So for this square to represent the pairs of points on the loop in a unique way, ",
        "start": 527.02,
        "duration": 4.548
    },
    {
        "text": "we need to glue this left edge to the right edge.",
        "start": 531.568,
        "duration": 2.752
    },
    {
        "text": "I'll mark each edge with some arrows to remember how the edges need to be lined up.",
        "start": 535.3,
        "duration": 4.1
    },
    {
        "text": "Likewise, the bottom edge needs to be glued to the top edge, ",
        "start": 540.6,
        "duration": 3.465
    },
    {
        "text": "since y-coordinates of 0 and 1 really represent the same second point in a given pair ",
        "start": 544.065,
        "duration": 4.885
    },
    {
        "text": "of points on the loop.",
        "start": 548.95,
        "duration": 1.25
    },
    {
        "text": "If you bend this square to perform the gluing, ",
        "start": 553.82,
        "duration": 2.656
    },
    {
        "text": "first rolling it into a cylinder to glue the left and right edges, ",
        "start": 556.476,
        "duration": 3.787
    },
    {
        "text": "then gluing the ends of that cylinder, which represent the top and bottom edges, ",
        "start": 560.263,
        "duration": 4.578
    },
    {
        "text": "we get a torus, better known as the surface of a doughnut.",
        "start": 564.841,
        "duration": 3.279
    },
    {
        "text": "Every individual point on this torus corresponds to a unique pair of points on the loop, ",
        "start": 569.48,
        "duration": 5.028
    },
    {
        "text": "and likewise, every pair of points on the loop corresponds to ",
        "start": 574.508,
        "duration": 3.503
    },
    {
        "text": "some unique point on this torus.",
        "start": 578.011,
        "duration": 1.809
    },
    {
        "text": "The torus is to pair of points on the loop what the ",
        "start": 580.54,
        "duration": 2.915
    },
    {
        "text": "xy-plane is to pairs of points on the real number line.",
        "start": 583.455,
        "duration": 3.085
    },
    {
        "text": "The key property of this association is that it's continuous both ways, ",
        "start": 589.72,
        "duration": 4.046
    },
    {
        "text": "meaning if you nudge any point on the torus by just a tiny amount, ",
        "start": 593.766,
        "duration": 3.766
    },
    {
        "text": "it corresponds to only a very slight nudge to the pair of points on the loop, ",
        "start": 597.532,
        "duration": 4.384
    },
    {
        "text": "and vice versa.",
        "start": 601.916,
        "duration": 0.844
    },
    {
        "text": "So if the torus is the natural shape for ordered pairs of points on the loop, ",
        "start": 605.14,
        "duration": 3.995
    },
    {
        "text": "what's the natural shape for unordered pairs?",
        "start": 609.135,
        "duration": 2.305
    },
    {
        "text": "After all, the whole reason we're doing this is to show that two distinct pairs ",
        "start": 612.2,
        "duration": 4.07
    },
    {
        "text": "of pairs of points on the loop share a midpoint and are the same distance apart.",
        "start": 616.27,
        "duration": 4.07
    },
    {
        "text": "But if we consider a pair AB to be distinct from BA, ",
        "start": 622.04,
        "duration": 3.228
    },
    {
        "text": "then that would trivially give us two separate pairs which have the same ",
        "start": 625.268,
        "duration": 4.446
    },
    {
        "text": "midpoint and distance apart.",
        "start": 629.714,
        "duration": 1.706
    },
    {
        "text": "That's like saying you can always find a rectangle so ",
        "start": 632.28,
        "duration": 2.584
    },
    {
        "text": "long as you consider any pair of points to be a rectangle.",
        "start": 634.864,
        "duration": 2.776
    },
    {
        "text": "Not helpful.",
        "start": 638.22,
        "duration": 0.62
    },
    {
        "text": "So let's think about this.",
        "start": 640.2,
        "duration": 1.3
    },
    {
        "text": "Let's think about how to represent unordered pairs ",
        "start": 641.68,
        "duration": 2.423
    },
    {
        "text": "of points looking back at our unit square.",
        "start": 644.103,
        "duration": 1.997
    },
    {
        "text": "We need to say that the coordinates 0.2, 0.3 represent the same pair as 0.3, 0.2.",
        "start": 646.52,
        "duration": 7.52
    },
    {
        "text": "Or that 0.5, 0.7 really represents the same thing as 0.7, 0.5.",
        "start": 654.82,
        "duration": 5.9
    },
    {
        "text": "And in general, any coordinates x, y has to represent the same thing as y, x.",
        "start": 662.48,
        "duration": 4.84
    },
    {
        "text": "Once again, we capture this idea by gluing points together when they're supposed to ",
        "start": 671.28,
        "duration": 4.991
    },
    {
        "text": "represent the same pair, which in this case requires folding the square over diagonally.",
        "start": 676.271,
        "duration": 5.229
    },
    {
        "text": "Now notice this diagonal line, the crease of the fold.",
        "start": 683.58,
        "duration": 2.92
    },
    {
        "text": "It represents all pairs of points that look like xx, ",
        "start": 687.28,
        "duration": 2.858
    },
    {
        "text": "meaning the pairs which are really just a single point written twice.",
        "start": 690.138,
        "duration": 3.722
    },
    {
        "text": "Right now, it's marked with a red line.",
        "start": 694.8,
        "duration": 1.76
    },
    {
        "text": "And you should remember it.",
        "start": 697.02,
        "duration": 0.98
    },
    {
        "text": "It will become important to know where all of these pairs like xx live.",
        "start": 698.26,
        "duration": 3.9
    },
    {
        "text": "But we still have some arrows to glue together here.",
        "start": 703.02,
        "duration": 2.4
    },
    {
        "text": "We need to glue that bottom edge to the right edge.",
        "start": 705.42,
        "duration": 2.54
    },
    {
        "text": "And the orientation with which we do this is going to be important.",
        "start": 708.94,
        "duration": 2.86
    },
    {
        "text": "Points towards the left of the bottom edge have to be ",
        "start": 712.42,
        "duration": 2.26
    },
    {
        "text": "glued to points towards the bottom of the right edge.",
        "start": 714.68,
        "duration": 2.22
    },
    {
        "text": "And points towards the right of the bottom edge have ",
        "start": 717.36,
        "duration": 2.129
    },
    {
        "text": "to be glued to points towards the top of the right edge.",
        "start": 719.489,
        "duration": 2.251
    },
    {
        "text": "It's weird to think about, right?",
        "start": 722.36,
        "duration": 1.68
    },
    {
        "text": "Go ahead, pause and ponder this for a moment.",
        "start": 724.58,
        "duration": 1.96
    },
    {
        "text": "The trick, which is kind of clever, is to make a diagonal cut, ",
        "start": 729.44,
        "duration": 2.964
    },
    {
        "text": "which we need to remember to glue back in just a moment.",
        "start": 732.404,
        "duration": 2.636
    },
    {
        "text": "After that, we can glue the bottom and the right like so.",
        "start": 735.62,
        "duration": 3.0
    },
    {
        "text": "But notice the orientation of the arrows here.",
        "start": 742.02,
        "duration": 2.18
    },
    {
        "text": "To glue back what we just cut, we don't simply ",
        "start": 744.74,
        "duration": 2.289
    },
    {
        "text": "connect the edges of this rectangle to get a cylinder.",
        "start": 747.029,
        "duration": 2.631
    },
    {
        "text": "We have to make a twist.",
        "start": 750.24,
        "duration": 1.08
    },
    {
        "text": "Doing this in 3D space, the shape we get is a Möbius strip.",
        "start": 752.48,
        "duration": 3.6
    },
    {
        "text": "Isn't that awesome?",
        "start": 756.74,
        "duration": 0.68
    },
    {
        "text": "Evidently, the surface which represents all pairs ",
        "start": 758.14,
        "duration": 2.725
    },
    {
        "text": "of unordered points on the loop is the Möbius strip.",
        "start": 760.865,
        "duration": 2.835
    },
    {
        "text": "And notice, the edge of this strip, shown here in red, ",
        "start": 764.34,
        "duration": 3.238
    },
    {
        "text": "represents the pairs of points that look like xx, ",
        "start": 767.578,
        "duration": 2.944
    },
    {
        "text": "those which are really just a single point listed twice.",
        "start": 770.522,
        "duration": 3.298
    },
    {
        "text": "The Möbius strip is to unordered pairs of points on ",
        "start": 776.58,
        "duration": 2.74
    },
    {
        "text": "the loop what the xy-plane is to pairs of real numbers.",
        "start": 779.32,
        "duration": 2.9
    },
    {
        "text": "That totally blew my mind when I first saw it.",
        "start": 782.92,
        "duration": 3.1
    },
    {
        "text": "Now, with this fact that there is a continuous one-to-one association ",
        "start": 788.58,
        "duration": 4.213
    },
    {
        "text": "between unordered pairs of points on the loop and individual points on this Möbius strip, ",
        "start": 792.793,
        "duration": 5.418
    },
    {
        "text": "we can solve the inscribed rectangle problem.",
        "start": 798.211,
        "duration": 2.709
    },
    {
        "text": "Remember, we had defined this special kind of graph in 3D space, ",
        "start": 802.38,
        "duration": 3.767
    },
    {
        "text": "where the loop was sitting in the xy-plane.",
        "start": 806.147,
        "duration": 2.493
    },
    {
        "text": "For each pair of points, you consider their midpoint m, which lives on the xy-plane, ",
        "start": 809.54,
        "duration": 5.211
    },
    {
        "text": "and their distance d apart, and you plot a point which is exactly d units above m.",
        "start": 814.751,
        "duration": 5.029
    },
    {
        "text": "Because of the continuous one-to-one association between pairs ",
        "start": 820.94,
        "duration": 3.975
    },
    {
        "text": "of points on the loop and the Möbius strip, this gives us a ",
        "start": 824.915,
        "duration": 3.786
    },
    {
        "text": "natural map from the Möbius strip onto this surface in 3D space.",
        "start": 828.701,
        "duration": 4.039
    },
    {
        "text": "For every point on the Möbius strip, consider the pair of points on the loop ",
        "start": 833.8,
        "duration": 4.237
    },
    {
        "text": "that it represents, then plug that pair of points into the special function.",
        "start": 838.037,
        "duration": 4.183
    },
    {
        "text": "And here's the key point.",
        "start": 846.1,
        "duration": 1.34
    },
    {
        "text": "When pairs of points on the loop are extremely close together, ",
        "start": 847.84,
        "duration": 3.375
    },
    {
        "text": "the output of the function is right above the loop itself, ",
        "start": 851.215,
        "duration": 3.16
    },
    {
        "text": "and in the extreme case of pairs of points like xx, ",
        "start": 854.375,
        "duration": 2.786
    },
    {
        "text": "the output of the function is exactly on the loop.",
        "start": 857.161,
        "duration": 2.679
    },
    {
        "text": "Since points on this red edge of the Möbius strip correspond to pairs like xx, ",
        "start": 861.82,
        "duration": 4.967
    },
    {
        "text": "when the Möbius strip is mapped onto this surface, ",
        "start": 866.787,
        "duration": 3.207
    },
    {
        "text": "it must be done in such a way that the edge of the strip gets mapped right onto ",
        "start": 869.994,
        "duration": 5.031
    },
    {
        "text": "that loop in the xy-plane.",
        "start": 875.025,
        "duration": 1.635
    },
    {
        "text": "But if you stand back and think about it for a moment, ",
        "start": 879.18,
        "duration": 3.104
    },
    {
        "text": "considering the strange shape of the Möbius strip, ",
        "start": 882.284,
        "duration": 2.879
    },
    {
        "text": "there is no way to glue its edge to something two-dimensional without ",
        "start": 885.163,
        "duration": 3.951
    },
    {
        "text": "forcing the strip to intersect itself.",
        "start": 889.114,
        "duration": 2.146
    },
    {
        "text": "Since points of the Möbius strip represent pairs of points on the loop, ",
        "start": 893.14,
        "duration": 5.416
    },
    {
        "text": "if the strip intersects itself during this mapping, ",
        "start": 898.556,
        "duration": 3.912
    },
    {
        "text": "it means that there are at least two distinct pairs of points that correspond to the same ",
        "start": 902.468,
        "duration": 6.77
    },
    {
        "text": "output on this surface, which means they share a midpoint and are the same distance ",
        "start": 909.238,
        "duration": 6.319
    },
    {
        "text": "apart, which in turn means that they form a rectangle.",
        "start": 915.557,
        "duration": 4.063
    },
    {
        "text": "And that's the proof!",
        "start": 921.18,
        "duration": 0.8
    },
    {
        "text": "Or at least, if you're willing to trust me in saying that you can't glue the edge of ",
        "start": 922.54,
        "duration": 3.943
    },
    {
        "text": "the Möbius strip to a plane without forcing it to intersect itself, then that's the proof.",
        "start": 926.483,
        "duration": 4.177
    },
    {
        "text": "This fact is intuitively clear looking at the Möbius strip, ",
        "start": 933.04,
        "duration": 3.135
    },
    {
        "text": "but in order to make it rigorous, you basically need to start developing the ",
        "start": 936.175,
        "duration": 4.024
    },
    {
        "text": "field of topology.",
        "start": 940.199,
        "duration": 0.941
    },
    {
        "text": "In fact, for any of you who have a topology class in your future, ",
        "start": 942.02,
        "duration": 3.636
    },
    {
        "text": "going through the exercise of trying to justify this is a good way to ",
        "start": 945.656,
        "duration": 3.856
    },
    {
        "text": "gain an appreciation for why topologists choose to make certain definitions.",
        "start": 949.512,
        "duration": 4.188
    },
    {
        "text": "And I want you to take note of something here.",
        "start": 954.46,
        "duration": 2.12
    },
    {
        "text": "The reason for talking about the torus and the Möbius strip ",
        "start": 956.74,
        "duration": 3.13
    },
    {
        "text": "was not because we were playing around with construction paper, ",
        "start": 959.87,
        "duration": 3.339
    },
    {
        "text": "or because we were daydreaming about deforming a coffee mug.",
        "start": 963.209,
        "duration": 3.131
    },
    {
        "text": "They came up as a natural way to understand pairs of points on a loop, ",
        "start": 967.26,
        "duration": 3.765
    },
    {
        "text": "and that's something that we needed to solve a concrete problem.",
        "start": 971.025,
        "duration": 3.395
    },
    {
        "text": "Thank you.",
        "start": 983.7,
        "duration": 4.24
    }
]