[
    {
        "text": "In the last video, you and I looked at this demo here, ",
        "start": 0.0,
        "duration": 3.018
    },
    {
        "text": "where we shine linearly polarized light through a tube full of sugar water, ",
        "start": 3.018,
        "duration": 4.171
    },
    {
        "text": "and we saw how it rather mysteriously results in these colored diagonal stripes.",
        "start": 7.189,
        "duration": 4.391
    },
    {
        "text": "There, I walked through the general outline for an explanation, ",
        "start": 12.52,
        "duration": 2.906
    },
    {
        "text": "keeping track of what questions still need to be answered.",
        "start": 15.426,
        "duration": 2.634
    },
    {
        "text": "Namely, why does sugar water twist the polarization direction of light?",
        "start": 18.6,
        "duration": 3.88
    },
    {
        "text": "Why does that twisting rate depend on the color of the light?",
        "start": 23.08,
        "duration": 2.82
    },
    {
        "text": "And why, even if you understand that this twist is happening, ",
        "start": 25.9,
        "duration": 3.18
    },
    {
        "text": "would you see any evidence of it when viewing the tube from the side, ",
        "start": 29.08,
        "duration": 3.59
    },
    {
        "text": "with no additional polarizing filters?",
        "start": 32.67,
        "duration": 1.95
    },
    {
        "text": "Here, I'd like to begin with the very fundamental idea of what light is, ",
        "start": 35.34,
        "duration": 3.616
    },
    {
        "text": "and show how the answer to these questions can emerge from an extremely minimal set of ",
        "start": 38.956,
        "duration": 4.309
    },
    {
        "text": "assumptions.",
        "start": 43.265,
        "duration": 0.595
    },
    {
        "text": "In some sense, the fundamental question of electricity and magnetism is how ",
        "start": 47.66,
        "duration": 4.801
    },
    {
        "text": "the position and motion of one charged particle influences that of another.",
        "start": 52.461,
        "duration": 4.739
    },
    {
        "text": "For example, one of the first things you learn, say in a high school physics class, ",
        "start": 57.62,
        "duration": 4.001
    },
    {
        "text": "is that charges with the same sign tend to repel each other.",
        "start": 61.621,
        "duration": 2.859
    },
    {
        "text": "And the strength of this force depends a lot on the distance between them.",
        "start": 64.72,
        "duration": 3.4
    },
    {
        "text": "If your charges are close, that repulsive force is very strong, ",
        "start": 68.12,
        "duration": 3.773
    },
    {
        "text": "but it decays very rapidly as these particles go away from each other.",
        "start": 71.893,
        "duration": 4.127
    },
    {
        "text": "Specifically, here's how you might see this written down as an equation, ",
        "start": 76.8,
        "duration": 3.193
    },
    {
        "text": "known as Coulomb's law.",
        "start": 79.993,
        "duration": 1.007
    },
    {
        "text": "The force is proportional to the charge of both of the particles, ",
        "start": 81.46,
        "duration": 3.109
    },
    {
        "text": "where it's common to use the letter q.",
        "start": 84.569,
        "duration": 1.791
    },
    {
        "text": "There are some constants in there, which for our purposes ",
        "start": 86.82,
        "duration": 2.531
    },
    {
        "text": "we can just think of as one big proportionality constant.",
        "start": 89.351,
        "duration": 2.489
    },
    {
        "text": "And the important fact is that you've got this 1 divided by r squared term, ",
        "start": 91.84,
        "duration": 4.237
    },
    {
        "text": "where r is the distance between them.",
        "start": 96.077,
        "duration": 2.063
    },
    {
        "text": "So for example, if the distance between them increases by a factor of 3, ",
        "start": 98.72,
        "duration": 4.02
    },
    {
        "text": "the force that they're applying to each other goes down by a factor of 9.",
        "start": 102.74,
        "duration": 4.02
    },
    {
        "text": "Another way you might see a law like this written down is to focus on just one ",
        "start": 107.74,
        "duration": 4.52
    },
    {
        "text": "charged particle, and then say for every point in space, ",
        "start": 112.26,
        "duration": 3.262
    },
    {
        "text": "if there was a second charge there, what force would this first charge be applying ",
        "start": 115.522,
        "duration": 4.75
    },
    {
        "text": "to that second one?",
        "start": 120.272,
        "duration": 1.088
    },
    {
        "text": "And instead of describing a force per se, you might see this ",
        "start": 122.7,
        "duration": 3.219
    },
    {
        "text": "written describing what's known as the electric field, ",
        "start": 125.919,
        "duration": 2.902
    },
    {
        "text": "which is just a way of saying what force would be applied to a unit charge.",
        "start": 128.821,
        "duration": 3.959
    },
    {
        "text": "And in this context, the word field means there's ",
        "start": 133.22,
        "duration": 2.47
    },
    {
        "text": "a value associated with every single point in space.",
        "start": 135.69,
        "duration": 2.57
    },
    {
        "text": "So the way I have it written here, it depends on a little vector r, ",
        "start": 138.74,
        "duration": 3.85
    },
    {
        "text": "which would be the vector from our charge to a given point in space, ",
        "start": 142.59,
        "duration": 3.906
    },
    {
        "text": "and the direction of this field at all points is in the same direction as r.",
        "start": 146.496,
        "duration": 4.304
    },
    {
        "text": "I bring up Coulomb's law to emphasize that it's not the full story.",
        "start": 151.6,
        "duration": 4.12
    },
    {
        "text": "There are other ways that charges influence each other.",
        "start": 156.1,
        "duration": 2.3
    },
    {
        "text": "For example, here's a phenomenon that this law alone could not explain.",
        "start": 158.74,
        "duration": 3.42
    },
    {
        "text": "If you wiggle one charge up and down, then after a little bit of a delay, ",
        "start": 162.9,
        "duration": 3.958
    },
    {
        "text": "a second charge some distance to its right will be induced to wiggle up and down as well.",
        "start": 166.858,
        "duration": 4.762
    },
    {
        "text": "We can write down a second law, which you might think of as a correction ",
        "start": 172.28,
        "duration": 3.416
    },
    {
        "text": "term to be added to Coulomb's law, that describes what's going on here.",
        "start": 175.696,
        "duration": 3.324
    },
    {
        "text": "Suppose at some point in time t0, that first charge is accelerating.",
        "start": 179.02,
        "duration": 4.56
    },
    {
        "text": "Then I'll let time play forward, but leave on the screen a kind of ghost of that ",
        "start": 184.2,
        "duration": 4.685
    },
    {
        "text": "particle indicating where it was and how it was accelerating at this time t0.",
        "start": 188.885,
        "duration": 4.455
    },
    {
        "text": "After a certain delay, this causes a force on the second charge, ",
        "start": 193.92,
        "duration": 3.76
    },
    {
        "text": "and the equation describing this force looks something like this.",
        "start": 197.68,
        "duration": 3.76
    },
    {
        "text": "So again, it's proportional to the charge of both of the particles, ",
        "start": 202.08,
        "duration": 3.373
    },
    {
        "text": "and once more a common way to write it involves this pile of ",
        "start": 205.453,
        "duration": 3.027
    },
    {
        "text": "constants that you don't really need to worry about.",
        "start": 208.48,
        "duration": 2.58
    },
    {
        "text": "The important factor I want you to notice is how the force also ",
        "start": 211.58,
        "duration": 3.378
    },
    {
        "text": "depends on the distance between the particles, ",
        "start": 214.958,
        "duration": 2.481
    },
    {
        "text": "but instead of decaying in proportion to r squared, it only decays in proportion to r.",
        "start": 217.439,
        "duration": 4.541
    },
    {
        "text": "So over long distances, this is the force that dominates, and Coulomb's law is negligible.",
        "start": 222.3,
        "duration": 5.2
    },
    {
        "text": "And then finally, it depends on the acceleration of that first particle, ",
        "start": 228.2,
        "duration": 4.155
    },
    {
        "text": "but it's not the acceleration of that particle at the current time, ",
        "start": 232.355,
        "duration": 3.872
    },
    {
        "text": "it's whatever that acceleration was at some time in the past.",
        "start": 236.227,
        "duration": 3.473
    },
    {
        "text": "How far in the past depends on the distance between the particles and the speed of light, ",
        "start": 240.36,
        "duration": 4.388
    },
    {
        "text": "denoted with c.",
        "start": 244.748,
        "duration": 0.732
    },
    {
        "text": "The way to think about it is that any form of ",
        "start": 246.06,
        "duration": 2.345
    },
    {
        "text": "influence can't propagate any faster than this speed, c.",
        "start": 248.405,
        "duration": 2.855
    },
    {
        "text": "In fact, a more accurate description of Coulomb's ",
        "start": 251.78,
        "duration": 2.447
    },
    {
        "text": "law would also involve a delay term like this.",
        "start": 254.227,
        "duration": 2.253
    },
    {
        "text": "Again, the intuitive way to read this equation is that wiggling a charge in one ",
        "start": 256.48,
        "duration": 4.611
    },
    {
        "text": "location after some delay causes a wiggle to a second charge in another location.",
        "start": 261.091,
        "duration": 4.669
    },
    {
        "text": "And actually, the way I have it written right now is a little bit wrong.",
        "start": 266.72,
        "duration": 2.82
    },
    {
        "text": "Instead of the acceleration vector here, I should really be writing ",
        "start": 269.8,
        "duration": 3.891
    },
    {
        "text": "something like a perp, indicating the component of that acceleration ",
        "start": 273.691,
        "duration": 3.948
    },
    {
        "text": "vector which is perpendicular to the line drawn between the two charges.",
        "start": 277.639,
        "duration": 4.121
    },
    {
        "text": "In other words, when you wiggle that first charge, ",
        "start": 282.32,
        "duration": 2.514
    },
    {
        "text": "the direction that the second charge wiggles is always perpendicular ",
        "start": 284.834,
        "duration": 3.403
    },
    {
        "text": "to the line between them, and the amount that it wiggles gets weaker ",
        "start": 288.237,
        "duration": 3.402
    },
    {
        "text": "and weaker when that line between them is more lined up with the initial acceleration.",
        "start": 291.639,
        "duration": 4.241
    },
    {
        "text": "As before, this is something you might see written down in a way that ",
        "start": 297.18,
        "duration": 3.55
    },
    {
        "text": "describes a component of the electric field caused by just one charge.",
        "start": 300.73,
        "duration": 3.55
    },
    {
        "text": "Again, that means what force would be applied to a ",
        "start": 304.82,
        "duration": 3.002
    },
    {
        "text": "second charge at all possible different points in space.",
        "start": 307.822,
        "duration": 3.298
    },
    {
        "text": "This component of the field is only ever non-zero when our first ",
        "start": 312.28,
        "duration": 3.387
    },
    {
        "text": "charge is moving somehow, when it has an acceleration vector on it.",
        "start": 315.667,
        "duration": 3.493
    },
    {
        "text": "And because of this delay term, the effects on ",
        "start": 319.58,
        "duration": 2.542
    },
    {
        "text": "this field tend to radiate away from the charge.",
        "start": 322.122,
        "duration": 2.598
    },
    {
        "text": "This is why I'm writing it down with the subscript rad.",
        "start": 325.06,
        "duration": 2.28
    },
    {
        "text": "This is the component of the electric field that will radiate away from a given charge.",
        "start": 327.82,
        "duration": 4.42
    },
    {
        "text": "For instance, when the charge is oscillating up and down, you get these propagating waves.",
        "start": 333.12,
        "duration": 3.98
    },
    {
        "text": "And for many of the vector fields I'll be showing, ",
        "start": 337.1,
        "duration": 2.488
    },
    {
        "text": "the intensity of the field is illustrated with the opacity of each little vector.",
        "start": 339.588,
        "duration": 3.952
    },
    {
        "text": "This radiating influence is light, or more generally, electromagnetic radiation, ",
        "start": 344.28,
        "duration": 4.892
    },
    {
        "text": "including things like radio waves and x-rays and all that good stuff.",
        "start": 349.172,
        "duration": 4.168
    },
    {
        "text": "As a side note, you sometimes see this propagation described a very different way ",
        "start": 354.82,
        "duration": 3.747
    },
    {
        "text": "that puts the fields front and center, using what are known as Maxwell's equations.",
        "start": 358.567,
        "duration": 3.793
    },
    {
        "text": "For our purposes, I want to focus just on this one law and show ",
        "start": 362.88,
        "duration": 3.475
    },
    {
        "text": "just how far it can take us when it comes to intuitions for light.",
        "start": 366.355,
        "duration": 3.585
    },
    {
        "text": "For the animations I'm about to show, all I've really done is encoded in this one law, ",
        "start": 371.62,
        "duration": 4.918
    },
    {
        "text": "which tells us what should this component of the electric field be at every point ",
        "start": 376.538,
        "duration": 4.635
    },
    {
        "text": "in space, as determined by the history of accelerations of a particular charge.",
        "start": 381.173,
        "duration": 4.467
    },
    {
        "text": "For example, if I set that charge oscillating up and down in the z direction, ",
        "start": 386.36,
        "duration": 4.144
    },
    {
        "text": "and illustrate this component of the electric field everywhere on the xy plane, ",
        "start": 390.504,
        "duration": 4.25
    },
    {
        "text": "you see these circular propagations of equal strength in all directions.",
        "start": 394.754,
        "duration": 3.826
    },
    {
        "text": "It's a little easier to think about if we focus on just one axis, like the x-axis.",
        "start": 400.76,
        "duration": 4.22
    },
    {
        "text": "And at first when I made this animation, I assumed that there was some kind of bug, ",
        "start": 405.96,
        "duration": 3.84
    },
    {
        "text": "because near the charge it just looks crooked and wrong.",
        "start": 409.8,
        "duration": 2.56
    },
    {
        "text": "But when you think about it, this is actually what you should expect, ",
        "start": 412.82,
        "duration": 3.685
    },
    {
        "text": "because remember, each one of these vectors is supposed to be perpendicular to ",
        "start": 416.505,
        "duration": 4.159
    },
    {
        "text": "the line drawn between that point and where the charge was at some point in the past.",
        "start": 420.664,
        "duration": 4.476
    },
    {
        "text": "At points that are far enough away from the charge, ",
        "start": 426.46,
        "duration": 2.395
    },
    {
        "text": "which is where this component of the field is what dominates anyway, ",
        "start": 428.855,
        "duration": 3.18
    },
    {
        "text": "the wiggling in the field is essentially parallel to the wiggling in the charge, ",
        "start": 432.035,
        "duration": 3.732
    },
    {
        "text": "which is why when we think about light waves, we're safe to think about the wiggling ",
        "start": 435.767,
        "duration": 3.916
    },
    {
        "text": "direction as being perpendicular to the propagation direction.",
        "start": 439.683,
        "duration": 2.857
    },
    {
        "text": "Like I said, this propagation for just one charge is equally strong in all of ",
        "start": 442.54,
        "duration": 4.095
    },
    {
        "text": "the directions perpendicular to its wiggling, and really I should emphasize ",
        "start": 446.635,
        "duration": 3.99
    },
    {
        "text": "that the propagation does happen in all directions of three-dimensional space.",
        "start": 450.625,
        "duration": 4.095
    },
    {
        "text": "It's maybe a little busy to try to illustrate the full three-dimensional vector ",
        "start": 457.04,
        "duration": 4.247
    },
    {
        "text": "field on screen like this, so it's clarifying if we just focus on, say, the xz plane.",
        "start": 461.287,
        "duration": 4.513
    },
    {
        "text": "Notice how the waves here are strongest in the x direction, ",
        "start": 466.3,
        "duration": 3.038
    },
    {
        "text": "but it still does propagate in all other directions, ",
        "start": 469.338,
        "duration": 2.683
    },
    {
        "text": "it's just that that propagation gets weaker in directions that are more ",
        "start": 472.021,
        "duration": 3.646
    },
    {
        "text": "aligned with the original wiggling.",
        "start": 475.667,
        "duration": 1.773
    },
    {
        "text": "At the extreme, the only place where there's no propagation is in the z axis.",
        "start": 478.0,
        "duration": 3.74
    },
    {
        "text": "Because our law has this 1 divided by r in it, ",
        "start": 484.32,
        "duration": 2.685
    },
    {
        "text": "the strength of the wave caused by just one particle does decay as you go farther away, ",
        "start": 487.005,
        "duration": 5.029
    },
    {
        "text": "in proportion to 1 over r.",
        "start": 492.034,
        "duration": 1.486
    },
    {
        "text": "But notice what happens if I take a whole row of charges, say oriented along the y axis, ",
        "start": 494.28,
        "duration": 4.881
    },
    {
        "text": "and I have them all start wiggling up and down in the z direction, ",
        "start": 499.161,
        "duration": 3.674
    },
    {
        "text": "and I illustrate the combined effects that all of them have on this component of the ",
        "start": 502.835,
        "duration": 4.662
    },
    {
        "text": "electric field.",
        "start": 507.497,
        "duration": 0.823
    },
    {
        "text": "The effects of all these charges interfere deconstructively along the y direction, ",
        "start": 509.82,
        "duration": 5.039
    },
    {
        "text": "but they interfere constructively along the x direction.",
        "start": 514.859,
        "duration": 3.401
    },
    {
        "text": "This is what it looks like for a beam of light ",
        "start": 519.02,
        "duration": 2.365
    },
    {
        "text": "to be concentrated along just one dimension.",
        "start": 521.385,
        "duration": 2.215
    },
    {
        "text": "So if you were to focus on the field just along the x axis, ",
        "start": 524.42,
        "duration": 3.734
    },
    {
        "text": "instead of decaying in proportion to 1 over r, ",
        "start": 528.154,
        "duration": 2.925
    },
    {
        "text": "this combined effect decays much more gently.",
        "start": 531.079,
        "duration": 2.801
    },
    {
        "text": "In the extreme, you can get something arbitrarily close to those pure sine ",
        "start": 535.7,
        "duration": 3.674
    },
    {
        "text": "wave propagations we were illustrating earlier, ",
        "start": 539.374,
        "duration": 2.352
    },
    {
        "text": "if at some distance away you have a large number of charges oscillating in ",
        "start": 541.726,
        "duration": 3.675
    },
    {
        "text": "sync with each other like this.",
        "start": 545.401,
        "duration": 1.519
    },
    {
        "text": "One thing that's worth emphasizing when you see light illustrated ",
        "start": 547.4,
        "duration": 3.511
    },
    {
        "text": "with a sine wave like this, is that even though that wave is being ",
        "start": 550.911,
        "duration": 3.566
    },
    {
        "text": "drawn in two or three dimensions, it's only describing the electric ",
        "start": 554.477,
        "duration": 3.618
    },
    {
        "text": "field along a one-dimensional line, namely the base of all those vectors.",
        "start": 558.095,
        "duration": 3.885
    },
    {
        "text": "It's just that to draw the vectors you have to venture off of that line.",
        "start": 562.4,
        "duration": 3.48
    },
    {
        "text": "Great, so one of the last important things to highlight ",
        "start": 567.18,
        "duration": 2.759
    },
    {
        "text": "before we get back to the sugar water is polarization.",
        "start": 569.939,
        "duration": 2.661
    },
    {
        "text": "In everything I've been showing, the driving charge is just oscillating along ",
        "start": 573.18,
        "duration": 4.149
    },
    {
        "text": "a single direction, like the z axis, and this causes linearly polarized light.",
        "start": 577.329,
        "duration": 4.151
    },
    {
        "text": "But it doesn't have to happen like that.",
        "start": 581.48,
        "duration": 1.78
    },
    {
        "text": "For example, if I set the charge rotating in a little circle along the yz plane, ",
        "start": 583.26,
        "duration": 4.771
    },
    {
        "text": "meaning its acceleration vector is also rotating in a little circle, ",
        "start": 588.031,
        "duration": 4.065
    },
    {
        "text": "notice what the field looks like.",
        "start": 592.096,
        "duration": 1.944
    },
    {
        "text": "This is known, aptly enough, as circularly polarized light.",
        "start": 594.8,
        "duration": 3.44
    },
    {
        "text": "Honestly, it's easiest to think about for just one point of the electric field.",
        "start": 598.96,
        "duration": 3.42
    },
    {
        "text": "What it means for light to be circularly polarized is that at that point, ",
        "start": 603.0,
        "duration": 4.176
    },
    {
        "text": "the electric field vector is just rotating in a circle.",
        "start": 607.176,
        "duration": 3.104
    },
    {
        "text": "People often find circular polarization a little confusing, ",
        "start": 610.68,
        "duration": 2.975
    },
    {
        "text": "and I suspect part of the reason for that is that it's hard to illustrate with ",
        "start": 613.655,
        "duration": 3.917
    },
    {
        "text": "a static diagram, but also it's a little confusing when you try to think about ",
        "start": 617.572,
        "duration": 3.917
    },
    {
        "text": "the full electric field.",
        "start": 621.489,
        "duration": 1.191
    },
    {
        "text": "For example, here's what the field looks like on the xy ",
        "start": 623.42,
        "duration": 2.676
    },
    {
        "text": "plane when I set that little charge rotating in a circle.",
        "start": 626.096,
        "duration": 2.724
    },
    {
        "text": "It's certainly very beautiful, I could look at this all day, ",
        "start": 630.96,
        "duration": 2.823
    },
    {
        "text": "but you can understand why it might feel a little confusing.",
        "start": 633.783,
        "duration": 2.777
    },
    {
        "text": "The very last thing I'll mention is that while everything here is a classical ",
        "start": 637.12,
        "duration": 3.74
    },
    {
        "text": "description of light, the important points still hold up in quantum mechanics.",
        "start": 640.86,
        "duration": 3.74
    },
    {
        "text": "You still have propagating waves, there's still ",
        "start": 645.04,
        "duration": 2.259
    },
    {
        "text": "polarization that can be either linear or circular.",
        "start": 647.299,
        "duration": 2.401
    },
    {
        "text": "The main difference with quantum mechanics is that the energy in this wave doesn't ",
        "start": 650.1,
        "duration": 4.178
    },
    {
        "text": "scale up and down continuously, like you might expect, it comes in discrete little steps.",
        "start": 654.278,
        "duration": 4.482
    },
    {
        "text": "I have another video that goes into more detail, ",
        "start": 659.38,
        "duration": 2.346
    },
    {
        "text": "but for our purposes, thinking about it classically is fine.",
        "start": 661.726,
        "duration": 2.874
    },
    {
        "text": "Part of the reason I wanted to go through that is because, frankly, ",
        "start": 665.3,
        "duration": 3.022
    },
    {
        "text": "it's just very fun to animate and I like an excuse for a fundamental lesson.",
        "start": 668.322,
        "duration": 3.378
    },
    {
        "text": "But now let's turn back to our demo and see how we can build up an intuition ",
        "start": 672.36,
        "duration": 3.745
    },
    {
        "text": "for some of our key questions, starting from this very basic premise that ",
        "start": 676.105,
        "duration": 3.6
    },
    {
        "text": "shaking a charge in one location causes a shake to another charge a little bit later.",
        "start": 679.705,
        "duration": 4.135
    },
    {
        "text": "And let's start by actually skipping ahead to question number three, ",
        "start": 684.18,
        "duration": 3.012
    },
    {
        "text": "why do we see the diagonal stripes?",
        "start": 687.192,
        "duration": 1.528
    },
    {
        "text": "To think about this, you need to imagine an observer to the side of the tube, ",
        "start": 693.68,
        "duration": 4.243
    },
    {
        "text": "and then for a particular pure color, say red, ",
        "start": 697.923,
        "duration": 2.557
    },
    {
        "text": "if the observer looks in the tube and sees that color, ",
        "start": 700.48,
        "duration": 2.992
    },
    {
        "text": "it's because light of that color has bounced off something at that point in the tube, ",
        "start": 703.472,
        "duration": 4.679
    },
    {
        "text": "and then propagated towards the eye of the observer.",
        "start": 708.151,
        "duration": 2.829
    },
    {
        "text": "Sometimes when people talk about light bouncing off of things, ",
        "start": 711.54,
        "duration": 3.619
    },
    {
        "text": "the implied mental image is a projectile ricocheting off of some object, ",
        "start": 715.159,
        "duration": 4.195
    },
    {
        "text": "heading off in some random direction.",
        "start": 719.354,
        "duration": 2.126
    },
    {
        "text": "But the better mental image to hold in your mind is that when the propagating ",
        "start": 722.28,
        "duration": 3.938
    },
    {
        "text": "light waves caused by some wiggling charge reach some second charge causing it to wiggle, ",
        "start": 726.218,
        "duration": 4.545
    },
    {
        "text": "that secondary wiggle results in its own propagation.",
        "start": 730.763,
        "duration": 2.677
    },
    {
        "text": "And for the animation on screen, that propagation goes back to the first charge, ",
        "start": 734.28,
        "duration": 3.663
    },
    {
        "text": "which itself causes a propagation towards the second.",
        "start": 737.943,
        "duration": 2.397
    },
    {
        "text": "And this is what it looks like in a very simplified situation ",
        "start": 740.7,
        "duration": 2.967
    },
    {
        "text": "for light to bounce back and forth between two charges.",
        "start": 743.667,
        "duration": 2.633
    },
    {
        "text": "If you have some concentrated beam of polarized light interacting with some charge, ",
        "start": 747.16,
        "duration": 4.739
    },
    {
        "text": "causing it to wiggle up and down, then these resulting second-order propagations ",
        "start": 751.899,
        "duration": 4.57
    },
    {
        "text": "are most strong in the directions perpendicular to the direction of polarization.",
        "start": 756.469,
        "duration": 4.571
    },
    {
        "text": "In some sense, you could think of light as bouncing off of that charge, ",
        "start": 761.54,
        "duration": 3.035
    },
    {
        "text": "but the important point is that it doesn't bounce in all directions equally.",
        "start": 764.575,
        "duration": 3.205
    },
    {
        "text": "It's strongest perpendicular to the wiggle direction, ",
        "start": 768.08,
        "duration": 2.694
    },
    {
        "text": "but gets weaker in all of the other directions.",
        "start": 770.774,
        "duration": 2.346
    },
    {
        "text": "So think about our setup, and for a particular frequency of light, ",
        "start": 774.64,
        "duration": 3.6
    },
    {
        "text": "how likely it is that an observer looking at a particular point in the tube will ",
        "start": 778.24,
        "duration": 4.353
    },
    {
        "text": "see that light.",
        "start": 782.593,
        "duration": 0.807
    },
    {
        "text": "Again, the key phenomenon with sugar water, which we have yet to explain, ",
        "start": 784.3,
        "duration": 3.82
    },
    {
        "text": "is that the polarization direction is slowly getting twisted as it goes down the tube.",
        "start": 788.12,
        "duration": 4.44
    },
    {
        "text": "So suppose the observer was looking at a point like this one, ",
        "start": 793.36,
        "duration": 2.823
    },
    {
        "text": "where the polarization direction happens to be straight up and down.",
        "start": 796.183,
        "duration": 3.097
    },
    {
        "text": "Then the second-order propagations resulting from wiggling charges ",
        "start": 799.28,
        "duration": 3.549
    },
    {
        "text": "at that point are most strong along the plane where the observer is, ",
        "start": 802.829,
        "duration": 3.655
    },
    {
        "text": "so the amount of red that they see at that point would look stronger.",
        "start": 806.484,
        "duration": 3.656
    },
    {
        "text": "By contrast, if they were looking at a different point in the tube like this one, ",
        "start": 811.08,
        "duration": 3.679
    },
    {
        "text": "where the wiggling direction is closer to being parallel to the line of sight, ",
        "start": 814.759,
        "duration": 3.545
    },
    {
        "text": "then the direction where the scattering is strongest is not at all aligned with ",
        "start": 818.304,
        "duration": 3.59
    },
    {
        "text": "the observer, and the amount of red they see is only going to be very weak.",
        "start": 821.894,
        "duration": 3.366
    },
    {
        "text": "And looking at our actual physical setup, if we first pass the light ",
        "start": 826.5,
        "duration": 3.892
    },
    {
        "text": "through a filter showing only the red, we see exactly this effect in action.",
        "start": 830.392,
        "duration": 4.288
    },
    {
        "text": "As you scan your eyes along the tube, the intensity of red that you see goes ",
        "start": 835.02,
        "duration": 4.767
    },
    {
        "text": "from being high to being low, where it's almost black, back to being high again.",
        "start": 839.787,
        "duration": 4.953
    },
    {
        "text": "As an analogy, imagine there was a ribbon going down the tube, ",
        "start": 846.04,
        "duration": 3.065
    },
    {
        "text": "always aligned with the polarization direction for this color, ",
        "start": 849.105,
        "duration": 3.065
    },
    {
        "text": "then putting yourself in the shoes of the observer, ",
        "start": 852.17,
        "duration": 2.531
    },
    {
        "text": "when you look at points where the ribbon appears very thin, ",
        "start": 854.701,
        "duration": 2.919
    },
    {
        "text": "you're going to see very little red light, whereas if you scan your eyes over ",
        "start": 857.62,
        "duration": 3.796
    },
    {
        "text": "to points where the ribbon appears thicker, you're going to see more red light.",
        "start": 861.416,
        "duration": 3.844
    },
    {
        "text": "One thing that's nice about this is that if we try it for various different colors, ",
        "start": 865.96,
        "duration": 3.817
    },
    {
        "text": "you can actually see how the twisting rates are different for each one of the colors.",
        "start": 869.777,
        "duration": 3.863
    },
    {
        "text": "Notice with red light, the distance between where it appears brightest and where it ",
        "start": 874.32,
        "duration": 4.253
    },
    {
        "text": "appears darkest is relatively long, whereas if you look down the colors of the rainbow, ",
        "start": 878.573,
        "duration": 4.456
    },
    {
        "text": "distance between the brightest point and the darkest point gets lower and lower.",
        "start": 883.029,
        "duration": 4.051
    },
    {
        "text": "So what you're seeing in effect is how red light twists slowly, ",
        "start": 888.72,
        "duration": 3.886
    },
    {
        "text": "whereas light waves with higher frequencies get twisted more aggressively.",
        "start": 892.606,
        "duration": 4.494
    },
    {
        "text": "But still, you might wonder why the boundaries ",
        "start": 901.26,
        "duration": 2.253
    },
    {
        "text": "between light and dark points appear diagonal.",
        "start": 903.513,
        "duration": 2.207
    },
    {
        "text": "Why is it that in addition to having variation as you scan your eyes from left to right, ",
        "start": 906.2,
        "duration": 4.547
    },
    {
        "text": "there's also variation as you scan your eyes from the top of the tube to the bottom?",
        "start": 910.747,
        "duration": 4.293
    },
    {
        "text": "This has less to do with what's going on in the tube, ",
        "start": 915.92,
        "duration": 2.567
    },
    {
        "text": "and more to do with a matter of perspective.",
        "start": 918.487,
        "duration": 2.093
    },
    {
        "text": "Take a moment to think about many different parallel beams ",
        "start": 921.5,
        "duration": 2.616
    },
    {
        "text": "of light ranging from the top of the tube to the bottom.",
        "start": 924.116,
        "duration": 2.484
    },
    {
        "text": "At the beginning, all of these light waves are wiggling up and down, ",
        "start": 927.02,
        "duration": 3.108
    },
    {
        "text": "and as you pass through the tube, and the effects of the sugar water ",
        "start": 930.128,
        "duration": 3.109
    },
    {
        "text": "somehow twists these directions, because they're all passing through ",
        "start": 933.237,
        "duration": 3.109
    },
    {
        "text": "the same amount of sugar, they're getting twisted by the same amounts.",
        "start": 936.346,
        "duration": 3.154
    },
    {
        "text": "So at all points, the polarization of these waves are parallel to each other.",
        "start": 939.5,
        "duration": 4.5
    },
    {
        "text": "If you're the observer and you look at the topmost point here, ",
        "start": 944.66,
        "duration": 2.981
    },
    {
        "text": "its wiggling direction is essentially parallel to the line of sight, ",
        "start": 947.641,
        "duration": 3.266
    },
    {
        "text": "so the light scattering from that point is basically not going to reach your eyes at all.",
        "start": 950.907,
        "duration": 4.213
    },
    {
        "text": "It should appear black.",
        "start": 955.28,
        "duration": 0.94
    },
    {
        "text": "But if you scan your eyes down the tube, the angle between the line ",
        "start": 956.76,
        "duration": 3.18
    },
    {
        "text": "of sight and the wiggling direction changes, and so there will be ",
        "start": 959.94,
        "duration": 3.086
    },
    {
        "text": "at least some component of red light scattering towards the eye.",
        "start": 963.026,
        "duration": 2.994
    },
    {
        "text": "So as you scan your eyes from top to bottom, the amount of ",
        "start": 966.02,
        "duration": 3.432
    },
    {
        "text": "a particular color you see might vary, say from dark to light.",
        "start": 969.452,
        "duration": 3.608
    },
    {
        "text": "The full demo that has white light is basically a combination of all ",
        "start": 974.96,
        "duration": 3.582
    },
    {
        "text": "these pure color patterns that go from light to dark to light with ",
        "start": 978.542,
        "duration": 3.478
    },
    {
        "text": "diagonal boundaries between the intense points and the weak points, ",
        "start": 982.02,
        "duration": 3.53
    },
    {
        "text": "hence why you see diagonal boundaries between the colors inside the tube.",
        "start": 985.55,
        "duration": 3.79
    },
    {
        "text": "And now at last let's turn to the heart of the matter and try to explain why ",
        "start": 991.22,
        "duration": 4.156
    },
    {
        "text": "interactions with sugar would make light twist like this in the first place.",
        "start": 995.376,
        "duration": 4.104
    },
    {
        "text": "It's related to the idea that light seems to slow ",
        "start": 999.68,
        "duration": 2.593
    },
    {
        "text": "down as it passes through a given medium.",
        "start": 1002.273,
        "duration": 2.127
    },
    {
        "text": "For example, if you look at the crests of a light wave as it goes into water, ",
        "start": 1004.9,
        "duration": 4.17
    },
    {
        "text": "the crests through the water are traveling about 1.33 times slower ",
        "start": 1009.07,
        "duration": 3.582
    },
    {
        "text": "than the crests of that wave would travel in a vacuum.",
        "start": 1012.652,
        "duration": 2.888
    },
    {
        "text": "This number is what's called the index of refraction for water.",
        "start": 1016.28,
        "duration": 2.66
    },
    {
        "text": "In a bit, what I'd like to show is how this index of refraction can be explained by ",
        "start": 1019.64,
        "duration": 4.65
    },
    {
        "text": "analyzing how the initial light wave shakes all the charges in the material and how ",
        "start": 1024.29,
        "duration": 4.65
    },
    {
        "text": "the resulting second order propagations superimpose with that original light wave.",
        "start": 1028.94,
        "duration": 4.54
    },
    {
        "text": "For right now, I'll just say that the interactions with each layer ",
        "start": 1034.28,
        "duration": 3.497
    },
    {
        "text": "of the material ends up having the effect of slightly shifting back ",
        "start": 1037.777,
        "duration": 3.55
    },
    {
        "text": "the phase of the wave, and on the whole, this gives the overall ",
        "start": 1041.327,
        "duration": 3.341
    },
    {
        "text": "appearance that that wave moves slower as it passes through the material.",
        "start": 1044.668,
        "duration": 3.812
    },
    {
        "text": "Skipping ahead to what's going on with sugar, the relevant ",
        "start": 1050.7,
        "duration": 3.165
    },
    {
        "text": "property of sucrose here is that it's what's called a chiral molecule, ",
        "start": 1053.865,
        "duration": 3.809
    },
    {
        "text": "meaning it's fundamentally different from its mirror image.",
        "start": 1057.674,
        "duration": 3.166
    },
    {
        "text": "You could never reorient it in space to become identical to its mirror image.",
        "start": 1061.0,
        "duration": 3.6
    },
    {
        "text": "It's like a left hand or a right hand.",
        "start": 1064.8,
        "duration": 2.12
    },
    {
        "text": "Or another much simpler example of a chiral shape is a spiral.",
        "start": 1067.38,
        "duration": 3.36
    },
    {
        "text": "If I take this right-handed spiral, then its mirror image is a left-handed spiral, ",
        "start": 1071.14,
        "duration": 4.345
    },
    {
        "text": "and no matter how you try to rotate and reorient that first one, ",
        "start": 1075.485,
        "duration": 3.403
    },
    {
        "text": "it'll never become identical to the second.",
        "start": 1078.888,
        "duration": 2.252
    },
    {
        "text": "What's going on then is that the presence of a chiral molecule ",
        "start": 1083.56,
        "duration": 3.517
    },
    {
        "text": "in the water like this introduces an asymmetry when it comes to interactions with light, ",
        "start": 1087.077,
        "duration": 4.969
    },
    {
        "text": "specifically circularly polarized light.",
        "start": 1092.046,
        "duration": 2.234
    },
    {
        "text": "It turns out that the amount this chiral molecule slows down, ",
        "start": 1095.06,
        "duration": 3.419
    },
    {
        "text": "say, left-handed circularly polarized light is different from ",
        "start": 1098.479,
        "duration": 3.42
    },
    {
        "text": "the amount that it slows down right-handed circularly polarized light.",
        "start": 1101.899,
        "duration": 3.861
    },
    {
        "text": "Effectively, there's not one index of refraction, but two.",
        "start": 1106.1,
        "duration": 3.14
    },
    {
        "text": "Now you might say that seems irrelevant to our setup, ",
        "start": 1110.2,
        "duration": 2.85
    },
    {
        "text": "since we are very deliberately shining in linearly polarized light, ",
        "start": 1113.05,
        "duration": 3.59
    },
    {
        "text": "there is no circularly polarized light.",
        "start": 1116.64,
        "duration": 2.06
    },
    {
        "text": "But actually there's a sense in which linearly polarized light is ",
        "start": 1119.36,
        "duration": 3.299
    },
    {
        "text": "equal parts left-handed and right-handed circularly polarized light.",
        "start": 1122.659,
        "duration": 3.401
    },
    {
        "text": "Here, focus your attention on just one vector in this wave, ",
        "start": 1127.62,
        "duration": 3.158
    },
    {
        "text": "wiggling straight up and down, which is to say polarized in the z direction.",
        "start": 1130.778,
        "duration": 4.002
    },
    {
        "text": "Notice how it's possible to express this vector as a sum of two rotating vectors, ",
        "start": 1135.88,
        "duration": 4.882
    },
    {
        "text": "one of them rotating at a constant rate counterclockwise, ",
        "start": 1140.762,
        "duration": 3.454
    },
    {
        "text": "and the other one rotating clockwise.",
        "start": 1144.216,
        "duration": 2.204
    },
    {
        "text": "Adding them together tip to tail results in a vector oscillating on a line.",
        "start": 1147.96,
        "duration": 3.8
    },
    {
        "text": "In this case, it's a vertical line, but that direction can change ",
        "start": 1153.66,
        "duration": 3.195
    },
    {
        "text": "based on the phase of the two vectors we're adding together.",
        "start": 1156.855,
        "duration": 2.905
    },
    {
        "text": "Here, let me throw up a couple labels to keep track of how much each one of those ",
        "start": 1160.44,
        "duration": 3.876
    },
    {
        "text": "two vectors has rotated in total, and then every now and then I'm going to slow down ",
        "start": 1164.316,
        "duration": 4.019
    },
    {
        "text": "that first vector a little bit, and I want you to notice what happens to their sum.",
        "start": 1168.335,
        "duration": 3.925
    },
    {
        "text": "Well, every time I slow it down, effectively knocking back its phase a little bit, ",
        "start": 1176.32,
        "duration": 4.593
    },
    {
        "text": "it causes the linearly wiggling sum to wiggle in a slightly different direction.",
        "start": 1180.913,
        "duration": 4.427
    },
    {
        "text": "So if the circularly polarized light wave represented by that left vector ",
        "start": 1186.28,
        "duration": 4.172
    },
    {
        "text": "gets slowed down a little bit every time it runs across a sugar molecule, ",
        "start": 1190.452,
        "duration": 4.172
    },
    {
        "text": "or at least slowed down more than its oppositely rotating counterpart would, ",
        "start": 1194.624,
        "duration": 4.341
    },
    {
        "text": "the effect on the sum is to slowly rotate the direction of linear polarization.",
        "start": 1198.965,
        "duration": 4.455
    },
    {
        "text": "And hence, as you look at slices further and further down the tube, ",
        "start": 1204.22,
        "duration": 3.163
    },
    {
        "text": "the polarization direction does indeed get twisted the way we were describing earlier, ",
        "start": 1207.383,
        "duration": 4.047
    },
    {
        "text": "representing how the composite effects with many many many different sugar ",
        "start": 1211.43,
        "duration": 3.49
    },
    {
        "text": "molecules are slightly different for left-handed light than they are for right-handed ",
        "start": 1214.92,
        "duration": 4.0
    },
    {
        "text": "light.",
        "start": 1218.92,
        "duration": 0.28
    },
    {
        "text": "As a nice way to test whether you understood everything up to this point, ",
        "start": 1220.04,
        "duration": 3.76
    },
    {
        "text": "see if just by looking at the direction of the diagonal slices on our tube, ",
        "start": 1223.8,
        "duration": 3.862
    },
    {
        "text": "you can deduce which kind of light the sugar is slowing down more, ",
        "start": 1227.662,
        "duration": 3.405
    },
    {
        "text": "left-handed light or right-handed light.",
        "start": 1231.067,
        "duration": 2.033
    },
    {
        "text": "I'll call this a partial answer to our question number one, ",
        "start": 1235.92,
        "duration": 2.947
    },
    {
        "text": "because it still leaves us wondering why there's an index of refraction in the first ",
        "start": 1238.867,
        "duration": 4.175
    },
    {
        "text": "place, and how exactly it might depend on the polarization of the light, ",
        "start": 1243.042,
        "duration": 3.585
    },
    {
        "text": "not just the material it's passing through.",
        "start": 1246.627,
        "duration": 2.113
    },
    {
        "text": "Also, like I said at the start, a robust enough intuition here should also answer ",
        "start": 1249.2,
        "duration": 4.37
    },
    {
        "text": "for us why the strength of this effect would depend on the frequency of the light.",
        "start": 1253.57,
        "duration": 4.37
    },
    {
        "text": "At this point I think we've covered quite enough for one video, ",
        "start": 1258.78,
        "duration": 3.002
    },
    {
        "text": "so I'll pull out a discussion covering the origins of the index of refraction to ",
        "start": 1261.782,
        "duration": 3.8
    },
    {
        "text": "a separate video.",
        "start": 1265.582,
        "duration": 0.798
    },
    {
        "text": "Thank you.",
        "start": 1279.2,
        "duration": 11.78
    }
]