[
    {
        "text": "In the last month or two, there's been a measurable increase in ",
        "start": 0.0,
        "duration": 2.841
    },
    {
        "text": "the attention to a wide variety of smaller math channels on YouTube.",
        "start": 2.841,
        "duration": 3.019
    },
    {
        "text": "My friend James and I ran a second iteration of a contest that we did last year, ",
        "start": 6.64,
        "duration": 4.15
    },
    {
        "text": "the Summer of Math Exposition, which invites people to put up lessons about math online.",
        "start": 10.79,
        "duration": 4.51
    },
    {
        "text": "It could be a video, it could be an article, any medium you dream up, ",
        "start": 15.7,
        "duration": 3.024
    },
    {
        "text": "whatever topic you dream up, and we have some prizes available for the ones that we deem, ",
        "start": 18.724,
        "duration": 3.888
    },
    {
        "text": "in some sense, best, whatever that could mean.",
        "start": 22.612,
        "duration": 1.988
    },
    {
        "text": "The deadline for submissions was a little over a month ago, ",
        "start": 24.94,
        "duration": 3.197
    },
    {
        "text": "and if we just focus on the video entries, they've collectively accumulated over 7 ",
        "start": 28.137,
        "duration": 4.424
    },
    {
        "text": "million views since that time.",
        "start": 32.561,
        "duration": 1.599
    },
    {
        "text": "Considering that the vast majority of these are uploaded to very young channels, ",
        "start": 34.5,
        "duration": 3.776
    },
    {
        "text": "where the video is often just the first or second upload, ",
        "start": 38.276,
        "duration": 2.705
    },
    {
        "text": "this was really exciting for me to see.",
        "start": 40.981,
        "duration": 1.819
    },
    {
        "text": "I suspect a big part of the reason for this rising tide is that after the ",
        "start": 43.3,
        "duration": 3.448
    },
    {
        "text": "submission deadline, we ran a peer-review process where an algorithm would ",
        "start": 46.748,
        "duration": 3.495
    },
    {
        "text": "feed participants two different videos to compare, ",
        "start": 50.243,
        "duration": 2.376
    },
    {
        "text": "and they'd be asked to vote which one of these is, quote, better, ",
        "start": 52.619,
        "duration": 3.076
    },
    {
        "text": "according to a few criteria.",
        "start": 55.695,
        "duration": 1.305
    },
    {
        "text": "That process generated over 10,000 comparisons, which on the one hand, ",
        "start": 57.0,
        "duration": 3.806
    },
    {
        "text": "helps to provide an initial rough rank ordering of all the videos, ",
        "start": 60.806,
        "duration": 3.591
    },
    {
        "text": "but more important than that, any judgements or rankings, ",
        "start": 64.397,
        "duration": 3.11
    },
    {
        "text": "it gave an excuse for many hundreds of people to upload around a similar time, ",
        "start": 67.507,
        "duration": 4.235
    },
    {
        "text": "and then collectively view each other's work, helping to jumpstart a cluster ",
        "start": 71.742,
        "duration": 4.128
    },
    {
        "text": "of videos with a shared viewer base.",
        "start": 75.87,
        "duration": 1.93
    },
    {
        "text": "And that 7 million number doesn't account for other videos on these channels, ",
        "start": 78.34,
        "duration": 3.802
    },
    {
        "text": "for instance the many submissions people made to last year's contest, which, ",
        "start": 82.142,
        "duration": 3.753
    },
    {
        "text": "since this year's deadline, collectively jumped up by about 2 million views.",
        "start": 85.895,
        "duration": 3.705
    },
    {
        "text": "One group who told me that last year's contest was what inspired them to put up ",
        "start": 90.06,
        "duration": 4.091
    },
    {
        "text": "their first video, mentioned to me that a video they had made in between the two ",
        "start": 94.151,
        "duration": 4.142
    },
    {
        "text": "contests managed to suddenly jump from 1,000 to 600,000 views during the peer-review ",
        "start": 98.293,
        "duration": 4.347
    },
    {
        "text": "process for this year's contest, despite not being among those videos reviewed.",
        "start": 102.64,
        "duration": 4.04
    },
    {
        "text": "This is all to say, there can be a surprising value in the ",
        "start": 106.98,
        "duration": 2.759
    },
    {
        "text": "seemingly simple presence of a shared goal and a shared deadline.",
        "start": 109.739,
        "duration": 3.041
    },
    {
        "text": "And again, these are just the video entries, where it's easy ",
        "start": 112.78,
        "duration": 2.67
    },
    {
        "text": "for us to run these analytics to quickly get a sense of the reach.",
        "start": 115.45,
        "duration": 2.89
    },
    {
        "text": "Many of my favorite entries were the written ones.",
        "start": 118.72,
        "duration": 2.0
    },
    {
        "text": "The spirit of the contest, as you can no doubt tell, ",
        "start": 121.5,
        "duration": 2.45
    },
    {
        "text": "is getting more people to put out math lessons, and on that front, mission accomplished.",
        "start": 123.95,
        "duration": 4.07
    },
    {
        "text": "But I did promise to select five winners, lessons that stood out as especially ",
        "start": 128.5,
        "duration": 3.975
    },
    {
        "text": "valuable for one reason or another, and that brings us to this video here.",
        "start": 132.475,
        "duration": 3.725
    },
    {
        "text": "To choose winners, James and I both spent a couple weeks giving a pretty thorough ",
        "start": 136.68,
        "duration": 3.843
    },
    {
        "text": "look at over 100 of the top entries, as determined by the peer-review process.",
        "start": 140.523,
        "duration": 3.657
    },
    {
        "text": "We also recruited a few guest judges from the community to help look at a subset of ",
        "start": 144.7,
        "duration": 3.633
    },
    {
        "text": "these and make sure that our own biases and blind spots aren't playing too heavy a role.",
        "start": 148.333,
        "duration": 3.807
    },
    {
        "text": "Many many thanks to them and the time they offered.",
        "start": 152.54,
        "duration": 1.74
    },
    {
        "text": "I won't tell you the final decision until the end of the video.",
        "start": 154.7,
        "duration": 2.54
    },
    {
        "text": "What I thought might be more fun is to lead up to it by talking through the criteria ",
        "start": 157.8,
        "duration": 4.17
    },
    {
        "text": "that I had in mind when making this selection, ",
        "start": 161.97,
        "duration": 2.306
    },
    {
        "text": "highlighting as many exemplary submissions as I can along the way, ",
        "start": 164.276,
        "duration": 3.287
    },
    {
        "text": "hopefully giving any of you who are looking to put out your own math lessons online ",
        "start": 167.563,
        "duration": 4.121
    },
    {
        "text": "at some point a few concrete things to focus on.",
        "start": 171.684,
        "duration": 2.356
    },
    {
        "text": "At a high level, the four criteria I told people I'd look out for were motivation, ",
        "start": 174.4,
        "duration": 4.6
    },
    {
        "text": "clarity, novelty, and memorability.",
        "start": 179.0,
        "duration": 1.94
    },
    {
        "text": "The first two are probably the most important, and let's start with motivation.",
        "start": 181.32,
        "duration": 3.0
    },
    {
        "text": "This actually has two meanings I can think of, ",
        "start": 184.98,
        "duration": 2.151
    },
    {
        "text": "one on the macro scale and one on the micro scale.",
        "start": 187.131,
        "duration": 2.289
    },
    {
        "text": "By macro scale motivation, I mean how well do you hook someone into the lesson as a whole?",
        "start": 190.02,
        "duration": 5.02
    },
    {
        "text": "This video by Alexander Berdnikov opens by asking why it is that when ",
        "start": 195.59,
        "duration": 4.097
    },
    {
        "text": "you hear a plane approaching the pitch of its sound seems to slowly fall.",
        "start": 199.687,
        "duration": 4.273
    },
    {
        "text": "He points out how a lot of people assume that this is the Doppler effect, ",
        "start": 204.66,
        "duration": 3.391
    },
    {
        "text": "but that this doesn't actually hold up to scrutiny, ",
        "start": 208.051,
        "duration": 2.382
    },
    {
        "text": "since for example that pitch actually rises as the plane is going away from you.",
        "start": 210.433,
        "duration": 3.667
    },
    {
        "text": "It's a good point, and an interesting question, you have my attention.",
        "start": 214.56,
        "duration": 3.02
    },
    {
        "text": "One of my favorite articles in the batch by Adi Mittal prompts you to wonder about ",
        "start": 218.64,
        "duration": 4.356
    },
    {
        "text": "an algorithm behind the panorama feature on your phone, and proceeds to explain 1.",
        "start": 222.996,
        "duration": 4.304
    },
    {
        "text": "why that's not trivial, and 2.",
        "start": 227.42,
        "duration": 1.86
    },
    {
        "text": "the linear algebra and projective geometry involved in a DIY-style ",
        "start": 229.38,
        "duration": 3.607
    },
    {
        "text": "project to stitch together two overlapping images taken at different angles.",
        "start": 232.987,
        "duration": 4.093
    },
    {
        "text": "Application and tangible problems can make for great motivation, ",
        "start": 237.64,
        "duration": 2.777
    },
    {
        "text": "but that's not the only source of motivation.",
        "start": 240.417,
        "duration": 1.923
    },
    {
        "text": "Depending on the target audience, a good nerd sniping question can also do the trick.",
        "start": 242.9,
        "duration": 3.82
    },
    {
        "text": "This video on the channel Going Null opens with a seemingly impossible puzzle.",
        "start": 247.22,
        "duration": 4.34
    },
    {
        "text": "10 prisoners are each given a hat, chosen arbitrarily from 10 total hat types available.",
        "start": 252.04,
        "duration": 4.859
    },
    {
        "text": "It is possible for some of the prisoners to have the same hat type as others, ",
        "start": 257.519,
        "duration": 3.466
    },
    {
        "text": "and everyone can see all of the other hats, but not their own.",
        "start": 260.985,
        "duration": 2.755
    },
    {
        "text": "After given a little time to look at everyone else's hat and think about it all, ",
        "start": 264.24,
        "duration": 3.937
    },
    {
        "text": "the prisoners are to simultaneously shout out a guess for their own hat type.",
        "start": 268.177,
        "duration": 3.743
    },
    {
        "text": "The question is, can you find a method that guarantees ",
        "start": 272.48,
        "duration": 2.705
    },
    {
        "text": "at least one of the prisoners will make a correct guess?",
        "start": 275.185,
        "duration": 2.755
    },
    {
        "text": "This video by Eric Rowland motivates the idea of p-adic numbers and the p-adic metric ",
        "start": 280.12,
        "duration": 4.793
    },
    {
        "text": "by showing how if you take 2 to the 10th, and 2 to the 100th, 2 to the 1000th, ",
        "start": 284.913,
        "duration": 4.404
    },
    {
        "text": "so on and so on, and you assign distinct colors to each digit, ",
        "start": 289.317,
        "duration": 3.511
    },
    {
        "text": "lining them all up on the right, you can see that their final digits line up more ",
        "start": 292.828,
        "duration": 4.571
    },
    {
        "text": "and more with larger powers.",
        "start": 297.399,
        "duration": 1.561
    },
    {
        "text": "Then he asks the question of whether it's reasonable to interpret ",
        "start": 299.88,
        "duration": 3.271
    },
    {
        "text": "this as a kind of convergence, despite the fact that these ",
        "start": 303.151,
        "duration": 2.925
    },
    {
        "text": "numbers are clearly diverging to infinity in the usual sense.",
        "start": 306.076,
        "duration": 3.024
    },
    {
        "text": "A completely different form of motivation can come from showing ",
        "start": 310.24,
        "duration": 2.896
    },
    {
        "text": "the historical significance of a problem or a field, ",
        "start": 313.136,
        "duration": 2.399
    },
    {
        "text": "in a sense giving the viewer a feeling that they're part of something bigger.",
        "start": 315.535,
        "duration": 3.485
    },
    {
        "text": "One excellent video on a channel A Well-Rested Dog provides an overview ",
        "start": 319.74,
        "duration": 3.573
    },
    {
        "text": "of the history of calculus and the progression of how some of the world's ",
        "start": 323.313,
        "duration": 3.673
    },
    {
        "text": "smartest minds grappled with the nuances of infinity and infinitesimals.",
        "start": 326.986,
        "duration": 3.574
    },
    {
        "text": "It's the right mixture of entertaining and detailed, ",
        "start": 330.56,
        "duration": 2.5
    },
    {
        "text": "and he goes on to talk about how learning all of this made his own questions ",
        "start": 333.06,
        "duration": 3.634
    },
    {
        "text": "and confusions in a calculus class feel validated, ",
        "start": 336.694,
        "duration": 2.406
    },
    {
        "text": "which I think a lot of students can resonate with.",
        "start": 339.1,
        "duration": 2.36
    },
    {
        "text": "This example is less about the intro of a video motivating the lesson it teaches, ",
        "start": 341.84,
        "duration": 4.35
    },
    {
        "text": "and more about the entire video motivating an entire field.",
        "start": 346.19,
        "duration": 3.13
    },
    {
        "text": "Another one like that would be this lecture, by the channel Thisery, ",
        "start": 349.92,
        "duration": 3.556
    },
    {
        "text": "laying out how Cantor's diagonalization argument and the halting ",
        "start": 353.476,
        "duration": 3.35
    },
    {
        "text": "problem and a number of other paradoxes people might have heard of in math, ",
        "start": 356.826,
        "duration": 3.918
    },
    {
        "text": "computer science, and logic all follow the same basic pattern.",
        "start": 360.744,
        "duration": 3.196
    },
    {
        "text": "And moreover, if you try to formalize the exact sense in which they follow the same ",
        "start": 364.34,
        "duration": 4.033
    },
    {
        "text": "pattern, that ends up serving as a pretty nice motivation for the subject of category ",
        "start": 368.373,
        "duration": 4.13
    },
    {
        "text": "theory.",
        "start": 372.503,
        "duration": 0.337
    },
    {
        "text": "And the last flavor of motivation I'll mention is if you can somehow ",
        "start": 374.28,
        "duration": 3.102
    },
    {
        "text": "make the learner feel like they're playing an active role in the lesson.",
        "start": 377.382,
        "duration": 3.238
    },
    {
        "text": "This is very hard to do with a video, maybe even impossible, ",
        "start": 381.22,
        "duration": 3.378
    },
    {
        "text": "and it's best suited for in-person lessons.",
        "start": 384.598,
        "duration": 2.382
    },
    {
        "text": "But one written entry that I thought did this especially well was an inverse Turing test, ",
        "start": 387.12,
        "duration": 4.616
    },
    {
        "text": "where you as the reader are challenged to come up with a sequence of ones and zeros that ",
        "start": 391.736,
        "duration": 4.565
    },
    {
        "text": "appears random, and the article goes on to explain various statistical tests that you ",
        "start": 396.301,
        "duration": 4.411
    },
    {
        "text": "could apply to prove that the sequence was actually human-generated, ",
        "start": 400.712,
        "duration": 3.539
    },
    {
        "text": "and not really random.",
        "start": 404.251,
        "duration": 1.129
    },
    {
        "text": "The content of the article is centered around the particular sequence that you, ",
        "start": 406.06,
        "duration": 3.812
    },
    {
        "text": "the reader, created, and you're invited to change it along ",
        "start": 409.872,
        "duration": 2.811
    },
    {
        "text": "the way to try to get it to pass more tests.",
        "start": 412.683,
        "duration": 2.097
    },
    {
        "text": "It's a nice touch, and I could easily see this ",
        "start": 414.78,
        "duration": 2.138
    },
    {
        "text": "working really well as a classroom activity.",
        "start": 416.918,
        "duration": 2.002
    },
    {
        "text": "Whatever approach you take, whatever flavor of motivation is your favorite, ",
        "start": 419.78,
        "duration": 3.474
    },
    {
        "text": "it's hard to overstate just how important it is that you do actually give viewers a ",
        "start": 423.254,
        "duration": 3.84
    },
    {
        "text": "reason to care.",
        "start": 427.094,
        "duration": 0.686
    },
    {
        "text": "This is true for any piece of content, but I think it's especially ",
        "start": 428.26,
        "duration": 3.401
    },
    {
        "text": "true for educational content and even more so for math, ",
        "start": 431.661,
        "duration": 2.842
    },
    {
        "text": "given the amount of focus and thought that these topics sometimes require.",
        "start": 434.503,
        "duration": 3.757
    },
    {
        "text": "I think this was articulated best by the author of one of my favorite podcasts, ",
        "start": 439.14,
        "duration": 4.029
    },
    {
        "text": "An Opinionated History of Mathematics, who has a manifesto on his website ",
        "start": 443.169,
        "duration": 3.727
    },
    {
        "text": "that lays out what he calls the axioms of learning, beginning with the first axiom, ",
        "start": 446.896,
        "duration": 4.23
    },
    {
        "text": "quote, In a perfect world, students pursue learning not because it is prescribed to them, ",
        "start": 451.126,
        "duration": 4.533
    },
    {
        "text": "but rather out of a genuine desire to figure things out.",
        "start": 455.659,
        "duration": 2.821
    },
    {
        "text": "It follows that we must not introduce any topic for which we cannot ",
        "start": 458.92,
        "duration": 3.374
    },
    {
        "text": "first convince the students that they should want to pursue it.",
        "start": 462.294,
        "duration": 3.126
    },
    {
        "text": "That said, one mistake that I think I've made in past ",
        "start": 466.42,
        "duration": 3.134
    },
    {
        "text": "videos is to over-philosophize in the video's introduction.",
        "start": 469.554,
        "duration": 3.426
    },
    {
        "text": "Motivation is critical, but it doesn't have to take long, ",
        "start": 473.68,
        "duration": 2.653
    },
    {
        "text": "and often what actually keeps the viewer engaged is to get right to ",
        "start": 476.333,
        "duration": 3.11
    },
    {
        "text": "the point and leave any commentary about broader themes and connections to the end.",
        "start": 479.443,
        "duration": 3.797
    },
    {
        "text": "If you can, motivate using clear examples, not ",
        "start": 483.82,
        "duration": 2.618
    },
    {
        "text": "sweeping statements or promises of what is to come.",
        "start": 486.438,
        "duration": 2.842
    },
    {
        "text": "By microscale motivation, what I mean is whether each new idea that's introduced ",
        "start": 490.5,
        "duration": 3.994
    },
    {
        "text": "in the lesson itself feels to the learner like it has a good reason to be there.",
        "start": 494.494,
        "duration": 3.946
    },
    {
        "text": "For instance, this video by Joshua Maros gives a fairly detailed overview of ray tracing, ",
        "start": 498.44,
        "duration": 4.931
    },
    {
        "text": "and what I love about it is that before he introduces any new technical topic, ",
        "start": 503.371,
        "duration": 4.329
    },
    {
        "text": "like the rendering equation, importance sampling, or the ReSTER algorithm, ",
        "start": 507.7,
        "duration": 4.11
    },
    {
        "text": "he's already outlined the main idea and intuition for that topic with really ",
        "start": 511.81,
        "duration": 4.22
    },
    {
        "text": "well-visualized examples.",
        "start": 516.03,
        "duration": 1.37
    },
    {
        "text": "It makes it so that once the equation comes on the screen, or the algorithm is described, ",
        "start": 517.78,
        "duration": 4.295
    },
    {
        "text": "it doesn't feel like an expression handed down with nothing to hold onto.",
        "start": 522.075,
        "duration": 3.485
    },
    {
        "text": "Instead, it arrives only once it's articulating something that already ",
        "start": 526.08,
        "duration": 3.713
    },
    {
        "text": "exists at least loosely in the viewer's mind, making it much easier to parse.",
        "start": 529.793,
        "duration": 4.027
    },
    {
        "text": "This video by Michael DeFranco about extending the factorial offers ",
        "start": 534.98,
        "duration": 3.265
    },
    {
        "text": "another great example of a lesson with good motivation along the way.",
        "start": 538.245,
        "duration": 3.315
    },
    {
        "text": "You may have heard that there's a function generalizing the ",
        "start": 542.24,
        "duration": 2.724
    },
    {
        "text": "factorial to real and even complex inputs, the gamma function.",
        "start": 544.964,
        "duration": 2.816
    },
    {
        "text": "The usual definition is written down as a certain integral expression ",
        "start": 548.26,
        "duration": 3.651
    },
    {
        "text": "sort of handed down from on high, and the justification for why this ",
        "start": 551.911,
        "duration": 3.6
    },
    {
        "text": "generalizes factorials is certain properties that you can prove about it.",
        "start": 555.511,
        "duration": 3.809
    },
    {
        "text": "But a lot of students find this unsatisfying.",
        "start": 559.54,
        "duration": 2.06
    },
    {
        "text": "Where does it come from?",
        "start": 561.84,
        "duration": 0.84
    },
    {
        "text": "By contrast, in Michael's explanation, he starts by observing the properties ",
        "start": 563.28,
        "duration": 3.926
    },
    {
        "text": "that are true of the normal factorial function that you would want to be true ",
        "start": 567.206,
        "duration": 3.977
    },
    {
        "text": "of a general version, and uses those desired properties to motivate various ",
        "start": 571.183,
        "duration": 3.875
    },
    {
        "text": "different alternate expressions massaged here and there to be more amenable ",
        "start": 575.058,
        "duration": 3.875
    },
    {
        "text": "to non-whole-number inputs, ultimately leading to a pretty satisfying answer.",
        "start": 578.933,
        "duration": 3.927
    },
    {
        "text": "Another good template for this microscale motivation when ",
        "start": 584.1,
        "duration": 3.032
    },
    {
        "text": "introducing a pretty complicated solution to a problem is to ",
        "start": 587.132,
        "duration": 3.19
    },
    {
        "text": "start with a naive but flawed solution, and then progressively refine it.",
        "start": 590.322,
        "duration": 3.818
    },
    {
        "text": "This article by Max Slater on differential programming does this particularly well.",
        "start": 594.56,
        "duration": 4.44
    },
    {
        "text": "The basic question is how you get computers to evaluate derivatives, ",
        "start": 599.48,
        "duration": 3.641
    },
    {
        "text": "a ubiquitous task for machine learning.",
        "start": 603.121,
        "duration": 2.059
    },
    {
        "text": "He starts by describing the most obvious approach, ",
        "start": 605.82,
        "duration": 2.669
    },
    {
        "text": "and then what flaws it has, and uses that as motivation for another approach.",
        "start": 608.489,
        "duration": 4.031
    },
    {
        "text": "But that one has its own flaws, and fixing those motivates yet another approach, ",
        "start": 613.02,
        "duration": 3.952
    },
    {
        "text": "and so on.",
        "start": 616.972,
        "duration": 0.488
    },
    {
        "text": "The ideas he builds up to, dual numbers and backward-mode automatic differentiation, ",
        "start": 617.8,
        "duration": 4.587
    },
    {
        "text": "both could feel a bit confusing if presented out of the blue, ",
        "start": 622.387,
        "duration": 3.346
    },
    {
        "text": "but in context, having motivated each new idea by pointing out flaws ",
        "start": 625.733,
        "duration": 3.724
    },
    {
        "text": "with the previous ones, it all ends up feeling utterly reasonable.",
        "start": 629.457,
        "duration": 3.563
    },
    {
        "text": "Turning back to that same prisoner hat puzzle I referenced earlier, ",
        "start": 633.8,
        "duration": 2.936
    },
    {
        "text": "one of the other things I liked about it is how the author doesn't just ",
        "start": 636.736,
        "duration": 3.109
    },
    {
        "text": "present the solution, there are plenty of puzzle videos out there which do that.",
        "start": 639.845,
        "duration": 3.455
    },
    {
        "text": "Instead, he gives a pretty authentic look at the wrong turns and tangents that ",
        "start": 643.76,
        "duration": 3.769
    },
    {
        "text": "are involved in the problem-solving process, not even eating up too much time to do so, ",
        "start": 647.529,
        "duration": 4.198
    },
    {
        "text": "and justifies each new step with a general problem-solving principle.",
        "start": 651.727,
        "duration": 3.293
    },
    {
        "text": "All of this microscale motivation could just as ",
        "start": 655.76,
        "duration": 2.447
    },
    {
        "text": "well be categorized as a subset of clarity.",
        "start": 658.207,
        "duration": 2.193
    },
    {
        "text": "If motivating a lesson determines how much attention and focus the viewer is ",
        "start": 660.86,
        "duration": 3.913
    },
    {
        "text": "willing to give you, clarity determines how quickly you burn through that focus.",
        "start": 664.773,
        "duration": 4.067
    },
    {
        "text": "The best hook in the world is wasted if the lesson which follows is confusing.",
        "start": 669.34,
        "duration": 3.66
    },
    {
        "text": "This presentation by Xplanaria talks about how to describe various crystal structures ",
        "start": 674.06,
        "duration": 4.69
    },
    {
        "text": "using group theory, which, considering the complex 3D forms involved and the fact ",
        "start": 678.75,
        "duration": 4.472
    },
    {
        "text": "that most people don't know group theory, has the potential to be very confusing.",
        "start": 683.222,
        "duration": 4.418
    },
    {
        "text": "But they do a really effective job at keeping concrete examples front and center, ",
        "start": 688.28,
        "duration": 4.015
    },
    {
        "text": "guiding the reader to focus on one relevant pattern at a time, ",
        "start": 692.295,
        "duration": 3.084
    },
    {
        "text": "and distilling down to a simple version of an idea before seeing how that fits into a ",
        "start": 695.379,
        "duration": 4.212
    },
    {
        "text": "broader, more general setting.",
        "start": 699.591,
        "duration": 1.469
    },
    {
        "text": "In general, entries that struck me as especially clear would often keep one or two ",
        "start": 701.98,
        "duration": 4.074
    },
    {
        "text": "examples front and center, and they'd often give a feeling of playing with those ",
        "start": 706.054,
        "duration": 3.977
    },
    {
        "text": "examples, maybe running simulations or tweaking them to run up against edge cases, ",
        "start": 710.031,
        "duration": 4.075
    },
    {
        "text": "and all around giving the viewer a chance to build their own intuitions before general ",
        "start": 714.106,
        "duration": 4.272
    },
    {
        "text": "rules are presented.",
        "start": 718.378,
        "duration": 0.982
    },
    {
        "text": "The example doesn't even have to be explicit.",
        "start": 719.84,
        "duration": 2.7
    },
    {
        "text": "In a visually driven lesson, the choice of what to show on screen when ",
        "start": 723.06,
        "duration": 3.683
    },
    {
        "text": "making general points is often a great opportunity to offer the viewer ",
        "start": 726.743,
        "duration": 3.684
    },
    {
        "text": "a concrete example to hold onto, but without wasting too much time ",
        "start": 730.427,
        "duration": 3.477
    },
    {
        "text": "explicitly talking about that example or overemphasizing its importance.",
        "start": 733.904,
        "duration": 3.736
    },
    {
        "text": "This I think is part of what gives visually driven lessons the opportunity to be clearer.",
        "start": 738.12,
        "duration": 4.02
    },
    {
        "text": "As a brief side comment by the way loosely related to clarity, ",
        "start": 743.06,
        "duration": 3.26
    },
    {
        "text": "for any of you who want to use music in the videos, ",
        "start": 746.32,
        "duration": 2.692
    },
    {
        "text": "while music can enrich the storytelling aspect of a lesson, ",
        "start": 749.012,
        "duration": 3.105
    },
    {
        "text": "setting the desired tone and momentum, once you're getting into the meat of a ",
        "start": 752.117,
        "duration": 4.037
    },
    {
        "text": "technical explanation it's very easy for the music to do more harm than good.",
        "start": 756.154,
        "duration": 3.986
    },
    {
        "text": "If it's there at all you'll want it to be decidedly ",
        "start": 760.62,
        "duration": 2.354
    },
    {
        "text": "in the background and not calling attention to itself.",
        "start": 762.974,
        "duration": 2.446
    },
    {
        "text": "I recognize some hypocrisy here, it's definitely something I know I've messed up with ",
        "start": 766.08,
        "duration": 3.718
    },
    {
        "text": "past videos, and it's just worth thinking about whatever benefit you see from the ",
        "start": 769.798,
        "duration": 3.546
    },
    {
        "text": "music you don't want to incur a needless cost on clarity that outweighs that benefit.",
        "start": 773.344,
        "duration": 3.676
    },
    {
        "text": "Moving on to novelty, this is another category that has two distinct interpretations.",
        "start": 778.02,
        "duration": 4.1
    },
    {
        "text": "One would be stylistic originality.",
        "start": 782.94,
        "duration": 2.18
    },
    {
        "text": "Back when I created this channel, part of the reason I wrote my own ",
        "start": 785.68,
        "duration": 3.561
    },
    {
        "text": "animation tool behind it was to ensure a kind of stylistic originality.",
        "start": 789.241,
        "duration": 3.719
    },
    {
        "text": "Well, the main reason was it was a fun side project, ",
        "start": 793.3,
        "duration": 2.616
    },
    {
        "text": "and having my hands deep into the guts of some tool helped me to feel ",
        "start": 795.916,
        "duration": 3.457
    },
    {
        "text": "less constrained in trying to visualize whatever came to mind, ",
        "start": 799.373,
        "duration": 3.111
    },
    {
        "text": "but being a forcing function for originality was at least a small part of my reasoning.",
        "start": 802.484,
        "duration": 4.296
    },
    {
        "text": "This means there's at least a little hint of irony in the fact ",
        "start": 807.62,
        "duration": 3.109
    },
    {
        "text": "that if we fast forward to today, so many of the entries in this contest use that tool, ",
        "start": 810.729,
        "duration": 4.343
    },
    {
        "text": "Manum, to illustrate their lessons.",
        "start": 815.072,
        "duration": 1.728
    },
    {
        "text": "I have nothing wrong with that, it actually delights me, ",
        "start": 817.46,
        "duration": 2.244
    },
    {
        "text": "it's why I made it open source, and I'm very grateful to the Manum ",
        "start": 819.704,
        "duration": 2.639
    },
    {
        "text": "community for everything they've done to make the tool more accessible.",
        "start": 822.343,
        "duration": 2.797
    },
    {
        "text": "But I would still encourage people to find their own unique voice and aesthetic, ",
        "start": 825.88,
        "duration": 3.865
    },
    {
        "text": "whatever tools they use, and whoever they take inspiration from.",
        "start": 829.745,
        "duration": 3.055
    },
    {
        "text": "I don't want to overemphasize that point because it's the much less important ",
        "start": 833.32,
        "duration": 3.638
    },
    {
        "text": "half of novelty, the much more important kind of novelty is when the thing ",
        "start": 836.958,
        "duration": 3.498
    },
    {
        "text": "you present would have been very hard to find elsewhere on the internet, ",
        "start": 840.456,
        "duration": 3.405
    },
    {
        "text": "either because it's a highly unique topic or because it's a very unique perspective.",
        "start": 843.861,
        "duration": 3.919
    },
    {
        "text": "For example, this video on percolation showed a completely fascinating toy model for ",
        "start": 848.74,
        "duration": 4.279
    },
    {
        "text": "studying phase changes, a model where it's easier to make exact proofs, ",
        "start": 853.019,
        "duration": 3.626
    },
    {
        "text": "and considering the level of depth and the level of clarity the authors provided, ",
        "start": 856.645,
        "duration": 4.128
    },
    {
        "text": "I think it's fair to say you wouldn't find something like this on YouTube if this ",
        "start": 860.773,
        "duration": 4.129
    },
    {
        "text": "group hadn't made it.",
        "start": 864.902,
        "duration": 1.058
    },
    {
        "text": "As to memorability, I'll keep this one quick.",
        "start": 866.66,
        "duration": 2.3
    },
    {
        "text": "Lessons tick off this box when they ask a question that's just so fun to think about, ",
        "start": 869.44,
        "duration": 4.475
    },
    {
        "text": "or provide such a satisfying aha moment that it stays with you ",
        "start": 873.915,
        "duration": 3.279
    },
    {
        "text": "long after watching it or reading it.",
        "start": 877.194,
        "duration": 1.926
    },
    {
        "text": "Admittedly, this one is highly personal and subjective.",
        "start": 879.24,
        "duration": 2.4
    },
    {
        "text": "To my taste, for example, this video by Daria Ivanova discusses the question of when it's ",
        "start": 882.0,
        "duration": 4.745
    },
    {
        "text": "possible for a single track to have been left by a bicycle, that is, ",
        "start": 886.745,
        "duration": 3.638
    },
    {
        "text": "the back wheel goes through the same path that the front wheel does, ",
        "start": 890.383,
        "duration": 3.638
    },
    {
        "text": "which is just so fun to think about.",
        "start": 894.021,
        "duration": 1.899
    },
    {
        "text": "This video by Gurgly Bensik about how involute gears work had ",
        "start": 897.1,
        "duration": 3.306
    },
    {
        "text": "a really satisfying way of explaining why a certain gear design ",
        "start": 900.406,
        "duration": 3.414
    },
    {
        "text": "pattern worked so well that, for me at least, just stuck.",
        "start": 903.82,
        "duration": 3.04
    },
    {
        "text": "So with all of that, who are the chosen winners?",
        "start": 907.98,
        "duration": 1.84
    },
    {
        "text": "In the announcement I promised that one winner slot would go to an entry ",
        "start": 910.22,
        "duration": 3.358
    },
    {
        "text": "that was made as a collaboration, and that one goes to the percolation video.",
        "start": 913.578,
        "duration": 3.542
    },
    {
        "text": "The other four winners are, perhaps unsurprisingly, also ones that I've already mentioned.",
        "start": 917.6,
        "duration": 3.76
    },
    {
        "text": "They include the post about describing crystal structures with group theory, ",
        "start": 922.22,
        "duration": 3.422
    },
    {
        "text": "the video covering the history of calculus, the one about ray tracing and the algorithms ",
        "start": 925.642,
        "duration": 3.955
    },
    {
        "text": "to make it faster, and the problem solving lesson centered around a tricky hat riddle.",
        "start": 929.597,
        "duration": 3.823
    },
    {
        "text": "These entries really do speak for themselves, so rather than ",
        "start": 934.26,
        "duration": 2.526
    },
    {
        "text": "telling you too much more here, I encourage you to check them out.",
        "start": 936.786,
        "duration": 2.734
    },
    {
        "text": "To be honest, after I got it down to about 25 entries that I wanted to at ",
        "start": 939.9,
        "duration": 3.505
    },
    {
        "text": "least be honorable mentions, it was exceedingly hard to actually choose ",
        "start": 943.405,
        "duration": 3.411
    },
    {
        "text": "winners from that, since for each of these I could easily envision a target ",
        "start": 946.816,
        "duration": 3.6
    },
    {
        "text": "audience for whom that entry would actually be the best recommendation.",
        "start": 950.416,
        "duration": 3.364
    },
    {
        "text": "It was a game of comparing apples to oranges, but times 25.",
        "start": 954.28,
        "duration": 2.92
    },
    {
        "text": "Below the video I've left links to the other 20 that I chose as honorable mentions, ",
        "start": 957.98,
        "duration": 4.169
    },
    {
        "text": "and to a playlist that contains all the video submissions, ",
        "start": 962.149,
        "duration": 2.929
    },
    {
        "text": "and also to a blog post containing links to all of the non-video submissions.",
        "start": 965.078,
        "duration": 3.822
    },
    {
        "text": "Thanks to a sponsorship from Brilliant, each winner will get $1000 as a cash prize, ",
        "start": 969.84,
        "duration": 16.513
    },
    {
        "text": "and also, and much more importantly I think, a rare edition golden pie creature.",
        "start": 986.353,
        "duration": 15.727
    }
]