[
    {
        "text": "The last video I put out was about the index of refraction.",
        "start": 0.0,
        "duration": 2.92
    },
    {
        "text": "It talked about why light slows down when it passes through a medium, ",
        "start": 3.42,
        "duration": 3.5
    },
    {
        "text": "and in particular, why the rate of slowdown would depend on color.",
        "start": 6.92,
        "duration": 3.3
    },
    {
        "text": "It turns out people have a lot of questions about the index of refraction, ",
        "start": 10.88,
        "duration": 3.339
    },
    {
        "text": "and in this supplemental video I wanted to take a chance to answer a couple of them.",
        "start": 14.219,
        "duration": 3.741
    },
    {
        "text": "For example, how is it possible for this index to be lower than one, ",
        "start": 18.28,
        "duration": 3.466
    },
    {
        "text": "which seems to imply that light would travel faster than the speed of light through ",
        "start": 21.746,
        "duration": 4.22
    },
    {
        "text": "some materials.",
        "start": 25.966,
        "duration": 0.754
    },
    {
        "text": "To kick things off though, I want to take a question that does not ",
        "start": 31.98,
        "duration": 3.704
    },
    {
        "text": "require too much background, asked by Kevin O'Toole, ",
        "start": 35.684,
        "duration": 2.93
    },
    {
        "text": "which is why exactly light slowing down would imply that it bends as it enters a medium.",
        "start": 38.614,
        "duration": 4.866
    },
    {
        "text": "There's a common analogy, which is to think of something like a car or a tank, ",
        "start": 44.36,
        "duration": 3.904
    },
    {
        "text": "where it turns a little bit while one side of it slows down before the other, ",
        "start": 48.264,
        "duration": 3.854
    },
    {
        "text": "and although it's a very visceral and memorable analogy, it's not like light has wheels, ",
        "start": 52.118,
        "duration": 4.399
    },
    {
        "text": "and it also tells you nothing about how to be more quantitative.",
        "start": 56.517,
        "duration": 3.163
    },
    {
        "text": "Derive the formula describing exactly how much light bends.",
        "start": 60.06,
        "duration": 3.8
    },
    {
        "text": "Here's a better way to think about it.",
        "start": 64.459,
        "duration": 1.441
    },
    {
        "text": "If you have some light wave shining into a material like glass, ",
        "start": 65.94,
        "duration": 3.385
    },
    {
        "text": "if it slows down, notice how that means that it gets kind of scrunched up.",
        "start": 69.325,
        "duration": 3.915
    },
    {
        "text": "If its wavelength in a vacuum was some number lambda, ",
        "start": 73.44,
        "duration": 2.665
    },
    {
        "text": "then the wavelength inside this material, where it's gotten slowed down, ",
        "start": 76.105,
        "duration": 3.604
    },
    {
        "text": "is something smaller than that.",
        "start": 79.709,
        "duration": 1.531
    },
    {
        "text": "Here I am drawing the wave only on a one-dimensional line, ",
        "start": 81.8,
        "duration": 3.248
    },
    {
        "text": "but we need to understand it in at least two dimensions, where every point on this plane, ",
        "start": 85.048,
        "duration": 4.956
    },
    {
        "text": "for example, is associated with a little vector in the electric field oscillating ",
        "start": 90.004,
        "duration": 4.515
    },
    {
        "text": "up and down.",
        "start": 94.519,
        "duration": 0.661
    },
    {
        "text": "This particular animation is a little bit messy and hard to follow, ",
        "start": 95.74,
        "duration": 3.591
    },
    {
        "text": "so it might be clearer if instead we simply color every point of the plane, ",
        "start": 99.331,
        "duration": 4.013
    },
    {
        "text": "such that those points are white near the crests of the wave, ",
        "start": 103.344,
        "duration": 3.274
    },
    {
        "text": "and then black away from the crests.",
        "start": 106.618,
        "duration": 1.902
    },
    {
        "text": "You can still clearly see the wavelength as the distance between these crests.",
        "start": 109.02,
        "duration": 3.56
    },
    {
        "text": "It's exactly what we were looking at before, just drawn in a different way, ",
        "start": 112.82,
        "duration": 3.433
    },
    {
        "text": "and in particular notice how they're scrunched up inside the glass.",
        "start": 116.253,
        "duration": 3.027
    },
    {
        "text": "If that glass were positioned at an angle, think ",
        "start": 119.92,
        "duration": 2.474
    },
    {
        "text": "about what happens to each one of those wave crests.",
        "start": 122.394,
        "duration": 2.626
    },
    {
        "text": "As it hits the glass, the lower parts slow down before the top parts, ",
        "start": 125.46,
        "duration": 4.2
    },
    {
        "text": "causing it to get sort of smeared out.",
        "start": 129.66,
        "duration": 2.28
    },
    {
        "text": "It reminds me a little of the rolling shutter effect, ",
        "start": 132.28,
        "duration": 2.7
    },
    {
        "text": "and overall the wave crest ends up at a different angle.",
        "start": 134.98,
        "duration": 2.8
    },
    {
        "text": "When you take into account the fact that for a beam of light, ",
        "start": 138.5,
        "duration": 3.137
    },
    {
        "text": "the beam is always perpendicular to those wave crests, ",
        "start": 141.637,
        "duration": 2.783
    },
    {
        "text": "this means your light has to turn, and moreover you can calculate exactly ",
        "start": 144.42,
        "duration": 3.744
    },
    {
        "text": "how much it needs to turn.",
        "start": 148.164,
        "duration": 1.316
    },
    {
        "text": "Think about all those waves in the vacuum, with some kind of wavelength ",
        "start": 150.22,
        "duration": 3.671
    },
    {
        "text": "lambda-1 sitting between them, and focus on all the points where those ",
        "start": 153.891,
        "duration": 3.621
    },
    {
        "text": "crests intersect with the boundary between the vacuum and the glass.",
        "start": 157.512,
        "duration": 3.468
    },
    {
        "text": "But then consider those wave crests inside the glass.",
        "start": 161.38,
        "duration": 2.66
    },
    {
        "text": "If it was the case that no bending happened, then because the wavelength is smaller in ",
        "start": 164.22,
        "duration": 4.127
    },
    {
        "text": "there, when you look at all those intersection points, ",
        "start": 168.347,
        "duration": 2.61
    },
    {
        "text": "they would have to be closer together.",
        "start": 170.957,
        "duration": 1.803
    },
    {
        "text": "But of course that can't happen, whether you're looking at it from one side, ",
        "start": 172.76,
        "duration": 3.492
    },
    {
        "text": "or looking at it from the other, those intersection points are all the same.",
        "start": 176.252,
        "duration": 3.448
    },
    {
        "text": "So the only way this can work is if those wave crests ",
        "start": 180.22,
        "duration": 2.75
    },
    {
        "text": "inside the glass were oriented at a different angle.",
        "start": 182.97,
        "duration": 2.65
    },
    {
        "text": "You might mentally imagine turning them with a little knob to find ",
        "start": 186.3,
        "duration": 3.065
    },
    {
        "text": "the sweet spot angle where all those intersection points line up.",
        "start": 189.365,
        "duration": 2.975
    },
    {
        "text": "And for those of you into exercises, you could take a moment to try to write down ",
        "start": 192.78,
        "duration": 4.055
    },
    {
        "text": "the specific equation telling you how to relate the wavelengths inside and outside ",
        "start": 196.835,
        "duration": 4.105
    },
    {
        "text": "the glass with the angles between those wave crests and the boundary itself.",
        "start": 200.94,
        "duration": 3.76
    },
    {
        "text": "If you do this, what you write down is effectively the same thing as Snell's law, ",
        "start": 205.48,
        "duration": 3.555
    },
    {
        "text": "you just have a tiny bit of added work to relate the relevant angles here, ",
        "start": 209.035,
        "duration": 3.252
    },
    {
        "text": "and then to note how the speed and the wavelength all depend on each other.",
        "start": 212.287,
        "duration": 3.253
    },
    {
        "text": "To answer the other questions I want to get to, ",
        "start": 216.96,
        "duration": 2.069
    },
    {
        "text": "we're going to lean pretty heavily on the explanation from the main video.",
        "start": 219.029,
        "duration": 3.191
    },
    {
        "text": "I'm mostly assuming that people here will have watched that, ",
        "start": 222.62,
        "duration": 3.061
    },
    {
        "text": "but here's a quick recap of the key points.",
        "start": 225.681,
        "duration": 2.159
    },
    {
        "text": "When we talk about a light wave slowing down in a material, ",
        "start": 228.48,
        "duration": 3.316
    },
    {
        "text": "what's really going on is that its interaction with each ",
        "start": 231.796,
        "duration": 3.151
    },
    {
        "text": "layer of that material slightly kicks back the phase of the wave.",
        "start": 234.947,
        "duration": 3.593
    },
    {
        "text": "Now a continuous sequence of infinitesimal phase kicks like this produces ",
        "start": 239.0,
        "duration": 4.201
    },
    {
        "text": "something that's mathematically identical to a wave that's just traveling slower.",
        "start": 243.201,
        "duration": 4.599
    },
    {
        "text": "The actual mechanism for that phase kick is that the incoming light ",
        "start": 248.52,
        "duration": 3.653
    },
    {
        "text": "wave causes the charges in the material to oscillate a little bit.",
        "start": 252.173,
        "duration": 3.547
    },
    {
        "text": "Those oscillations produce their own propagation in the electromagnetic field, ",
        "start": 255.72,
        "duration": 4.477
    },
    {
        "text": "and when you add together this newly induced wave with the original one, ",
        "start": 260.197,
        "duration": 4.138
    },
    {
        "text": "then in the region of space past that layer, the sum looks just like ",
        "start": 264.335,
        "duration": 3.91
    },
    {
        "text": "a copy of that original wave, but shifted back a little.",
        "start": 268.245,
        "duration": 3.175
    },
    {
        "text": "The last key point is that if you want to know the size of that phase shift, ",
        "start": 272.2,
        "duration": 4.313
    },
    {
        "text": "which is what determines the index of refraction, ",
        "start": 276.513,
        "duration": 2.8
    },
    {
        "text": "we model the charges in the material as simple harmonic oscillators, ",
        "start": 279.313,
        "duration": 3.866
    },
    {
        "text": "bound to some equilibrium position with a linear restoring force.",
        "start": 283.179,
        "duration": 3.641
    },
    {
        "text": "What we found is that the amplitude of oscillation, ",
        "start": 287.32,
        "duration": 3.056
    },
    {
        "text": "when you shine a light on a charge like this, will depend on how close the ",
        "start": 290.376,
        "duration": 4.408
    },
    {
        "text": "frequency of that light is to the resonant frequency associated with this ",
        "start": 294.784,
        "duration": 4.35
    },
    {
        "text": "spring-like restoring force.",
        "start": 299.134,
        "duration": 1.646
    },
    {
        "text": "Or to put it shortly, the index of refraction depends on ",
        "start": 301.16,
        "duration": 3.291
    },
    {
        "text": "how much the light resonates with charges in the material.",
        "start": 304.451,
        "duration": 3.349
    },
    {
        "text": "As an example of one phenomenon that this explanation helps us to understand, ",
        "start": 308.59,
        "duration": 4.433
    },
    {
        "text": "let's take a question asked by Dan Stock, which is what causes birefringence?",
        "start": 313.023,
        "duration": 4.377
    },
    {
        "text": "So this is a phenomenon where a material has two distinct indices of refraction, ",
        "start": 318.06,
        "duration": 4.593
    },
    {
        "text": "which has the effect of making you see double when you look through it.",
        "start": 322.653,
        "duration": 4.027
    },
    {
        "text": "Imagine you have some kind of crystal structure such that the ions in that ",
        "start": 327.46,
        "duration": 4.112
    },
    {
        "text": "structure will have some restoring force when you pull them in one direction, ",
        "start": 331.572,
        "duration": 4.277
    },
    {
        "text": "which is distinct from the restoring force when you pull them in another direction.",
        "start": 335.849,
        "duration": 4.551
    },
    {
        "text": "That is, the resonant frequency for oscillations in one direction ",
        "start": 341.3,
        "duration": 3.52
    },
    {
        "text": "is distinct from the resonant frequency from oscillations in another.",
        "start": 344.82,
        "duration": 3.68
    },
    {
        "text": "What that means is if you shine some light through this material, ",
        "start": 348.92,
        "duration": 3.554
    },
    {
        "text": "then because the index of refraction depends on resonance, ",
        "start": 352.474,
        "duration": 3.178
    },
    {
        "text": "the value of that index of refraction will be different for light ",
        "start": 355.652,
        "duration": 3.555
    },
    {
        "text": "that's oscillating up and down than it will for light that's oscillating side to side.",
        "start": 359.207,
        "duration": 4.633
    },
    {
        "text": "That is, it depends on the polarization of the light.",
        "start": 364.28,
        "duration": 3.08
    },
    {
        "text": "And this really happens.",
        "start": 367.72,
        "duration": 0.8
    },
    {
        "text": "The example you're looking at right now is calcite, ",
        "start": 368.76,
        "duration": 2.524
    },
    {
        "text": "and when you're seeing double, it's because light with one polarization ",
        "start": 371.284,
        "duration": 3.495
    },
    {
        "text": "is getting bent at a different rate than light with the other polarization.",
        "start": 374.779,
        "duration": 3.641
    },
    {
        "text": "For those of you who watched the videos about the barber pole effect, ",
        "start": 379.78,
        "duration": 3.48
    },
    {
        "text": "a very similar phenomenon answers the final question that we left there.",
        "start": 383.26,
        "duration": 3.58
    },
    {
        "text": "If you didn't watch those, feel free to jump ahead, but if you did, ",
        "start": 387.36,
        "duration": 3.886
    },
    {
        "text": "you might recall that where we left off was with a claim that sugar causes right-handed ",
        "start": 391.246,
        "duration": 5.029
    },
    {
        "text": "circularly polarized light to travel at a slightly different speed from left-handed ",
        "start": 396.275,
        "duration": 4.801
    },
    {
        "text": "circularly polarized light.",
        "start": 401.076,
        "duration": 1.544
    },
    {
        "text": "The reason that mattered is that it meant linearly polarized light, ",
        "start": 403.32,
        "duration": 4.156
    },
    {
        "text": "which can be expressed as a sum of those two, will slowly rotate ",
        "start": 407.476,
        "duration": 3.973
    },
    {
        "text": "over time as one of those two components lags behind the other.",
        "start": 411.449,
        "duration": 3.851
    },
    {
        "text": "Once you understand that an index of refraction depends on resonance, ",
        "start": 415.9,
        "duration": 3.653
    },
    {
        "text": "you can start to see why something like this might happen.",
        "start": 419.553,
        "duration": 3.027
    },
    {
        "text": "If the molecular structure of sucrose was one such that electrons might get ",
        "start": 423.3,
        "duration": 4.082
    },
    {
        "text": "pushed along a path with a clockwise component more freely than they get ",
        "start": 427.382,
        "duration": 3.921
    },
    {
        "text": "pushed along paths with counterclockwise components, ",
        "start": 431.303,
        "duration": 2.847
    },
    {
        "text": "well that would mean that the resonance with right-handed circularly polarized ",
        "start": 434.15,
        "duration": 4.244
    },
    {
        "text": "light would be a little different from what it is for left-handed circularly ",
        "start": 438.394,
        "duration": 4.136
    },
    {
        "text": "polarized light, and hence the indices of refraction would be slightly ",
        "start": 442.53,
        "duration": 3.814
    },
    {
        "text": "different for each one.",
        "start": 446.344,
        "duration": 1.236
    },
    {
        "text": "When you combine this together with the fact that the resonance depends on the frequency ",
        "start": 447.58,
        "duration": 4.905
    },
    {
        "text": "of the light, which is to say it depends on the color, ",
        "start": 452.485,
        "duration": 3.031
    },
    {
        "text": "this ultimately explains why the optical rotation in that barber pole effect separated ",
        "start": 455.516,
        "duration": 4.795
    },
    {
        "text": "out the colors the way that it did.",
        "start": 460.311,
        "duration": 1.929
    },
    {
        "text": "Now one example of a shape that would resonate differently with left-handed and ",
        "start": 462.94,
        "duration": 4.185
    },
    {
        "text": "right-handed circularly polarized light would be a helix, ",
        "start": 467.125,
        "duration": 3.035
    },
    {
        "text": "and in fact people will use a helical antenna when they want to pick up on radio ",
        "start": 470.16,
        "duration": 4.238
    },
    {
        "text": "waves with just one-handedness.",
        "start": 474.398,
        "duration": 1.622
    },
    {
        "text": "Although sucrose is not so clean and pure an example as a helix, ",
        "start": 476.02,
        "duration": 3.544
    },
    {
        "text": "the key property is that it is chiral, meaning it's fundamentally different from its ",
        "start": 479.564,
        "duration": 4.634
    },
    {
        "text": "mirror image, in that there's no way to reorient it in 3D space to make it look like ",
        "start": 484.198,
        "duration": 4.635
    },
    {
        "text": "its mirror image.",
        "start": 488.833,
        "duration": 0.927
    },
    {
        "text": "I will not pretend to know why this particular structure resonates ",
        "start": 490.24,
        "duration": 3.104
    },
    {
        "text": "with one-handedness more than another, but at least in principle ",
        "start": 493.344,
        "duration": 3.011
    },
    {
        "text": "it makes sense that chirality would lend itself to this phenomenon.",
        "start": 496.355,
        "duration": 3.105
    },
    {
        "text": "And finally, to wrap things up, let's hit what might be the most ",
        "start": 500.96,
        "duration": 3.385
    },
    {
        "text": "intriguing question of them all, which is how the index of refraction ",
        "start": 504.345,
        "duration": 3.646
    },
    {
        "text": "can be lower than one, since what that seems to imply is that the ",
        "start": 507.991,
        "duration": 3.438
    },
    {
        "text": "speed of light through a medium would be faster than the speed of light.",
        "start": 511.429,
        "duration": 3.75
    },
    {
        "text": "So this really does happen, and it's not as wild as you might think.",
        "start": 515.62,
        "duration": 3.039
    },
    {
        "text": "If you think back to how everything in our discussion arose from how a layer of material ",
        "start": 519.0,
        "duration": 4.525
    },
    {
        "text": "can kick back the phase of a wave, there is no reason that the layer of the material ",
        "start": 523.525,
        "duration": 4.322
    },
    {
        "text": "can't also kick forward the phase of that wave, and when you have many successive layers, ",
        "start": 527.847,
        "duration": 4.576
    },
    {
        "text": "kicking forward the phase like this, it gives the illusion of a wave that's traveling ",
        "start": 532.423,
        "duration": 4.373
    },
    {
        "text": "faster than the speed of light, in the sense that those crests genuinely are moving ",
        "start": 536.796,
        "duration": 4.272
    },
    {
        "text": "faster than c.",
        "start": 541.068,
        "duration": 0.712
    },
    {
        "text": "In fact, when you unpack the math underlying all of this, ",
        "start": 542.36,
        "duration": 2.926
    },
    {
        "text": "whenever the key amplitude expression that we wrote down is smaller than zero, ",
        "start": 545.286,
        "duration": 3.986
    },
    {
        "text": "that corresponds to an index of refraction smaller than one.",
        "start": 549.272,
        "duration": 3.028
    },
    {
        "text": "So in particular, if the frequency of the light, omega sub l, ",
        "start": 552.68,
        "duration": 3.869
    },
    {
        "text": "is bigger than the resonant frequency for our oscillator, you have this effect.",
        "start": 556.549,
        "duration": 4.931
    },
    {
        "text": "For example, when you shine an x-ray through glass, ",
        "start": 562.02,
        "duration": 2.322
    },
    {
        "text": "the index of refraction really is smaller than one.",
        "start": 564.342,
        "duration": 2.278
    },
    {
        "text": "There is no contradiction with causality here, ",
        "start": 567.56,
        "duration": 2.632
    },
    {
        "text": "and it's worth taking a moment to reflect on the role played by the speed ",
        "start": 570.192,
        "duration": 4.144
    },
    {
        "text": "c in all of this explanation.",
        "start": 574.336,
        "duration": 1.624
    },
    {
        "text": "c is the speed determining how long it takes for an ",
        "start": 576.58,
        "duration": 3.271
    },
    {
        "text": "accelerating charge to induce a force on any other charge.",
        "start": 579.851,
        "duration": 3.649
    },
    {
        "text": "Even if there's material in the way, whether that material has an index of refraction ",
        "start": 584.0,
        "duration": 4.45
    },
    {
        "text": "bigger than one or less than one, that amount of time that it takes for the influence ",
        "start": 588.45,
        "duration": 4.45
    },
    {
        "text": "of one charge to reach another is always the distance between them divided by c.",
        "start": 592.9,
        "duration": 4.14
    },
    {
        "text": "By contrast, the speed that's relevant to an index of ",
        "start": 597.88,
        "duration": 3.185
    },
    {
        "text": "refraction is how fast the crest of one of those waves is moving.",
        "start": 601.065,
        "duration": 3.835
    },
    {
        "text": "This is known as the phase velocity.",
        "start": 605.26,
        "duration": 1.84
    },
    {
        "text": "That phase velocity is what determines how much the wave gets scrunched up, ",
        "start": 607.62,
        "duration": 3.893
    },
    {
        "text": "which in turn determines how much it refracts or bends, ",
        "start": 611.513,
        "duration": 2.868
    },
    {
        "text": "which is part of the reason I think it's very good terminology to call this the index of ",
        "start": 614.381,
        "duration": 4.56
    },
    {
        "text": "refraction rather than say the index of slowing.",
        "start": 618.941,
        "duration": 2.459
    },
    {
        "text": "In general, the electric field inside a medium like glass is this incredibly ",
        "start": 622.12,
        "duration": 4.403
    },
    {
        "text": "complicated sum of a whole bunch of propagating influences from every one of ",
        "start": 626.523,
        "duration": 4.404
    },
    {
        "text": "the wiggling charges in that material, all together with the incoming light wave.",
        "start": 630.927,
        "duration": 4.633
    },
    {
        "text": "But importantly, all of those individual propagations are traveling at c, ",
        "start": 635.94,
        "duration": 4.366
    },
    {
        "text": "never slower, never faster.",
        "start": 640.306,
        "duration": 1.594
    },
    {
        "text": "It is miraculous that the way that these combine can be described simply at all, ",
        "start": 641.9,
        "duration": 4.494
    },
    {
        "text": "and that it's not some monstrously intractable mess.",
        "start": 646.394,
        "duration": 2.886
    },
    {
        "text": "But we are fortunate, and when you add them all up, ",
        "start": 649.78,
        "duration": 2.822
    },
    {
        "text": "the net effect can be described cleanly, and it looks just like a sine wave, ",
        "start": 652.602,
        "duration": 4.178
    },
    {
        "text": "one whose phase velocity happens to be different from c.",
        "start": 656.78,
        "duration": 3.04
    },
    {
        "text": "Another thing to keep in mind if it seems very weird for these ",
        "start": 660.4,
        "duration": 3.403
    },
    {
        "text": "wave crests to move faster than c is that everything in this ",
        "start": 663.803,
        "duration": 3.296
    },
    {
        "text": "explanation depends very heavily on things being in a steady state.",
        "start": 667.099,
        "duration": 3.621
    },
    {
        "text": "That's very different from say, trying to send ",
        "start": 671.0,
        "duration": 2.363
    },
    {
        "text": "information through the medium with a little pulse of light.",
        "start": 673.363,
        "duration": 3.017
    },
    {
        "text": "This is what Mithana explores in her videos on the index of refraction ",
        "start": 677.24,
        "duration": 3.258
    },
    {
        "text": "over on Looking Glass Universe, which you should definitely look at.",
        "start": 680.498,
        "duration": 3.122
    },
    {
        "text": "Over there she talks about how when you express a pulse of light as ",
        "start": 683.98,
        "duration": 3.754
    },
    {
        "text": "a sum of many pure sine waves, even if the phase velocities of those ",
        "start": 687.734,
        "duration": 3.81
    },
    {
        "text": "constituent components go faster than c, that doesn't necessarily ",
        "start": 691.544,
        "duration": 3.645
    },
    {
        "text": "imply that the center of mass of this pulse will itself go faster than c.",
        "start": 695.189,
        "duration": 4.031
    },
    {
        "text": "And in fact, when you simulate the effect of passing through a medium, ",
        "start": 699.64,
        "duration": 3.444
    },
    {
        "text": "when the index of refraction is less than one, ",
        "start": 703.084,
        "duration": 2.281
    },
    {
        "text": "what you find is a pulse that goes slower than c, ",
        "start": 705.365,
        "duration": 2.426
    },
    {
        "text": "even when the crests within it are going faster.",
        "start": 707.791,
        "duration": 2.329
    },
    {
        "text": "And if that still seems a bit weird, here's an analogy to help see ",
        "start": 710.92,
        "duration": 3.497
    },
    {
        "text": "why phase velocity can be way higher than the speed of anything real.",
        "start": 714.417,
        "duration": 3.603
    },
    {
        "text": "Imagine a little machine that has a bunch of rotating ",
        "start": 718.5,
        "duration": 2.938
    },
    {
        "text": "arms all extending from a shared shaft.",
        "start": 721.438,
        "duration": 2.122
    },
    {
        "text": "If you view this machine from the side, the tips of all of those arms ",
        "start": 724.04,
        "duration": 3.84
    },
    {
        "text": "form what looks like a wave, with crests traveling from right to left.",
        "start": 727.88,
        "duration": 3.84
    },
    {
        "text": "But if I go and reposition the arms to be angled quite close to each other, ",
        "start": 732.68,
        "duration": 4.039
    },
    {
        "text": "then you can make it so that the phase velocity of this emergent wave is ",
        "start": 736.719,
        "duration": 3.88
    },
    {
        "text": "arbitrarily high, potentially faster than the speed of light or anything else, ",
        "start": 740.599,
        "duration": 4.199
    },
    {
        "text": "even when the shaft is rotating at a gentle constant rate, ",
        "start": 744.798,
        "duration": 3.136
    },
    {
        "text": "and even when every component of the machine is moving at a reasonably slow pace.",
        "start": 747.934,
        "duration": 4.306
    },
    {
        "text": "Here, it's pretty obvious that such a machine doesn't violate the rules of physics, ",
        "start": 752.72,
        "duration": 4.017
    },
    {
        "text": "and that it doesn't let you send messages faster than light, ",
        "start": 756.737,
        "duration": 2.918
    },
    {
        "text": "because the wave crest is not a real object.",
        "start": 759.655,
        "duration": 2.105
    },
    {
        "text": "It's not something that could carry information.",
        "start": 762.24,
        "duration": 1.58
    },
    {
        "text": "It's more of an illusion.",
        "start": 764.0,
        "duration": 0.88
    },
    {
        "text": "The phase velocity in a light wave is similar.",
        "start": 765.44,
        "duration": 2.18
    },
    {
        "text": "Sure, if you shine an x-ray through glass, it is true that the wave crests go faster ",
        "start": 768.16,
        "duration": 4.495
    },
    {
        "text": "than the speed of light, but the underlying influences between electric charges that ",
        "start": 772.655,
        "duration": 4.496
    },
    {
        "text": "determine the field values in the first place are themselves all bound by the speed c.",
        "start": 777.151,
        "duration": 4.549
    }
]