[
    {
        "start": 3.757,
        "text": "Not infected yet, infected and contagious but with no symptoms,  and infected, contagious and showing symptoms. If you have widespread testing, you can get people  to self-isolate as soon as they show symptoms. The problem is that the virus still spreads because of all the  contacts that happened while people are contagious but asymptomatic. However, if when someone shows symptoms and tests positive, you isolate not only them,  but everyone they've been in contact with, you're staying one step ahead of the virus. The old-school way to do this is with interviews, but that's slow,  it's inefficient, and frankly it's quite the intrusion on people's privacy. Another approach in the modern world would be to ask people who've  tested positive to forfeit all the geolocation information from their phones,  and then to track down the people who've been in those same spots. But now we're well into big brother territory,  so do we have to sacrifice privacy for health? Well, I'll just let Nicky's illustration speak for itself here. There are several clever algorithms that let you alert everybody  "
    },
    {
        "start": 64.713,
        "text": "who's recently been in contact with someone who tests positive for COVID-19,  but without compromising the privacy of anybody involved. Side note here, I found this very surprising. I know it shouldn't have been, since I've gone through this dance many times  of thinking something's impossible only to see that cryptography makes it  actually possible, but I would not blame anybody at all for assuming that  downloading an app that can alert everybody you've been in contact with must  necessarily be tracking and revealing your location and a lot of other information. The code for these apps is entirely open, so you don't have to trust me or whoever  wrote the app or Nicky or anyone to believe it's doing what it really claims to be doing. Anyway, back to the post. Let's see how this works with the help of Alice and Bob. Alice gets a tracing app. Every five minutes her phone sends out some uniquely  pseudo-random gibberish to all the nearby devices using Bluetooth. Because these messages are pseudo-random, they don't use GPS and contain  no information about Alice's identity, not her location, not anything. "
    },
    {
        "start": 128.927,
        "text": "It really is gibberish, but the key point is that this gibberish is unique. Now, while her phone sends out messages, it also listens for messages from nearby phones. For example, Bob's. Bob also has a privacy-first tracing app that's compatible with, or the same, as Alice's. If Alice and Bob stay close to each other for more than five minutes,  their phones will exchange respective strings of unique gibberish. Both of these phones remember all of the messages  that they said and heard over the last 14 days. Again, because the random messages contain no information,  Alice's privacy is protected from Bob and vice versa. The next day, Alice develops a dry cough and a fever. Alice gets tested. Alice has COVID-19. This is not a good day for Alice. But she won't suffer in vain. Alice tells her app to upload all of the random gibberish  messages that it's been sending out to a hospital database. And to do this, she uses a one-time passcode given to her by her doctor. "
    },
    {
        "start": 191.287,
        "text": "This code is to prevent spam. The database then stores Alice's gibberish, and again,  the random messages give no information about Alice, where she was,  who she was with, what she was doing, or even how many people Alice met. It really is meaningless to the hospital. But it's not meaningless to Bob's phone. Bob's phone often checks this hospital list of random  messages that have come in from COVID-19 positive cases. Essentially, the hospital's database is saying to all the phones out there,  hey, we just got this new random gibberish. If you've seen that same random gibberish sometime in the last 14 days,  it means you've been in contact with someone who just tested positive for COVID-19. Once Bob's phone recognizes some of these numbers that are the gibberish snippets now  known to be associated with positive test cases, it can warn Bob to self quarantine. And so Bob cuts off the chain of transmissions. We're staying one step ahead of the virus. And that's it. That's how digital contact tracing apps can proactively  prevent the spread of COVID-19 while also protecting our rights. "
    },
    {
        "start": 255.307,
        "text": "Thanks, Alice and Bob. Stay safe. "
    }
]