[
    {
        "text": "Let me show you something I find completely magical.",
        "start": 0.0,
        "duration": 2.48
    },
    {
        "text": "Behind this piece of glass, there appears to be a three-dimensional scene.",
        "start": 3.22,
        "duration": 3.5
    },
    {
        "text": "You can move around your head and you see the ",
        "start": 7.26,
        "duration": 1.859
    },
    {
        "text": "light play off of the objects in different ways.",
        "start": 9.119,
        "duration": 1.941
    },
    {
        "text": "For example, that glass Klein bottle in the front warps what's behind it.",
        "start": 11.38,
        "duration": 3.92
    },
    {
        "text": "But it's an illusion.",
        "start": 15.46,
        "duration": 1.04
    },
    {
        "text": "In reality, all that's there is an empty table ",
        "start": 17.02,
        "duration": 2.641
    },
    {
        "text": "and a diverging laser beam shining on the glass.",
        "start": 19.661,
        "duration": 2.699
    },
    {
        "text": "Inside that glass is a single piece of film that's been exposed in ",
        "start": 23.0,
        "duration": 4.03
    },
    {
        "text": "a very special way that records the entire three-dimensional scene.",
        "start": 27.03,
        "duration": 4.03
    },
    {
        "text": "It's hard to capture in a video how surreal this feels in person ",
        "start": 32.56,
        "duration": 3.399
    },
    {
        "text": "because despite there being nothing behind that glass, ",
        "start": 35.959,
        "duration": 2.876
    },
    {
        "text": "every visual cue available is screaming to your brain that something really is there.",
        "start": 38.835,
        "duration": 4.445
    },
    {
        "text": "One of my favorite versions of this is a recording taken of a microscope.",
        "start": 43.78,
        "duration": 3.84
    },
    {
        "text": "Again, it gives this illusion of a three-dimensional ",
        "start": 48.14,
        "duration": 2.598
    },
    {
        "text": "object stored on a two-dimensional piece of film.",
        "start": 50.738,
        "duration": 2.402
    },
    {
        "text": "It's a little tricky to get this right, but if you put your eye at just the right ",
        "start": 53.58,
        "duration": 4.229
    },
    {
        "text": "point in space, you can look down the barrel of the microscope and see what it's imaging.",
        "start": 57.809,
        "duration": 4.591
    },
    {
        "text": "In this case, a little microchip.",
        "start": 62.78,
        "duration": 1.28
    },
    {
        "text": "I want you to take a moment to reflect on just how incredible this is simply ",
        "start": 65.08,
        "duration": 3.885
    },
    {
        "text": "from the standpoint of how much information needs to be stored on that film.",
        "start": 68.965,
        "duration": 3.835
    },
    {
        "text": "An ordinary photograph records a scene from just a single viewing angle, ",
        "start": 74.32,
        "duration": 4.269
    },
    {
        "text": "but right here we have available to us an entire continuum of differing perspectives.",
        "start": 78.589,
        "duration": 4.971
    },
    {
        "text": "In the first example, this includes how the light from the pie creature ",
        "start": 84.26,
        "duration": 3.282
    },
    {
        "text": "refracts through the glass in different ways from different angles, ",
        "start": 87.542,
        "duration": 3.1
    },
    {
        "text": "or how sometimes you get this little glint of light off the disco ball.",
        "start": 90.642,
        "duration": 3.238
    },
    {
        "text": "Every optical detail from all these viewing angles ",
        "start": 95.12,
        "duration": 2.864
    },
    {
        "text": "is stored on that two-dimensional piece of film.",
        "start": 97.984,
        "duration": 2.696
    },
    {
        "text": "What you're looking at is a hologram.",
        "start": 101.64,
        "duration": 2.02
    },
    {
        "text": "When most people hear the word hologram, what pops into their mind is something like ",
        "start": 109.58,
        "duration": 4.44
    },
    {
        "text": "what R2D2 projects in Star Wars, but real-world holograms are a special kind of recording ",
        "start": 114.02,
        "duration": 4.702
    },
    {
        "text": "taken on film that gives the illusion of looking through a window into a recorded scene.",
        "start": 118.722,
        "duration": 4.598
    },
    {
        "text": "The principle behind this was discovered by Dennis Gabor in 1947 while ",
        "start": 123.9,
        "duration": 3.68
    },
    {
        "text": "he was working on methods for electron microscopy, and as the story goes, ",
        "start": 127.58,
        "duration": 3.836
    },
    {
        "text": "the fundamental insight came to him while he was watching a tennis match.",
        "start": 131.416,
        "duration": 3.784
    },
    {
        "text": "It wasn't until decades later, with the invention of lasers, ",
        "start": 135.2,
        "duration": 3.644
    },
    {
        "text": "that holography actually became practical, and in 1971 Gabor won the Nobel Prize ",
        "start": 138.844,
        "duration": 4.84
    },
    {
        "text": "for his discovery.",
        "start": 143.684,
        "duration": 1.076
    },
    {
        "text": "The type that I'm showing you here, where the scene is visible only ",
        "start": 145.82,
        "duration": 3.163
    },
    {
        "text": "when you illuminate it with a laser from behind, is the simplest version.",
        "start": 148.983,
        "duration": 3.397
    },
    {
        "text": "It's what's called a transmission hologram.",
        "start": 152.68,
        "duration": 1.96
    },
    {
        "text": "In this video, you and I will roll up our sleeves ",
        "start": 155.08,
        "duration": 2.384
    },
    {
        "text": "and dig into the details to understand how this works.",
        "start": 157.464,
        "duration": 2.576
    },
    {
        "text": "A more advanced variant is what's called a white light reflection hologram, ",
        "start": 160.7,
        "duration": 3.84
    },
    {
        "text": "which as the name suggests can be illuminated using ordinary light that reflects ",
        "start": 164.54,
        "duration": 4.094
    },
    {
        "text": "off of it.",
        "start": 168.634,
        "duration": 0.506
    },
    {
        "text": "This includes that microscope that I was showing you earlier, ",
        "start": 169.58,
        "duration": 2.722
    },
    {
        "text": "which is part of a collection from the Exploratorium in San Francisco, ",
        "start": 172.302,
        "duration": 3.117
    },
    {
        "text": "which they very generously let us record.",
        "start": 175.419,
        "duration": 1.801
    },
    {
        "text": "First I want to show you the process for how you actually record a hologram, ",
        "start": 178.04,
        "duration": 3.692
    },
    {
        "text": "and then you and I will cover some of the fundamental principles of ",
        "start": 181.732,
        "duration": 3.261
    },
    {
        "text": "optics that explain one very simple and very specific hologram, ",
        "start": 184.993,
        "duration": 3.07
    },
    {
        "text": "but in such a way that we can get a deep and visceral understanding for it.",
        "start": 188.063,
        "duration": 3.597
    },
    {
        "text": "Then after that I'll share a slightly more abstract but much more ",
        "start": 192.02,
        "duration": 3.12
    },
    {
        "text": "powerful framing that explains how it works so well in general.",
        "start": 195.14,
        "duration": 2.98
    },
    {
        "text": "Optics can be tricky and sometimes magical, so my goal at each of these steps is ",
        "start": 198.82,
        "duration": 3.864
    },
    {
        "text": "for this to really feel like something that you could have rediscovered for yourself.",
        "start": 202.684,
        "duration": 4.056
    },
    {
        "text": "When my collaborator Paul and I asked around for help to record our own custom hologram, ",
        "start": 210.96,
        "duration": 4.379
    },
    {
        "text": "multiple people pointed us to these two very skilled holographers, ",
        "start": 215.339,
        "duration": 3.297
    },
    {
        "text": "Craig Newswanger and Sally Weber, who generously showed us the ropes when ",
        "start": 218.636,
        "duration": 3.641
    },
    {
        "text": "it comes to the delicate orchestration of lasers involved in doing this.",
        "start": 222.277,
        "duration": 3.543
    },
    {
        "text": "The whole setup risks feeling like a set of arbitrary steps, ",
        "start": 226.14,
        "duration": 3.009
    },
    {
        "text": "but I think maybe the best way to motivate it is to contrast what we're doing with ",
        "start": 229.149,
        "duration": 4.095
    },
    {
        "text": "ordinary photography.",
        "start": 233.244,
        "duration": 1.036
    },
    {
        "text": "In a photograph, a given point is only influenced by a very narrow ",
        "start": 234.76,
        "duration": 3.334
    },
    {
        "text": "region of the scene that you're recording, something like a pixel.",
        "start": 238.094,
        "duration": 3.286
    },
    {
        "text": "The simplest kind of camera would be a pinhole camera, ",
        "start": 241.78,
        "duration": 2.9
    },
    {
        "text": "where you only let light pass through a tiny little hole that exposes your film ",
        "start": 244.68,
        "duration": 4.219
    },
    {
        "text": "meaning each part of the film can only see one narrow little region of the ",
        "start": 248.899,
        "duration": 3.955
    },
    {
        "text": "scene through that hole.",
        "start": 252.854,
        "duration": 1.266
    },
    {
        "text": "The point is that you're limiting things to a single viewing angle to influence the film.",
        "start": 254.52,
        "duration": 4.2
    },
    {
        "text": "All of the other information from all other possible viewing angles is lost.",
        "start": 259.62,
        "duration": 3.7
    },
    {
        "text": "The key thought to have in your mind when it comes to a hologram is ",
        "start": 264.62,
        "duration": 3.717
    },
    {
        "text": "that the goal is to recreate the entire light field around a scene.",
        "start": 268.337,
        "duration": 3.663
    },
    {
        "text": "What I mean by that is when you set up some scene and there's some light shining on it, ",
        "start": 272.94,
        "duration": 4.366
    },
    {
        "text": "there's this incredibly complicated undulating electromagnetic field that ",
        "start": 277.306,
        "duration": 3.672
    },
    {
        "text": "surrounds everything, and the specifics of that field are dependent on every ",
        "start": 280.978,
        "duration": 3.821
    },
    {
        "text": "optical property of the objects in your scene and the lights illuminating it.",
        "start": 284.799,
        "duration": 3.821
    },
    {
        "text": "What you see when you're an observer depends on where your eye is in that field.",
        "start": 288.9,
        "duration": 4.96
    },
    {
        "text": "In our test scene, for example, from some angles you see the pie creature's eye refracted ",
        "start": 294.2,
        "duration": 4.378
    },
    {
        "text": "through the glass of the Klein bottle, from others you see a glint of light off that ",
        "start": 298.578,
        "duration": 4.136
    },
    {
        "text": "disco ball, but in principle everything you can see from various different viewing angles ",
        "start": 302.714,
        "duration": 4.378
    },
    {
        "text": "is entirely a function of whatever this undulating light field is that surrounds the ",
        "start": 307.092,
        "duration": 4.136
    },
    {
        "text": "scene.",
        "start": 311.228,
        "duration": 0.292
    },
    {
        "text": "So if you could come up with a procedure that recreates the full state of that field, ",
        "start": 311.86,
        "duration": 4.267
    },
    {
        "text": "even when the objects are no longer there, it would give the ",
        "start": 316.127,
        "duration": 3.027
    },
    {
        "text": "complete illusion that we're aiming for.",
        "start": 319.154,
        "duration": 1.986
    },
    {
        "text": "Contrast this with the pinhole camera, where a ton of information ",
        "start": 322.66,
        "duration": 3.275
    },
    {
        "text": "is lost about that light field based on filtering through the hole.",
        "start": 325.935,
        "duration": 3.325
    },
    {
        "text": "After all, that hole is there to limit the exposure to just one viewing angle.",
        "start": 329.86,
        "duration": 3.26
    },
    {
        "text": "So the first thing you would do if you wanted to record the whole field is to get ",
        "start": 333.82,
        "duration": 3.573
    },
    {
        "text": "rid of that pinhole altogether, or the lens that simulates it with most cameras.",
        "start": 337.393,
        "duration": 3.487
    },
    {
        "text": "On its own, exposing the film would now create a non-sensically blurred mess, ",
        "start": 341.42,
        "duration": 4.252
    },
    {
        "text": "but the key to making it sensible is to account for another piece of ",
        "start": 345.672,
        "duration": 3.762
    },
    {
        "text": "information about light that normal photography loses, phase.",
        "start": 349.434,
        "duration": 3.326
    },
    {
        "text": "Think about a beam of light shining on a single point of film, ",
        "start": 353.52,
        "duration": 2.993
    },
    {
        "text": "say one that has a pure frequency that you could think of as an oscillating sine wave.",
        "start": 356.513,
        "duration": 4.087
    },
    {
        "text": "The height of this wave is called its amplitude, ",
        "start": 361.34,
        "duration": 2.495
    },
    {
        "text": "and how far you are along in the cycle is called the phase.",
        "start": 363.835,
        "duration": 3.005
    },
    {
        "text": "Only one of those determines how much the film gets exposed, the amplitude of the wave.",
        "start": 367.58,
        "duration": 4.24
    },
    {
        "text": "The exposure takes some time, and it's influenced ",
        "start": 372.14,
        "duration": 2.174
    },
    {
        "text": "by the average intensity of this wave over that time.",
        "start": 374.314,
        "duration": 2.306
    },
    {
        "text": "Actually, more specifically, the exposure is proportional ",
        "start": 377.34,
        "duration": 2.922
    },
    {
        "text": "to the square of the amplitude of this wave.",
        "start": 380.262,
        "duration": 2.218
    },
    {
        "text": "That's going to be important for us much later.",
        "start": 382.88,
        "duration": 1.6
    },
    {
        "text": "If you were to shift this wave back by half of its wavelength, ",
        "start": 385.32,
        "duration": 2.975
    },
    {
        "text": "it makes no difference to the exposure on the film, ",
        "start": 388.295,
        "duration": 2.456
    },
    {
        "text": "in a sense that point of the film completely forgets everything about the ",
        "start": 390.751,
        "duration": 3.495
    },
    {
        "text": "phase of the light that exposed it.",
        "start": 394.246,
        "duration": 1.654
    },
    {
        "text": "You could almost reinvent holography for yourself if you ask, ",
        "start": 396.48,
        "duration": 3.384
    },
    {
        "text": "how might it be possible to record the phase of the light, not just the amplitude?",
        "start": 399.864,
        "duration": 4.476
    },
    {
        "text": "Can you come up with a procedure where one beam of light would expose the ",
        "start": 405.1,
        "duration": 4.027
    },
    {
        "text": "film differently than another beam that is in all respects identical, ",
        "start": 409.127,
        "duration": 3.81
    },
    {
        "text": "except for the fact that its phase is shifted back, say by half of a cycle?",
        "start": 412.937,
        "duration": 4.083
    },
    {
        "text": "If you give yourself a moment, and if you're rather clever, ",
        "start": 418.12,
        "duration": 2.593
    },
    {
        "text": "you might think of something like this.",
        "start": 420.713,
        "duration": 1.687
    },
    {
        "text": "Shine on a second beam of light that has exactly the same frequency.",
        "start": 423.08,
        "duration": 3.78
    },
    {
        "text": "We're going to call this the reference wave.",
        "start": 427.3,
        "duration": 1.6
    },
    {
        "text": "When the first beam is in sync with that reference wave, ",
        "start": 429.34,
        "duration": 3.098
    },
    {
        "text": "the two will constructively interfere, producing a wave that has twice the amplitude, ",
        "start": 432.438,
        "duration": 4.675
    },
    {
        "text": "so the film gets exposed a lot at that point.",
        "start": 437.113,
        "duration": 2.447
    },
    {
        "text": "But if that first beam was shifted back half of a cycle, ",
        "start": 440.12,
        "duration": 3.039
    },
    {
        "text": "the two would now cancel out with each other, interfering destructively, ",
        "start": 443.159,
        "duration": 3.894
    },
    {
        "text": "so the film would be exposed much less at that point.",
        "start": 447.053,
        "duration": 2.827
    },
    {
        "text": "It's not a perfect recording of the phase, but in this case the exposure is highly ",
        "start": 450.3,
        "duration": 4.332
    },
    {
        "text": "sensitive to phase shifts in a way that's not at all true for normal photography.",
        "start": 454.632,
        "duration": 4.228
    },
    {
        "text": "Admittedly, it might not yet be clear why this has anything to do with storing ",
        "start": 460.52,
        "duration": 4.065
    },
    {
        "text": "a three-dimensional scene on a two-dimensional film, but at least in principle, ",
        "start": 464.585,
        "duration": 4.117
    },
    {
        "text": "if you know that the goal is to recreate the full state of a light field around ",
        "start": 468.702,
        "duration": 4.118
    },
    {
        "text": "your scene, perhaps you could believe that having a record of the phase variations ",
        "start": 472.82,
        "duration": 4.271
    },
    {
        "text": "in that light field along the plane of the film might somehow be relevant.",
        "start": 477.091,
        "duration": 3.809
    },
    {
        "text": "This insight of interfering with a reference beam ",
        "start": 481.52,
        "duration": 2.91
    },
    {
        "text": "only works if all the light has the same frequency.",
        "start": 484.43,
        "duration": 2.97
    },
    {
        "text": "So looking at your setup, you cannot illuminate the scene with ordinary white light.",
        "start": 488.14,
        "duration": 4.0
    },
    {
        "text": "What you have to do is use a laser.",
        "start": 492.6,
        "duration": 1.8
    },
    {
        "text": "A clever way to do this is to pass that laser through a beam splitter, ",
        "start": 495.26,
        "duration": 3.647
    },
    {
        "text": "where half of it gets spread out, bounces off the scene, and hits the film.",
        "start": 498.907,
        "duration": 3.853
    },
    {
        "text": "We'll call that the object wave.",
        "start": 503.2,
        "duration": 1.58
    },
    {
        "text": "And then the other half also gets spread out, but it ",
        "start": 505.36,
        "duration": 2.345
    },
    {
        "text": "doesn't interact with anything before hitting the film.",
        "start": 507.705,
        "duration": 2.435
    },
    {
        "text": "This will act as the reference wave.",
        "start": 510.46,
        "duration": 1.78
    },
    {
        "text": "Those two waves interfere at the plane of the film in a ",
        "start": 512.679,
        "duration": 3.252
    },
    {
        "text": "way that depends heavily on the phase of that object wave.",
        "start": 515.931,
        "duration": 3.368
    },
    {
        "text": "The full setup that Craig and Sally made for us ",
        "start": 520.38,
        "duration": 2.016
    },
    {
        "text": "looks only a little bit more complicated than this.",
        "start": 522.396,
        "duration": 2.144
    },
    {
        "text": "One little nuance is that beam splitters change the polarization of light, ",
        "start": 524.9,
        "duration": 3.11
    },
    {
        "text": "so you have to do something to counteract that.",
        "start": 528.01,
        "duration": 1.95
    },
    {
        "text": "The object beam follows this trajectory here, which lets our scene ",
        "start": 530.26,
        "duration": 3.075
    },
    {
        "text": "get right up next to the film and get illuminated from the front.",
        "start": 533.335,
        "duration": 2.985
    },
    {
        "text": "And then on the left we have the reference beam.",
        "start": 536.32,
        "duration": 2.36
    },
    {
        "text": "But at a high level, the essence of any holography setup is to ",
        "start": 539.22,
        "duration": 3.279
    },
    {
        "text": "have these two different sources of light, both of the same single frequency, ",
        "start": 542.499,
        "duration": 4.061
    },
    {
        "text": "interfering with each other at the plane of the film.",
        "start": 546.56,
        "duration": 2.76
    },
    {
        "text": "This means that the exposure pattern on the film is based on the ",
        "start": 552.5,
        "duration": 3.143
    },
    {
        "text": "extremely subtle ways that these two waves interfere with each other.",
        "start": 555.643,
        "duration": 3.337
    },
    {
        "text": "The exposure pattern looks absolutely nothing like the original objects.",
        "start": 559.62,
        "duration": 3.82
    },
    {
        "text": "If you zoomed in with a microscope, you would see a complete mess, ",
        "start": 563.72,
        "duration": 3.168
    },
    {
        "text": "some rapidly oscillating fringes between points of high and low exposure.",
        "start": 566.888,
        "duration": 3.452
    },
    {
        "text": "From a practical standpoint, you should note how this also ",
        "start": 572.92,
        "duration": 2.918
    },
    {
        "text": "means the exposure pattern is incredibly sensitive to even the ",
        "start": 575.838,
        "duration": 3.117
    },
    {
        "text": "tiniest movement of the objects in the scene during the recording.",
        "start": 578.955,
        "duration": 3.265
    },
    {
        "text": "If their position shifts by an amount comparable to the wavelength of the light, ",
        "start": 582.86,
        "duration": 4.357
    },
    {
        "text": "a few hundred nanometers, it can completely change that pattern.",
        "start": 587.217,
        "duration": 3.443
    },
    {
        "text": "So when Craig and Sally were showing us the ropes, ",
        "start": 591.52,
        "duration": 2.351
    },
    {
        "text": "one thing that really surprised me was how part of the process involved all ",
        "start": 593.871,
        "duration": 3.504
    },
    {
        "text": "of us sitting in this meditative stillness throughout the exposure, ",
        "start": 597.375,
        "duration": 3.135
    },
    {
        "text": "which took a couple of minutes.",
        "start": 600.51,
        "duration": 1.43
    },
    {
        "text": "We even had to sit still during the minutes leading up to it, ",
        "start": 602.38,
        "duration": 3.053
    },
    {
        "text": "reducing as much motion as possible in the air of the room.",
        "start": 605.433,
        "duration": 2.907
    },
    {
        "text": "Now at this point, even if you believe that this resulting interference pattern ",
        "start": 609.08,
        "duration": 4.09
    },
    {
        "text": "on the film somehow records information about the light and its phase and all of that, ",
        "start": 613.17,
        "duration": 4.447
    },
    {
        "text": "it's not at all obvious how you could use it to recreate the original field, ",
        "start": 617.617,
        "duration": 3.937
    },
    {
        "text": "making that illusion of the scene behind the glass visible from many angles.",
        "start": 621.554,
        "duration": 3.886
    },
    {
        "text": "But here, my friend, is the magic.",
        "start": 626.32,
        "duration": 1.8
    },
    {
        "text": "If you now remove all the objects from the scene and you block that object beam, ",
        "start": 628.6,
        "duration": 4.628
    },
    {
        "text": "so the only thing shining on this now exposed film is the reference beam, ",
        "start": 633.228,
        "duration": 4.229
    },
    {
        "text": "then what it produces beyond the glass includes a complete recreation of that object ",
        "start": 637.457,
        "duration": 4.857
    },
    {
        "text": "wave, a recreation of light that would be there if the scene were still there and the ",
        "start": 642.314,
        "duration": 4.914
    },
    {
        "text": "object beam were still shining.",
        "start": 647.228,
        "duration": 1.772
    },
    {
        "text": "This is the surprise of holography, the mystery that you ",
        "start": 650.16,
        "duration": 2.653
    },
    {
        "text": "and I are going to dig into for the remainder of the video.",
        "start": 652.813,
        "duration": 2.747
    },
    {
        "text": "Why is it that shining the reference wave through this film, ",
        "start": 655.92,
        "duration": 3.528
    },
    {
        "text": "which was exposed using the combined object and reference waves, ",
        "start": 659.448,
        "duration": 3.761
    },
    {
        "text": "gives you such a bizarrely perfect recreation of the object?",
        "start": 663.209,
        "duration": 3.471
    },
    {
        "text": "How does this delicate and apparently nonsensical interference ",
        "start": 667.8,
        "duration": 3.665
    },
    {
        "text": "pattern on the film somehow record an entire three-dimensional scene?",
        "start": 671.465,
        "duration": 4.015
    },
    {
        "text": "To drive home how magical this feels, we cut out ",
        "start": 676.66,
        "duration": 2.234
    },
    {
        "text": "a very small circle from the film that we recorded.",
        "start": 678.894,
        "duration": 2.326
    },
    {
        "text": "In an ordinary photograph, cutting out a small piece obviously cuts away the ",
        "start": 681.66,
        "duration": 4.046
    },
    {
        "text": "vast majority of the scene, but for a hologram holding up that same small little ",
        "start": 685.706,
        "duration": 4.257
    },
    {
        "text": "circle of film to the reference beam, as you shift your viewing position looking ",
        "start": 689.963,
        "duration": 4.256
    },
    {
        "text": "through that circle, you can see essentially every part of the scene recorded, ",
        "start": 694.219,
        "duration": 4.152
    },
    {
        "text": "from that pie creature to the disco ball and the various shapes behind it.",
        "start": 698.371,
        "duration": 3.889
    },
    {
        "text": "You just can't see all of them at once.",
        "start": 702.46,
        "duration": 1.64
    },
    {
        "text": "Continuing with the goal of rediscovery, universal problem solving tip number one is ",
        "start": 706.04,
        "duration": 4.948
    },
    {
        "text": "to begin analyzing any hard problem by taking the simplest version of that problem.",
        "start": 710.988,
        "duration": 4.832
    },
    {
        "text": "So to puzzle over how holography works, a natural place you might start is to ask, ",
        "start": 716.64,
        "duration": 4.281
    },
    {
        "text": "what happens if you record a hologram of the simplest object you could think of, ",
        "start": 720.921,
        "duration": 4.178
    },
    {
        "text": "maybe a little point floating in three-dimensional space?",
        "start": 725.099,
        "duration": 2.941
    },
    {
        "text": "We'll think of the light that reflects as a wave ",
        "start": 728.46,
        "duration": 3.144
    },
    {
        "text": "propagating radially away from that point.",
        "start": 731.604,
        "duration": 2.696
    },
    {
        "text": "The basic outline for what follows is that we'll figure out what the exposure pattern ",
        "start": 735.62,
        "duration": 4.391
    },
    {
        "text": "on the film is in this very simple case, then deduce why shining the reference through ",
        "start": 740.011,
        "duration": 4.443
    },
    {
        "text": "that known exposure pattern creates the illusion of a single point behind the glass, ",
        "start": 744.454,
        "duration": 4.34
    },
    {
        "text": "even when it's not there, and then we'll generalize to more complicated objects.",
        "start": 748.794,
        "duration": 4.086
    },
    {
        "text": "I should maybe take a moment to be clear on how ",
        "start": 753.9,
        "duration": 1.852
    },
    {
        "text": "I'm representing light waves throughout this video.",
        "start": 755.752,
        "duration": 1.968
    },
    {
        "text": "Light is a wave in the electromagnetic field, where for example ",
        "start": 757.94,
        "duration": 3.352
    },
    {
        "text": "the electric half of that is an association between each point in ",
        "start": 761.292,
        "duration": 3.458
    },
    {
        "text": "space and a little oscillating vector pointing in three dimensions.",
        "start": 764.75,
        "duration": 3.51
    },
    {
        "text": "Where that field is strong in one direction, I'll color a point blue, ",
        "start": 769.26,
        "duration": 3.866
    },
    {
        "text": "and when it's strong in the opposite direction, I'll color it red, ",
        "start": 773.126,
        "duration": 3.7
    },
    {
        "text": "and the dark bands in between represent where it's zero.",
        "start": 776.826,
        "duration": 3.094
    },
    {
        "text": "In principle, the field exists everywhere in three-dimensional space, ",
        "start": 780.82,
        "duration": 3.344
    },
    {
        "text": "but typically it's a lot easier to think about if I only color the points along a ",
        "start": 784.164,
        "duration": 3.918
    },
    {
        "text": "two-dimensional slice of it.",
        "start": 788.082,
        "duration": 1.338
    },
    {
        "text": "Even more narrowly, it's often helpful to think of a little sine ",
        "start": 790.0,
        "duration": 3.317
    },
    {
        "text": "wave over this when we want to think of what the wave-like ",
        "start": 793.317,
        "duration": 3.01
    },
    {
        "text": "variations are just along a single one-dimensional line through space.",
        "start": 796.327,
        "duration": 3.573
    },
    {
        "text": "And for the detail oriented among you, throughout this video we'll be ",
        "start": 800.48,
        "duration": 3.296
    },
    {
        "text": "assuming that the light is linearly polarized, ",
        "start": 803.776,
        "duration": 2.213
    },
    {
        "text": "meaning it just oscillates in one direction, which it typically would be ",
        "start": 805.989,
        "duration": 3.438
    },
    {
        "text": "if we're recording a hologram.",
        "start": 809.427,
        "duration": 1.413
    },
    {
        "text": "Now, when we take a hologram of this single point, ",
        "start": 811.56,
        "duration": 2.937
    },
    {
        "text": "the radial wave coming from that point is our object wave, and for the reference wave, ",
        "start": 814.497,
        "duration": 5.012
    },
    {
        "text": "again in the spirit of simplicity, I want you to think of it as coming from very ",
        "start": 819.509,
        "duration": 4.665
    },
    {
        "text": "very far away, enough so that we can model it as a plane wave coming in ",
        "start": 824.174,
        "duration": 4.148
    },
    {
        "text": "perpendicular to the film.",
        "start": 828.322,
        "duration": 1.498
    },
    {
        "text": "In other words, what I mean by that is that all of the wave ",
        "start": 830.26,
        "duration": 3.087
    },
    {
        "text": "crests from that reference beam are parallel to the film.",
        "start": 833.347,
        "duration": 2.933
    },
    {
        "text": "You should know that in practice for real holography, ",
        "start": 836.96,
        "duration": 2.744
    },
    {
        "text": "you want this reference beam to come in at an angle, ",
        "start": 839.704,
        "duration": 2.694
    },
    {
        "text": "later on you're going to understand why, but for right now, keeping the analysis simple, ",
        "start": 842.398,
        "duration": 4.524
    },
    {
        "text": "making that beam perpendicular gives us a friendly situation to study.",
        "start": 846.922,
        "duration": 3.558
    },
    {
        "text": "I can simulate for you what the combination of both of these waves looks like, ",
        "start": 851.6,
        "duration": 3.83
    },
    {
        "text": "and what the resulting exposure pattern on the film looks like, ",
        "start": 855.43,
        "duration": 3.102
    },
    {
        "text": "but it is helpful to think through for yourself.",
        "start": 858.532,
        "duration": 2.328
    },
    {
        "text": "For example, if the light off of that object hitting the ",
        "start": 861.64,
        "duration": 2.942
    },
    {
        "text": "nearest point of the film happens to be in phase with the reference beam, ",
        "start": 864.582,
        "duration": 3.821
    },
    {
        "text": "it means that center point would be strongly exposed.",
        "start": 868.403,
        "duration": 2.737
    },
    {
        "text": "In that case, for points farther away from the center, ",
        "start": 871.66,
        "duration": 3.269
    },
    {
        "text": "because the distance to the object gets longer, ",
        "start": 874.929,
        "duration": 2.853
    },
    {
        "text": "the phase of the object wave along this strip falls in and out of phase ",
        "start": 877.782,
        "duration": 4.279
    },
    {
        "text": "with the reference wave, meaning that the exposure pattern oscillates ",
        "start": 882.061,
        "duration": 4.161
    },
    {
        "text": "between points of high and low exposure.",
        "start": 886.222,
        "duration": 2.378
    },
    {
        "text": "For example, at a certain point on that film, the distance to the ",
        "start": 889.12,
        "duration": 3.487
    },
    {
        "text": "object will be exactly half of a wavelength longer than the distance ",
        "start": 892.607,
        "duration": 3.646
    },
    {
        "text": "between the object and the closest point on the film, at that center.",
        "start": 896.253,
        "duration": 3.647
    },
    {
        "text": "So if the object and reference beams had been in phase in the middle, ",
        "start": 900.42,
        "duration": 3.744
    },
    {
        "text": "it would mean that they're exactly out of phase here, ",
        "start": 904.164,
        "duration": 2.889
    },
    {
        "text": "so the combined wave has a low amplitude and you get this dark spot at that point.",
        "start": 907.053,
        "duration": 4.387
    },
    {
        "text": "The same would be true for everything along this ring around the center, ",
        "start": 912.04,
        "duration": 3.815
    },
    {
        "text": "of all points the same distance to the object.",
        "start": 915.855,
        "duration": 2.405
    },
    {
        "text": "In general, the exposure pattern here looks like a bunch of concentric rings.",
        "start": 918.7,
        "duration": 3.66
    },
    {
        "text": "If you enjoy exercises, you might like taking a moment to try writing an explicit ",
        "start": 922.84,
        "duration": 4.515
    },
    {
        "text": "formula for the radii of all of those rings, as a function of the distance ",
        "start": 927.355,
        "duration": 4.13
    },
    {
        "text": "between the object point and the film, as well as the wavelength of the light.",
        "start": 931.485,
        "duration": 4.295
    },
    {
        "text": "At a more qualitative level though, just note that the distance between ",
        "start": 936.16,
        "duration": 3.516
    },
    {
        "text": "these fringes gets smaller as you go farther away from the middle.",
        "start": 939.676,
        "duration": 3.224
    },
    {
        "text": "This pattern is important enough in optics that it has its own special name, ",
        "start": 943.54,
        "duration": 3.57
    },
    {
        "text": "it's called a Fresnel zone plate.",
        "start": 947.11,
        "duration": 1.53
    },
    {
        "text": "The wavelength of visible light is really small, ",
        "start": 949.24,
        "duration": 2.63
    },
    {
        "text": "and that means that the fringes of exposed points are spaced very close together.",
        "start": 951.87,
        "duration": 4.35
    },
    {
        "text": "Farther away from the middle point, they approach the wavelength of the light itself.",
        "start": 956.9,
        "duration": 3.76
    },
    {
        "text": "In the simulation, notice how if I bring the object point closer, ",
        "start": 961.2,
        "duration": 3.614
    },
    {
        "text": "the inner rings get smaller, and if I pull that object point farther away, ",
        "start": 964.814,
        "duration": 4.107
    },
    {
        "text": "the inner rings get bigger.",
        "start": 968.921,
        "duration": 1.479
    },
    {
        "text": "So in a manner, this pattern records the three-dimensional coordinates of our point.",
        "start": 970.78,
        "duration": 5.26
    },
    {
        "text": "The center of the rings give you the xy coordinates, ",
        "start": 976.58,
        "duration": 2.559
    },
    {
        "text": "and the ring spacing uniquely determines the z coordinate.",
        "start": 979.139,
        "duration": 2.801
    },
    {
        "text": "So you go ahead and you record this simplest of all holograms, ",
        "start": 984.06,
        "duration": 3.317
    },
    {
        "text": "and you end up with film that has this peculiar zone plate exposure pattern.",
        "start": 987.377,
        "duration": 4.003
    },
    {
        "text": "But how does reconstruction work in this case?",
        "start": 991.64,
        "duration": 2.18
    },
    {
        "text": "What happens when you remove the object and the object beam, ",
        "start": 994.16,
        "duration": 3.406
    },
    {
        "text": "and the only thing shining on the exposed film is the reference wave?",
        "start": 997.566,
        "duration": 3.854
    },
    {
        "text": "Well, if you look at just a small region of the film, ",
        "start": 1002.44,
        "duration": 2.669
    },
    {
        "text": "the zone plate pattern looks like a bunch of parallel stripes, ",
        "start": 1005.109,
        "duration": 3.114
    },
    {
        "text": "and this is related to a very well-studied phenomenon in optics known ",
        "start": 1008.223,
        "duration": 3.461
    },
    {
        "text": "as a diffraction grating.",
        "start": 1011.684,
        "duration": 1.236
    },
    {
        "text": "And while I could just plop down something known as the ",
        "start": 1013.64,
        "duration": 2.642
    },
    {
        "text": "diffraction equation right now to continue with the explanation, ",
        "start": 1016.282,
        "duration": 3.067
    },
    {
        "text": "it is a real joy to see how it arises from first principles.",
        "start": 1019.349,
        "duration": 2.831
    },
    {
        "text": "So continuing that theme of letting this feel like something ",
        "start": 1022.66,
        "duration": 2.767
    },
    {
        "text": "that you might have rediscovered, let's take a brief sidestep ",
        "start": 1025.427,
        "duration": 2.814
    },
    {
        "text": "into a mini-lesson so that I don't have to rob you of that joy.",
        "start": 1028.241,
        "duration": 2.858
    },
    {
        "text": "Here's the basic puzzle for this mini-lesson.",
        "start": 1033.46,
        "duration": 2.159
    },
    {
        "text": "You've got a light wave shining onto a wall, and imagine this wall is solid and opaque, ",
        "start": 1036.14,
        "duration": 4.778
    },
    {
        "text": "except for having a bunch of very thin evenly spaced slits that the light can pass ",
        "start": 1040.918,
        "duration": 4.507
    },
    {
        "text": "through.",
        "start": 1045.425,
        "duration": 0.434
    },
    {
        "text": "The basic question is, what does the light wave look like on the other side of this wall?",
        "start": 1046.4,
        "duration": 4.6
    },
    {
        "text": "And in particular, how does it depend on the distance between those slits?",
        "start": 1051.26,
        "duration": 4.14
    },
    {
        "text": "Now, a full answer is extremely complicated, so much so that ",
        "start": 1056.4,
        "duration": 3.243
    },
    {
        "text": "it's surprising that we'll be able to say anything useful at all.",
        "start": 1059.643,
        "duration": 3.457
    },
    {
        "text": "And before I spoil the general shape of the answer with the simulation here, ",
        "start": 1063.48,
        "duration": 3.161
    },
    {
        "text": "let me be clear about how we're going to think about it.",
        "start": 1066.641,
        "duration": 2.299
    },
    {
        "text": "For each individual one of those slits, we'll imagine that it's ",
        "start": 1069.4,
        "duration": 3.267
    },
    {
        "text": "thin enough that you can model it as a single point emanating light, ",
        "start": 1072.667,
        "duration": 3.523
    },
    {
        "text": "matching whatever wavelength and frequency the incoming light has.",
        "start": 1076.19,
        "duration": 3.37
    },
    {
        "text": "So if there was some wall or film behind this single slit, ",
        "start": 1080.12,
        "duration": 2.662
    },
    {
        "text": "you wouldn't really see anything all that interesting.",
        "start": 1082.782,
        "duration": 2.438
    },
    {
        "text": "It would be brightest in the middle, and then taper off very gently to the side, ",
        "start": 1085.46,
        "duration": 4.287
    },
    {
        "text": "depending on how the amplitude of that wave diminishes over distance.",
        "start": 1089.747,
        "duration": 3.653
    },
    {
        "text": "In particular, nothing here really gives you a hint about the phase of the light, ",
        "start": 1093.86,
        "duration": 4.056
    },
    {
        "text": "so the wave nature remains relatively under-spoken.",
        "start": 1097.916,
        "duration": 2.524
    },
    {
        "text": "Very famously, this changes when you open up a second slit.",
        "start": 1101.12,
        "duration": 2.88
    },
    {
        "text": "In fact, when Thomas Young did this for monochromatic light in 1801, ",
        "start": 1104.42,
        "duration": 3.59
    },
    {
        "text": "it was one of the earliest confirmations that light really is a wave.",
        "start": 1108.01,
        "duration": 3.59
    },
    {
        "text": "For you and me, thinking about two slits is a nice warm-up before we get to more.",
        "start": 1112.04,
        "duration": 3.86
    },
    {
        "text": "As an example, think about the point at the center ",
        "start": 1116.34,
        "duration": 2.456
    },
    {
        "text": "of that wall on the opposite side of the slits.",
        "start": 1118.796,
        "duration": 2.264
    },
    {
        "text": "In that case, the waves coming from each one would be in phase with each other, ",
        "start": 1121.46,
        "duration": 3.814
    },
    {
        "text": "so they interfere constructively, and that's why you get a bright spot.",
        "start": 1125.274,
        "duration": 3.386
    },
    {
        "text": "If you move over a little bit to the side, where the distance to one ",
        "start": 1129.18,
        "duration": 3.5
    },
    {
        "text": "slit is exactly half a wavelength longer than the distance to the other, ",
        "start": 1132.68,
        "duration": 3.702
    },
    {
        "text": "they would add destructively, and that's why you get a dark spot.",
        "start": 1136.382,
        "duration": 3.298
    },
    {
        "text": "And in general, you get these oscillations between ",
        "start": 1141.42,
        "duration": 2.577
    },
    {
        "text": "bright and dark as you scan left to right.",
        "start": 1143.997,
        "duration": 2.123
    },
    {
        "text": "The key point here, which you have to imagine was a bit of a surprise in 1801, ",
        "start": 1147.02,
        "duration": 4.275
    },
    {
        "text": "is that the brightness on the wall is not just a sum of what it would be for each ",
        "start": 1151.295,
        "duration": 4.439
    },
    {
        "text": "individual slit.",
        "start": 1155.734,
        "duration": 0.866
    },
    {
        "text": "The key, when you have light just of one frequency like this, ",
        "start": 1157.0,
        "duration": 3.214
    },
    {
        "text": "is to understand where the waves are in and out of phase with each other.",
        "start": 1160.214,
        "duration": 3.786
    },
    {
        "text": "Also, I want you to notice how the pattern changes ",
        "start": 1165.66,
        "duration": 2.472
    },
    {
        "text": "if we change the wavelength of the light.",
        "start": 1168.132,
        "duration": 1.988
    },
    {
        "text": "A shorter wavelength would give more rapid oscillations between bright and dark spots.",
        "start": 1170.44,
        "duration": 4.12
    },
    {
        "text": "There's a really nice exhibit at the Exploratorium in ",
        "start": 1175.58,
        "duration": 2.312
    },
    {
        "text": "San Francisco showing this double slit interference.",
        "start": 1177.892,
        "duration": 2.228
    },
    {
        "text": "You shine a thin laser beam through two even thinner slits, and on a wall very far down, ",
        "start": 1180.54,
        "duration": 4.982
    },
    {
        "text": "what you see is an array of light and dark spots, just like what we saw in the simulation.",
        "start": 1185.522,
        "duration": 5.038
    },
    {
        "text": "That's just two slits, but remember that our key question is what happens when ",
        "start": 1191.78,
        "duration": 4.045
    },
    {
        "text": "you have a whole bunch of slits, say spaced a distance d away from each other.",
        "start": 1195.825,
        "duration": 3.995
    },
    {
        "text": "I have to say this was incredibly fun to simulate, ",
        "start": 1200.38,
        "duration": 2.455
    },
    {
        "text": "and you can probably guess how the simulation here is working.",
        "start": 1202.835,
        "duration": 2.985
    },
    {
        "text": "At every point in space, you consider the n different light waves coming from each ",
        "start": 1206.18,
        "duration": 4.506
    },
    {
        "text": "one of those slits, you add up the values of those waves, ",
        "start": 1210.686,
        "duration": 3.149
    },
    {
        "text": "which might add or subtract depending on their phase, ",
        "start": 1213.835,
        "duration": 2.932
    },
    {
        "text": "and then you color that point depending on the result.",
        "start": 1216.767,
        "duration": 2.933
    },
    {
        "text": "Blue for positive values, red for negative values.",
        "start": 1220.06,
        "duration": 2.36
    },
    {
        "text": "In the immediate vicinity of the slits, this is a complete chaotic mess, ",
        "start": 1223.04,
        "duration": 4.446
    },
    {
        "text": "but the surprise is that when you zoom out, order emerges.",
        "start": 1227.486,
        "duration": 3.534
    },
    {
        "text": "You have one beam of light shining down the middle, ",
        "start": 1236.42,
        "duration": 2.833
    },
    {
        "text": "but you also get these other beams shining off on either side, ",
        "start": 1239.253,
        "duration": 3.433
    },
    {
        "text": "and one of those beams specifically is going to be the key to explaining ",
        "start": 1242.686,
        "duration": 3.978
    },
    {
        "text": "our first hologram.",
        "start": 1246.664,
        "duration": 1.036
    },
    {
        "text": "In particular, I want you to understand how you'd ",
        "start": 1248.42,
        "duration": 2.663
    },
    {
        "text": "compute the angle between that other beam and the center.",
        "start": 1251.083,
        "duration": 3.037
    },
    {
        "text": "How would you analyze a point which is along a ",
        "start": 1254.84,
        "duration": 2.608
    },
    {
        "text": "line some angle theta away from that perpendicular?",
        "start": 1257.448,
        "duration": 2.832
    },
    {
        "text": "Well, the key question is what are the distances from that point ",
        "start": 1261.5,
        "duration": 3.633
    },
    {
        "text": "to all of the individual slits where the light is coming from?",
        "start": 1265.133,
        "duration": 3.467
    },
    {
        "text": "If this point is far enough away, then when you zoom in close to those slits, ",
        "start": 1268.96,
        "duration": 4.069
    },
    {
        "text": "all of those lines look like they're parallel to each other.",
        "start": 1273.029,
        "duration": 3.131
    },
    {
        "text": "What you want to know is whether a given one of these lines is longer than ",
        "start": 1276.94,
        "duration": 3.779
    },
    {
        "text": "another one of the lines, and more specifically, how much longer it would be.",
        "start": 1280.719,
        "duration": 3.881
    },
    {
        "text": "I think one of the nicest ways to think about this is to zoom out again so that ",
        "start": 1285.3,
        "duration": 4.049
    },
    {
        "text": "we can see the point we're analyzing, and imagine pivoting one of those lines ",
        "start": 1289.349,
        "duration": 3.948
    },
    {
        "text": "around that point so you're looking at everywhere else that's the same distance away.",
        "start": 1293.297,
        "duration": 4.303
    },
    {
        "text": "If you were zoomed in next to the slits, that pivoting motion ",
        "start": 1298.1,
        "duration": 3.445
    },
    {
        "text": "looks basically like you're translating in a perpendicular direction.",
        "start": 1301.545,
        "duration": 3.835
    },
    {
        "text": "So what that means is if you drop a little perpendicular line from one of the slits to ",
        "start": 1306.64,
        "duration": 5.263
    },
    {
        "text": "the line adjacent to it, you can conclude that the distance between that first slit and ",
        "start": 1311.903,
        "duration": 5.324
    },
    {
        "text": "the point we're analyzing is exactly the same as this section of the adjacent line, ",
        "start": 1317.227,
        "duration": 5.082
    },
    {
        "text": "meaning that the difference between those two distances is visible as this little snippet ",
        "start": 1322.309,
        "duration": 5.445
    },
    {
        "text": "right here.",
        "start": 1327.754,
        "duration": 0.666
    },
    {
        "text": "So the key question, if you want to understand whether those two waves ",
        "start": 1328.72,
        "duration": 3.395
    },
    {
        "text": "are in or out of phase with each other, is how big is that snippet?",
        "start": 1332.115,
        "duration": 3.205
    },
    {
        "text": "What's the size of that difference?",
        "start": 1335.54,
        "duration": 1.32
    },
    {
        "text": "Well if you go in and you draw the appropriate little right triangle, ",
        "start": 1337.8,
        "duration": 3.471
    },
    {
        "text": "the hypotenuse of that triangle is the spacing between the slits, ",
        "start": 1341.271,
        "duration": 3.273
    },
    {
        "text": "which I'm going to call d, so this key difference we care about looks like one ",
        "start": 1344.544,
        "duration": 3.917
    },
    {
        "text": "of the legs of that triangle, d times the sine of a certain little angle that ",
        "start": 1348.461,
        "duration": 3.868
    },
    {
        "text": "I'm going to call theta.",
        "start": 1352.329,
        "duration": 1.191
    },
    {
        "text": "It's not too hard to convince yourself that that angle theta is actually ",
        "start": 1354.22,
        "duration": 3.65
    },
    {
        "text": "the same as the angle between all these lines and the vertical, ",
        "start": 1357.87,
        "duration": 3.2
    },
    {
        "text": "so the difference between all of these lengths, ",
        "start": 1361.07,
        "duration": 2.4
    },
    {
        "text": "and this is really the key lesson of diffraction gradings, ",
        "start": 1363.47,
        "duration": 2.949
    },
    {
        "text": "looks like d times the sine of that angle.",
        "start": 1366.419,
        "duration": 2.101
    },
    {
        "text": "In particular, if it was the case that this key expression, d times the sine of theta, ",
        "start": 1369.04,
        "duration": 4.727
    },
    {
        "text": "happened to be exactly the wavelength of the light, commonly denoted lambda, ",
        "start": 1373.767,
        "duration": 4.184
    },
    {
        "text": "all of the beams emanating from these different slits are going to be in phase ",
        "start": 1377.951,
        "duration": 4.293
    },
    {
        "text": "with each other, so they'll constructively interfere at the point we're analyzing.",
        "start": 1382.244,
        "duration": 4.456
    },
    {
        "text": "This is why, even in the immediate vicinity, you have this chaotic mess that's very hard ",
        "start": 1387.46,
        "duration": 5.042
    },
    {
        "text": "to describe, zoomed out a sufficient distance away, ",
        "start": 1392.502,
        "duration": 2.946
    },
    {
        "text": "you have a distinct beam along a certain direction, and moreover, ",
        "start": 1395.448,
        "duration": 3.739
    },
    {
        "text": "you now know how to compute the angle of that direction.",
        "start": 1399.187,
        "duration": 3.173
    },
    {
        "text": "It's the angle such that d, the spacing between your slits, ",
        "start": 1402.78,
        "duration": 3.251
    },
    {
        "text": "times the sine of that angle equals the wavelength of the light.",
        "start": 1406.031,
        "duration": 3.469
    },
    {
        "text": "That will be a key equation for us, so do remember it, ",
        "start": 1409.9,
        "duration": 3.003
    },
    {
        "text": "but this graphic also helps give a nice qualitative intuition for how changing the ",
        "start": 1412.903,
        "duration": 4.533
    },
    {
        "text": "spacing influences the angle.",
        "start": 1417.436,
        "duration": 1.584
    },
    {
        "text": "Imagine locking the length of this critical leg of the triangle, ",
        "start": 1419.84,
        "duration": 2.912
    },
    {
        "text": "you want it to always equal the wavelength.",
        "start": 1422.752,
        "duration": 1.928
    },
    {
        "text": "Then if you want it to narrow the spacing of the grating, making d smaller, ",
        "start": 1425.1,
        "duration": 4.218
    },
    {
        "text": "the only way to keep that leg locked is to make the angle theta bigger.",
        "start": 1429.318,
        "duration": 3.942
    },
    {
        "text": "On the other hand, if you had a wider spacing and you increased that value d, ",
        "start": 1434.0,
        "duration": 4.166
    },
    {
        "text": "the only way to keep that leg locked is to decrease the value of theta.",
        "start": 1438.166,
        "duration": 3.794
    },
    {
        "text": "You can also say a little bit more here too.",
        "start": 1442.42,
        "duration": 1.86
    },
    {
        "text": "For large enough values of d, it's possible for d times the sine of ",
        "start": 1444.5,
        "duration": 3.572
    },
    {
        "text": "theta to not just be a single wavelength, but to equal two whole wavelengths, ",
        "start": 1448.072,
        "duration": 4.098
    },
    {
        "text": "so you would still get constructive interference but at a bigger angle, ",
        "start": 1452.17,
        "duration": 3.782
    },
    {
        "text": "and the same goes for any whole number multiple of the wavelength.",
        "start": 1455.952,
        "duration": 3.468
    },
    {
        "text": "And again, this is something that you can see in practice.",
        "start": 1460.52,
        "duration": 2.32
    },
    {
        "text": "Here we're shining a green laser through a diffraction ",
        "start": 1463.28,
        "duration": 2.993
    },
    {
        "text": "grating that has 500 lines per millimeter.",
        "start": 1466.273,
        "duration": 2.287
    },
    {
        "text": "You can not only see how it splits up into these distinct beams, ",
        "start": 1468.96,
        "duration": 3.213
    },
    {
        "text": "but you could actually do the math to figure out the angle between those beams.",
        "start": 1472.173,
        "duration": 3.907
    },
    {
        "text": "The centermost one is commonly called the zeroth order beam, ",
        "start": 1477.28,
        "duration": 2.936
    },
    {
        "text": "the ones immediately next to it are called the first order beams, ",
        "start": 1480.216,
        "duration": 3.177
    },
    {
        "text": "and if they exist, the other ones are called second order, third order, and so on.",
        "start": 1483.393,
        "duration": 3.947
    },
    {
        "text": "Another fun thing to notice is how this equation depends on the wavelength of the light.",
        "start": 1488.06,
        "duration": 4.42
    },
    {
        "text": "So if you shine white light through a diffraction grating like this, ",
        "start": 1492.76,
        "duration": 3.543
    },
    {
        "text": "you get a separation into distinct wavelengths, distinct colors like a rainbow.",
        "start": 1496.303,
        "duration": 4.057
    },
    {
        "text": "If you've ever noticed how the reflections off of a DVD or a CD produce ",
        "start": 1500.82,
        "duration": 3.701
    },
    {
        "text": "this rainbow pattern, it's essentially the same effect going on there.",
        "start": 1504.521,
        "duration": 3.599
    },
    {
        "text": "The angle of reflection depends on the spacing ",
        "start": 1508.36,
        "duration": 2.369
    },
    {
        "text": "between the ridges and the wavelength of the light.",
        "start": 1510.729,
        "duration": 2.571
    },
    {
        "text": "So that's the packaged lesson about diffraction gratings, ",
        "start": 1515.64,
        "duration": 2.706
    },
    {
        "text": "but now let's zoom out and remember why we were doing this.",
        "start": 1518.346,
        "duration": 2.754
    },
    {
        "text": "If you record a hologram of a simple point in space, ",
        "start": 1521.1,
        "duration": 3.327
    },
    {
        "text": "the exposure pattern on the film is this Fresnel zone plate, ",
        "start": 1524.427,
        "duration": 3.83
    },
    {
        "text": "concentric rings that get spaced closer together the farther you go away.",
        "start": 1528.257,
        "duration": 4.583
    },
    {
        "text": "In fact, you can be a little bit more quantitative ",
        "start": 1533.76,
        "duration": 2.559
    },
    {
        "text": "and write down the exact spacing between those fringes.",
        "start": 1536.319,
        "duration": 2.761
    },
    {
        "text": "Let's say you draw a line from a point on this film down to the object, ",
        "start": 1539.7,
        "duration": 3.836
    },
    {
        "text": "or maybe I should say down to where the object was during recording.",
        "start": 1543.536,
        "duration": 3.624
    },
    {
        "text": "Consider the angle between this line and the one perpendicular to the film, ",
        "start": 1548.02,
        "duration": 3.716
    },
    {
        "text": "which I'm going to call theta prime to distinguish it from ",
        "start": 1551.736,
        "duration": 2.885
    },
    {
        "text": "the diffraction angles we were just looking at.",
        "start": 1554.621,
        "duration": 2.299
    },
    {
        "text": "I won't narrate through all the details here, ",
        "start": 1557.2,
        "duration": 2.062
    },
    {
        "text": "but you can work out this fringe spacing exactly.",
        "start": 1559.262,
        "duration": 2.198
    },
    {
        "text": "You start with the premise that the distance between adjacent ",
        "start": 1561.82,
        "duration": 3.323
    },
    {
        "text": "fringes to the object should differ by one whole wavelength.",
        "start": 1565.143,
        "duration": 3.217
    },
    {
        "text": "I know some of you are curious and want to pause and ponder, ",
        "start": 1568.8,
        "duration": 3.008
    },
    {
        "text": "so I'll leave up the details, but the upshot is that it all boils down to a delightfully ",
        "start": 1571.808,
        "duration": 4.389
    },
    {
        "text": "clean and convenient fact.",
        "start": 1576.197,
        "duration": 1.283
    },
    {
        "text": "The spacing between the fringes for our Fresnel zone plate, which I'll label as D, ",
        "start": 1577.6,
        "duration": 4.93
    },
    {
        "text": "multiplied by the sine of this angle, theta prime, equals the wavelength of the light.",
        "start": 1582.53,
        "duration": 5.11
    },
    {
        "text": "This might give you a little déjà vu, and if it strikes you as uncannily similar to the ",
        "start": 1588.1,
        "duration": 4.844
    },
    {
        "text": "diffraction equation, you are 100% right and it's the key to how our first hologram works.",
        "start": 1592.944,
        "duration": 4.956
    },
    {
        "text": "When you just shine the reference wave through this pattern, ",
        "start": 1598.64,
        "duration": 3.603
    },
    {
        "text": "near a given point on the film, it acts like a diffraction grating, ",
        "start": 1602.243,
        "duration": 4.018
    },
    {
        "text": "splitting the wave into distinct beams, and the angle of those first ",
        "start": 1606.261,
        "duration": 4.076
    },
    {
        "text": "order beams satisfies the diffraction equation, D times sine of theta equals lambda.",
        "start": 1610.337,
        "duration": 4.963
    },
    {
        "text": "Therefore, the angle of one of these first order beams exactly matches ",
        "start": 1616.2,
        "duration": 4.072
    },
    {
        "text": "the angle of the line connecting this point of the film to where the ",
        "start": 1620.272,
        "duration": 3.958
    },
    {
        "text": "object was during recording, even though the object isn't there anymore.",
        "start": 1624.23,
        "duration": 4.13
    },
    {
        "text": "So, critically, think about why this would imply ",
        "start": 1631.5,
        "duration": 3.197
    },
    {
        "text": "there's the illusion of a point behind the screen.",
        "start": 1634.697,
        "duration": 3.263
    },
    {
        "text": "For an observer on the other side of that film, as the reference wave is shining onto it, ",
        "start": 1638.64,
        "duration": 5.705
    },
    {
        "text": "every point of that film is emitting multiple different beams, ",
        "start": 1644.345,
        "duration": 3.994
    },
    {
        "text": "but one of those beams at each point matches what a beam from that ",
        "start": 1648.339,
        "duration": 4.247
    },
    {
        "text": "object dot would look like if that object dot were still there.",
        "start": 1652.586,
        "duration": 3.994
    },
    {
        "text": "So the observer always sees this bright spot on the glass at a point where ",
        "start": 1656.78,
        "duration": 4.777
    },
    {
        "text": "a line from their eye to the past object position intersects the glass.",
        "start": 1661.557,
        "duration": 4.523
    },
    {
        "text": "As they move their head around, and their eye moves in 3D space, ",
        "start": 1666.26,
        "duration": 3.875
    },
    {
        "text": "that apparent bright spot on the glass moves with them in just such a ",
        "start": 1670.135,
        "duration": 4.174
    },
    {
        "text": "way that it gives the illusion of a floating point of light behind that glass.",
        "start": 1674.309,
        "duration": 4.651
    },
    {
        "text": "The way things are set up right now, the other ",
        "start": 1681.86,
        "duration": 2.292
    },
    {
        "text": "beams would add some distraction for that observer.",
        "start": 1684.152,
        "duration": 2.488
    },
    {
        "text": "The zeroth order beam, for example, at all of these points is essentially a rescaled ",
        "start": 1687.5,
        "duration": 3.84
    },
    {
        "text": "version of what the reference wave would look like if the film weren't there.",
        "start": 1691.34,
        "duration": 3.48
    },
    {
        "text": "To the observer, this looks like a bright glow coming from everywhere behind the film.",
        "start": 1695.38,
        "duration": 3.94
    },
    {
        "text": "This would be pretty obnoxious, but it can be ",
        "start": 1699.96,
        "duration": 2.084
    },
    {
        "text": "solved by shining the reference beam in at an angle.",
        "start": 1702.044,
        "duration": 2.356
    },
    {
        "text": "You might be curious about the other first order beam, and it's actually very interesting.",
        "start": 1704.9,
        "duration": 3.74
    },
    {
        "text": "If you draw a line along that other first order beam from every point at the film, ",
        "start": 1709.1,
        "duration": 4.928
    },
    {
        "text": "all of those lines converge at a single point on the opposite side of the film.",
        "start": 1714.028,
        "duration": 4.692
    },
    {
        "text": "This is our first peek at a funny little artifact ",
        "start": 1719.58,
        "duration": 2.795
    },
    {
        "text": "of holography known as the conjugate image.",
        "start": 1722.375,
        "duration": 2.405
    },
    {
        "text": "Much earlier I said that the way you want to think about a hologram is that you're ",
        "start": 1725.36,
        "duration": 4.336
    },
    {
        "text": "trying to record and reconstruct the state of the light field around a scene.",
        "start": 1729.696,
        "duration": 4.024
    },
    {
        "text": "The truth is that a hologram doesn't exactly do this.",
        "start": 1734.22,
        "duration": 2.94
    },
    {
        "text": "What it actually recreates can be thought of as a sum of three different light waves.",
        "start": 1737.54,
        "duration": 4.0
    },
    {
        "text": "One of them is a scaled copy of the reference wave, ",
        "start": 1741.98,
        "duration": 2.776
    },
    {
        "text": "which for our simple point example corresponds to the zeroth order beam.",
        "start": 1744.756,
        "duration": 3.844
    },
    {
        "text": "Another corresponds to a copy of the wave emanating from the object.",
        "start": 1748.96,
        "duration": 3.74
    },
    {
        "text": "This is exactly the thing we want to reconstruct, ",
        "start": 1753.1,
        "duration": 2.533
    },
    {
        "text": "and in our simple example it corresponds to one of these first order beams, ",
        "start": 1755.633,
        "duration": 3.851
    },
    {
        "text": "but there's also a third wave in there.",
        "start": 1759.484,
        "duration": 1.976
    },
    {
        "text": "In this simple example of a hologram of a single point, ",
        "start": 1761.58,
        "duration": 3.011
    },
    {
        "text": "that third component looks like the reference beam being ",
        "start": 1764.591,
        "duration": 3.065
    },
    {
        "text": "concentrated in to a single reflection of that point through the film.",
        "start": 1767.656,
        "duration": 3.764
    },
    {
        "text": "More generally though, this third component looks like the reference beam being ",
        "start": 1771.7,
        "duration": 4.123
    },
    {
        "text": "refocused onto a reflected version of your full object on the opposite side of the film.",
        "start": 1775.823,
        "duration": 4.537
    },
    {
        "text": "In the hologram that we recorded with Craig and Sally, ",
        "start": 1781.06,
        "duration": 2.697
    },
    {
        "text": "you can actually see this by putting a piece of paper behind the glass, ",
        "start": 1783.757,
        "duration": 3.531
    },
    {
        "text": "where at the appropriate distance away, you see the light focused onto the shape of, ",
        "start": 1787.288,
        "duration": 4.169
    },
    {
        "text": "for example, the pie creature, which was part of the scene we recorded.",
        "start": 1791.457,
        "duration": 3.483
    },
    {
        "text": "This is known as the conjugate image.",
        "start": 1795.56,
        "duration": 1.9
    },
    {
        "text": "In the earliest days of holography, Dennis Gabor had a lot of ",
        "start": 1797.9,
        "duration": 2.983
    },
    {
        "text": "trouble seeing the holograms that he wanted to, ",
        "start": 1800.883,
        "duration": 2.311
    },
    {
        "text": "because this conjugate image kept getting in the way, muddying up the waters.",
        "start": 1803.194,
        "duration": 3.706
    },
    {
        "text": "However, again this is something where if you use a reference beam ",
        "start": 1807.3,
        "duration": 3.595
    },
    {
        "text": "that shines on the film at an angle, you can get a clean separation ",
        "start": 1810.895,
        "duration": 3.649
    },
    {
        "text": "of the reconstructed object wave from this conjugate wave artifact.",
        "start": 1814.544,
        "duration": 3.596
    },
    {
        "text": "The astute among you might ask about the higher order beams from a diffraction grating.",
        "start": 1820.22,
        "duration": 3.92
    },
    {
        "text": "After all, we saw how the equation doesn't just imply three beams for large enough ",
        "start": 1824.8,
        "duration": 4.392
    },
    {
        "text": "values of d, you can have many more angles that satisfy the diffraction equation.",
        "start": 1829.192,
        "duration": 4.288
    },
    {
        "text": "This is something I actually didn't know until learning about holography, ",
        "start": 1834.38,
        "duration": 4.011
    },
    {
        "text": "but if instead of a binary grating, where light either completely passes through or gets ",
        "start": 1838.391,
        "duration": 4.825
    },
    {
        "text": "completely blocked, you instead have a material that only partially allows light through ",
        "start": 1843.216,
        "duration": 4.825
    },
    {
        "text": "with an opacity that follows a sine wave pattern, ",
        "start": 1848.041,
        "duration": 2.711
    },
    {
        "text": "then you actually don't get higher order beams.",
        "start": 1850.752,
        "duration": 2.548
    },
    {
        "text": "The diffraction pattern only includes zeroth and first order beams.",
        "start": 1853.68,
        "duration": 3.6
    },
    {
        "text": "The most elegant way to show why, in my opinion, ",
        "start": 1857.66,
        "duration": 2.548
    },
    {
        "text": "comes from the more formal explanation of holograms that I want to show you in a few ",
        "start": 1860.208,
        "duration": 4.422
    },
    {
        "text": "minutes, but for right now just know that you're safe to only think about three beams ",
        "start": 1864.63,
        "duration": 4.473
    },
    {
        "text": "emanating from each point of the film.",
        "start": 1869.103,
        "duration": 1.977
    },
    {
        "text": "So, stepping back, you, the problem solver puzzling over holography, ",
        "start": 1872.24,
        "duration": 3.932
    },
    {
        "text": "have at least this one example to hold onto.",
        "start": 1876.172,
        "duration": 2.508
    },
    {
        "text": "A hologram of a single point gives a zone plate, ",
        "start": 1879.06,
        "duration": 2.894
    },
    {
        "text": "and the diffraction effect of shining the reference through the zone plate includes, ",
        "start": 1881.954,
        "duration": 5.022
    },
    {
        "text": "among other things, a recreation of the wave from that point.",
        "start": 1886.976,
        "duration": 3.604
    },
    {
        "text": "A natural place your mind might go from here is to wonder about two such points in space.",
        "start": 1891.8,
        "duration": 4.36
    },
    {
        "text": "Right here is a simulation for what the resulting exposure pattern would look like.",
        "start": 1897.1,
        "duration": 3.78
    },
    {
        "text": "It's based on adding the two radial waves from those points together with a reference ",
        "start": 1900.98,
        "duration": 4.73
    },
    {
        "text": "wave, and you can clearly tell that it's related to the zone plate associated with each ",
        "start": 1905.71,
        "duration": 4.84
    },
    {
        "text": "one, effectively encoding two distinct 3D positions, ",
        "start": 1910.55,
        "duration": 2.915
    },
    {
        "text": "but it is more complicated than simply adding the two individual patterns, ",
        "start": 1913.465,
        "duration": 4.125
    },
    {
        "text": "in the same way that the double slit interference is more complicated than simply adding ",
        "start": 1917.59,
        "duration": 4.895
    },
    {
        "text": "the brightness from each individual slit.",
        "start": 1922.485,
        "duration": 2.255
    },
    {
        "text": "The result depends on how the waves and their phases interfere.",
        "start": 1925.16,
        "duration": 4.02
    },
    {
        "text": "Even still, you can see how this might lead you to think about building up a scene ",
        "start": 1930.14,
        "duration": 4.551
    },
    {
        "text": "as a combination of multiple points, and hypothesizing that the resulting exposure ",
        "start": 1934.691,
        "duration": 4.552
    },
    {
        "text": "pattern can be thought of as some kind of combination of the zone plates for each one.",
        "start": 1939.243,
        "duration": 4.717
    },
    {
        "text": "The simulation I'm showing you has only 30 points, ",
        "start": 1945.88,
        "duration": 2.614
    },
    {
        "text": "and already the result effectively looks like random noise.",
        "start": 1948.494,
        "duration": 3.026
    },
    {
        "text": "But nevertheless, I think you would agree that a reasonable hypothesis would ",
        "start": 1952.56,
        "duration": 4.003
    },
    {
        "text": "be that the diffraction effect of shining a reference beam through this ",
        "start": 1956.563,
        "duration": 3.743
    },
    {
        "text": "pattern might be the sum of what you would get from the zone plates associated ",
        "start": 1960.306,
        "duration": 4.107
    },
    {
        "text": "with each individual point, and you know that looking through from the other ",
        "start": 1964.413,
        "duration": 4.003
    },
    {
        "text": "side of this film, it would give the illusion of those 30 points being there.",
        "start": 1968.416,
        "duration": 4.004
    },
    {
        "text": "If that were true, you could think of a more complicated object or more ",
        "start": 1973.5,
        "duration": 4.069
    },
    {
        "text": "complicated scene as a continuous cloud of many little points, ",
        "start": 1977.569,
        "duration": 3.561
    },
    {
        "text": "and the resulting pattern would not only encode the 3D position and orientation ",
        "start": 1981.13,
        "duration": 4.522
    },
    {
        "text": "of that object, but it would also enable the simple reconstruction that we're looking for.",
        "start": 1985.652,
        "duration": 5.088
    },
    {
        "text": "As stated so far, this is all sketchy and non-rigorous, ",
        "start": 1992.62,
        "duration": 3.059
    },
    {
        "text": "but it does actually lead you to some very real intuition about how holography ",
        "start": 1995.679,
        "duration": 4.317
    },
    {
        "text": "works in practice.",
        "start": 1999.996,
        "duration": 0.984
    },
    {
        "text": "Think back to the very start, when I asked you to appreciate ",
        "start": 2001.68,
        "duration": 3.063
    },
    {
        "text": "how much information is being stored on this film, ",
        "start": 2004.743,
        "duration": 2.561
    },
    {
        "text": "in that it can recreate a scene from a wide continuum of viewing angles.",
        "start": 2007.304,
        "duration": 3.616
    },
    {
        "text": "Part of the catch is that for this process to work, ",
        "start": 2011.44,
        "duration": 2.762
    },
    {
        "text": "the film has to have extremely high resolution.",
        "start": 2014.202,
        "duration": 2.498
    },
    {
        "text": "For comparison, standard Polaroid Instant Film ",
        "start": 2017.38,
        "duration": 2.942
    },
    {
        "text": "resolves only around 10 lines per millimeter.",
        "start": 2020.322,
        "duration": 2.818
    },
    {
        "text": "Microfilm will get you somewhere a little over 100 lines per millimeter, ",
        "start": 2023.8,
        "duration": 4.296
    },
    {
        "text": "but the film that we used to record this hologram can resolve many thousands of lines ",
        "start": 2028.096,
        "duration": 5.061
    },
    {
        "text": "per millimeter.",
        "start": 2033.157,
        "duration": 0.883
    },
    {
        "text": "And now you know why this is necessary.",
        "start": 2034.5,
        "duration": 2.76
    },
    {
        "text": "The spacing between fringes in a zone plate becomes very very narrow, ",
        "start": 2038.26,
        "duration": 4.216
    },
    {
        "text": "and faithfully recording those variations is necessary to reconstruct the object beam ",
        "start": 2042.476,
        "duration": 5.18
    },
    {
        "text": "at that point.",
        "start": 2047.656,
        "duration": 0.844
    },
    {
        "text": "Without the outer fringes, the effect for a viewer would be that they ",
        "start": 2049.04,
        "duration": 3.376
    },
    {
        "text": "simply don't see the object if they're viewing from a sharp angle.",
        "start": 2052.416,
        "duration": 3.184
    },
    {
        "text": "This is not a complete explanation without justifying how exactly the ",
        "start": 2057.4,
        "duration": 3.648
    },
    {
        "text": "exposure pattern that you get from multiple points would have a diffraction ",
        "start": 2061.048,
        "duration": 3.962
    },
    {
        "text": "effect that equals the sum of what you would get for the individual points.",
        "start": 2065.01,
        "duration": 3.91
    },
    {
        "text": "Even then, there's a deeper issue.",
        "start": 2070.199,
        "duration": 1.421
    },
    {
        "text": "Building up a scene from individual points would ",
        "start": 2072.08,
        "duration": 2.521
    },
    {
        "text": "not do true justice to the power of holography.",
        "start": 2074.601,
        "duration": 2.419
    },
    {
        "text": "The reason we included that glass Klein bottle in our example is to emphasize this power.",
        "start": 2077.38,
        "duration": 4.759
    },
    {
        "text": "That glass does not act as a collection of points, merely reflecting light.",
        "start": 2082.139,
        "duration": 4.56
    },
    {
        "text": "It affects the surrounding optics of the scene, ",
        "start": 2087.159,
        "duration": 2.443
    },
    {
        "text": "like how the light from the objects behind gets bent and distorted as it passes through.",
        "start": 2089.602,
        "duration": 4.478
    },
    {
        "text": "The hologram perfectly recreates this effect in a way ",
        "start": 2094.56,
        "duration": 2.685
    },
    {
        "text": "that could not be explained by adding up individual points.",
        "start": 2097.245,
        "duration": 2.935
    },
    {
        "text": "Anyone who has experience with ray tracing will appreciate the difference here.",
        "start": 2100.7,
        "duration": 3.9
    },
    {
        "text": "Also, the sharp-eyed viewers among you might have noticed ",
        "start": 2105.44,
        "duration": 2.773
    },
    {
        "text": "a couple gaps in the explanation even for a single point.",
        "start": 2108.213,
        "duration": 2.727
    },
    {
        "text": "For example, I mentioned shining in the reference beam at an angle, ",
        "start": 2111.36,
        "duration": 3.403
    },
    {
        "text": "but that would also change the exposure pattern, ",
        "start": 2114.763,
        "duration": 2.453
    },
    {
        "text": "so it's not entirely clear that the logic still works.",
        "start": 2117.216,
        "duration": 2.704
    },
    {
        "text": "Sometimes in math, a complex problem can be solved incrementally by building ",
        "start": 2121.52,
        "duration": 4.168
    },
    {
        "text": "up simple cases, but other times the simple cases act more like training exercises, ",
        "start": 2125.688,
        "duration": 4.548
    },
    {
        "text": "and the best way to tackle a general situation is to set up a new framework ",
        "start": 2130.236,
        "duration": 4.115
    },
    {
        "text": "for thinking about it, such that the general solution simply falls right out.",
        "start": 2134.351,
        "duration": 4.169
    },
    {
        "text": "In the case of studying holography, there is an entirely different and ",
        "start": 2139.3,
        "duration": 3.855
    },
    {
        "text": "more powerful way to explain holograms that subsumes all of these issues.",
        "start": 2143.155,
        "duration": 3.965
    },
    {
        "text": "I'll walk through it at the very end here as a kind of technical ",
        "start": 2147.56,
        "duration": 2.935
    },
    {
        "text": "appendix to the whole video, but I think it would be nice to wrap up ",
        "start": 2150.495,
        "duration": 3.117
    },
    {
        "text": "the main discussion by stepping back and discussing holograms more broadly.",
        "start": 2153.612,
        "duration": 3.388
    },
    {
        "text": "Everything we just described covers a transmission hologram, ",
        "start": 2158.36,
        "duration": 3.301
    },
    {
        "text": "the simplest variety, and these have been possible ever since the late 60s.",
        "start": 2161.661,
        "duration": 4.059
    },
    {
        "text": "More advanced techniques exist where the film can reproduce the scene not using a laser, ",
        "start": 2166.06,
        "duration": 4.399
    },
    {
        "text": "but with ordinary white light reflecting off of it.",
        "start": 2170.459,
        "duration": 2.521
    },
    {
        "text": "And it goes beyond that.",
        "start": 2173.72,
        "duration": 0.96
    },
    {
        "text": "There are techniques where you can make changes in the scene over time ",
        "start": 2174.94,
        "duration": 3.635
    },
    {
        "text": "visible as you view the hologram from different angles, ",
        "start": 2178.575,
        "duration": 2.868
    },
    {
        "text": "or where you can take a 3D computer graphics model and produce a hologram of it.",
        "start": 2181.443,
        "duration": 4.097
    },
    {
        "text": "You and I covered the bicycle, but people went on to cars and planes thereafter.",
        "start": 2186.32,
        "duration": 4.34
    },
    {
        "text": "In our example, we were modeling the film as a two-dimensional surface with no thickness, ",
        "start": 2192.44,
        "duration": 4.341
    },
    {
        "text": "and that's perfectly okay for transmission holograms, ",
        "start": 2196.781,
        "duration": 2.604
    },
    {
        "text": "but it's worth noting that that changes for white light reflection holograms.",
        "start": 2199.385,
        "duration": 3.715
    },
    {
        "text": "Variations in the exposure through the thickness of that film become ",
        "start": 2203.64,
        "duration": 3.563
    },
    {
        "text": "relevant for filtering out the appropriate wavelengths during reconstruction.",
        "start": 2207.203,
        "duration": 3.977
    },
    {
        "text": "The fact that Dennis Gabor won a Nobel Prize should give you some ",
        "start": 2211.94,
        "duration": 3.493
    },
    {
        "text": "hint that the significance here goes beyond its use as an art form.",
        "start": 2215.433,
        "duration": 3.547
    },
    {
        "text": "That clip that I showed earlier where we delicately touch the ",
        "start": 2219.52,
        "duration": 3.116
    },
    {
        "text": "object with a feather is displaying the original scene, ",
        "start": 2222.636,
        "duration": 2.815
    },
    {
        "text": "superimposed with its own hologram that we had just freshly recorded.",
        "start": 2225.451,
        "duration": 3.469
    },
    {
        "text": "The dark stripes that you see on the pie creature arise from the extremely ",
        "start": 2229.52,
        "duration": 3.98
    },
    {
        "text": "tiny shifts in position and how that affects the interference of the light.",
        "start": 2233.5,
        "duration": 3.98
    },
    {
        "text": "And you can actually use that to measure the size of those shifts.",
        "start": 2237.9,
        "duration": 3.36
    },
    {
        "text": "This gives a very small glimpse into the relevance that holograms have to interferometry, ",
        "start": 2241.82,
        "duration": 4.847
    },
    {
        "text": "which is the technique of using wave interference to measure extremely tiny distances.",
        "start": 2246.667,
        "duration": 4.633
    },
    {
        "text": "More broadly, being able to record and reproduce an entire wavefront ",
        "start": 2252.18,
        "duration": 3.611
    },
    {
        "text": "is just a useful tool to have in your belt for a variety of experiments.",
        "start": 2255.791,
        "duration": 3.769
    },
    {
        "text": "For any of you who want a deeper look at the history and development of ",
        "start": 2260.22,
        "duration": 3.442
    },
    {
        "text": "holography and physics, I highly recommend reading Gabor's Nobel Prize lecture.",
        "start": 2263.662,
        "duration": 3.778
    },
    {
        "text": "Throughout the lesson, I've repeatedly referenced the goal of making ",
        "start": 2268.3,
        "duration": 2.979
    },
    {
        "text": "holograms feel like something you could have invented yourself.",
        "start": 2271.279,
        "duration": 2.721
    },
    {
        "text": "But there's an irony here, because in his own reflections, ",
        "start": 2274.6,
        "duration": 3.089
    },
    {
        "text": "Gabor describes this not as a deliberate discovery.",
        "start": 2277.689,
        "duration": 2.671
    },
    {
        "text": "He called it, quote, an exercise in serendipity, ",
        "start": 2280.7,
        "duration": 2.607
    },
    {
        "text": "the art of looking for something and finding something else.",
        "start": 2283.307,
        "duration": 3.193
    },
    {
        "text": "But luck favors a prepared mind, and the more that you engage with imagined rediscovery ",
        "start": 2287.12,
        "duration": 6.765
    },
    {
        "text": "of the inventions that you find around you, the better moment of similar serendipity.",
        "start": 2293.885,
        "duration": 6.535
    },
    {
        "text": "And finally, for the stalwart viewers hungry for the final details, ",
        "start": 2306.0,
        "duration": 3.822
    },
    {
        "text": "here's the more formal description of why holography works.",
        "start": 2309.822,
        "duration": 3.318
    },
    {
        "text": "For the small price of introducing complex numbers into the discussion, ",
        "start": 2313.46,
        "duration": 3.486
    },
    {
        "text": "the result kind of just pops out from a few lines of algebra.",
        "start": 2316.946,
        "duration": 2.954
    },
    {
        "text": "So think about recording a hologram where you have both ",
        "start": 2320.64,
        "duration": 2.86
    },
    {
        "text": "a reference wave and an object wave shining on the film.",
        "start": 2323.5,
        "duration": 2.86
    },
    {
        "text": "We're going to write down the sum of those two waves as R plus O.",
        "start": 2326.84,
        "duration": 3.32
    },
    {
        "text": "The exposure pattern depends on the amplitude ",
        "start": 2330.94,
        "duration": 2.319
    },
    {
        "text": "of this combined wave at each point on the film.",
        "start": 2333.259,
        "duration": 2.421
    },
    {
        "text": "And like I said earlier, more precisely, it's ",
        "start": 2336.08,
        "duration": 2.244
    },
    {
        "text": "proportional to the square of that amplitude.",
        "start": 2338.324,
        "duration": 2.196
    },
    {
        "text": "Each of these symbols, say the object wave O, is meant to represent ",
        "start": 2341.26,
        "duration": 4.524
    },
    {
        "text": "a function that takes in a point in space, as well as a time, ",
        "start": 2345.784,
        "duration": 4.125
    },
    {
        "text": "and returns some real number value describing the strength of the point.",
        "start": 2349.909,
        "duration": 4.791
    },
    {
        "text": "It's an incredibly complicated function, but at a fixed point in space, ",
        "start": 2355.14,
        "duration": 4.015
    },
    {
        "text": "this output value simply oscillates up and down over time, ",
        "start": 2359.155,
        "duration": 3.29
    },
    {
        "text": "which we've been visualizing throughout as oscillations between blue and red.",
        "start": 2362.445,
        "duration": 4.295
    },
    {
        "text": "Very often, the math that you do with waves has a habit of becoming a ",
        "start": 2367.46,
        "duration": 4.052
    },
    {
        "text": "lot more elegant when you treat an oscillating value like this, ",
        "start": 2371.512,
        "duration": 3.705
    },
    {
        "text": "not merely as a real number, but as the real component of a rotating complex number.",
        "start": 2375.217,
        "duration": 4.863
    },
    {
        "text": "This might feel very strange if it's something you haven't seen before, ",
        "start": 2380.76,
        "duration": 3.84
    },
    {
        "text": "but one way to motivate why you might do this is that a complex number very ",
        "start": 2384.6,
        "duration": 4.053
    },
    {
        "text": "elegantly encodes both the phase and the amplitude of the wave at a snapshot in ",
        "start": 2388.653,
        "duration": 4.266
    },
    {
        "text": "space and time.",
        "start": 2392.919,
        "duration": 0.801
    },
    {
        "text": "The wave amplitude is visible as the size of this value, its distance from the origin, ",
        "start": 2394.52,
        "duration": 4.854
    },
    {
        "text": "and the phase is visible as the angle this number makes off the horizontal.",
        "start": 2399.374,
        "duration": 4.186
    },
    {
        "text": "The physical significance when you model things like this is just that the real ",
        "start": 2404.08,
        "duration": 3.877
    },
    {
        "text": "component of that rotating complex value tells you the strength of the wave at that point.",
        "start": 2407.957,
        "duration": 4.363
    },
    {
        "text": "But you might think of adding on an imaginary component like ",
        "start": 2412.78,
        "duration": 3.056
    },
    {
        "text": "this as sort of extra bookkeeping that lets you more readily ",
        "start": 2415.836,
        "duration": 3.057
    },
    {
        "text": "keep track of the phase and amplitude of the wave at that point.",
        "start": 2418.893,
        "duration": 3.207
    },
    {
        "text": "For example, the amplitude of that combined wave, ",
        "start": 2422.48,
        "duration": 2.94
    },
    {
        "text": "the thing we care about to describe the exposure, ",
        "start": 2425.42,
        "duration": 2.94
    },
    {
        "text": "can now be written as the magnitude of this sum, R plus O, ",
        "start": 2428.36,
        "duration": 3.47
    },
    {
        "text": "where now we're thinking of that as a sum between two complex values at every point on ",
        "start": 2431.83,
        "duration": 5.116
    },
    {
        "text": "the plane of the film.",
        "start": 2436.946,
        "duration": 1.294
    },
    {
        "text": "So for example, it places where those two values align, ",
        "start": 2439.1,
        "duration": 2.859
    },
    {
        "text": "that corresponds to constructive interference between the waves, ",
        "start": 2441.959,
        "duration": 3.318
    },
    {
        "text": "and the film is going to be more opaque.",
        "start": 2445.277,
        "duration": 2.043
    },
    {
        "text": "Where they are out of phase, you get a really small result, ",
        "start": 2447.84,
        "duration": 2.875
    },
    {
        "text": "and that corresponds to the film being more transparent.",
        "start": 2450.715,
        "duration": 2.685
    },
    {
        "text": "Now think about reconstruction when you just shine ",
        "start": 2454.3,
        "duration": 2.672
    },
    {
        "text": "the reference wave through this exposure pattern.",
        "start": 2456.972,
        "duration": 2.568
    },
    {
        "text": "Let's write the wave immediately on the other side of the ",
        "start": 2460.42,
        "duration": 3.586
    },
    {
        "text": "film as R times 1 minus the opacity at that point on the film.",
        "start": 2464.006,
        "duration": 3.834
    },
    {
        "text": "So for example, where the film is very transparent, R passes through unchanged, ",
        "start": 2468.48,
        "duration": 4.289
    },
    {
        "text": "but where it's more opaque, R is going to get scaled down.",
        "start": 2472.769,
        "duration": 3.111
    },
    {
        "text": "We can go ahead and substitute in the expression for opacity that we have, ",
        "start": 2476.44,
        "duration": 3.973
    },
    {
        "text": "and then distribute a little, and what I want to do is focus on analyzing this ",
        "start": 2480.413,
        "duration": 4.185
    },
    {
        "text": "component right here, which is going to be part of the wave on this other side of ",
        "start": 2484.598,
        "duration": 4.345
    },
    {
        "text": "the film.",
        "start": 2488.943,
        "duration": 0.477
    },
    {
        "text": "When you expand this expression and interpret its terms, ",
        "start": 2489.78,
        "duration": 2.871
    },
    {
        "text": "the truth of holography stares right back at you.",
        "start": 2492.651,
        "duration": 2.469
    },
    {
        "text": "To do so, what you need to know about complex numbers is one definition and one fact.",
        "start": 2495.7,
        "duration": 4.84
    },
    {
        "text": "The definition is that the complex conjugate of a number, ",
        "start": 2501.1,
        "duration": 3.118
    },
    {
        "text": "which you typically denote with a star, is its reflection over the horizontal axis.",
        "start": 2504.218,
        "duration": 4.462
    },
    {
        "text": "And the fact that you need is that when you multiply a number by its own ",
        "start": 2509.16,
        "duration": 4.125
    },
    {
        "text": "complex conjugate, the result is the square of the magnitude of that number.",
        "start": 2513.285,
        "duration": 4.295
    },
    {
        "text": "So in our expression, that exposure term could also be written as ",
        "start": 2518.14,
        "duration": 4.771
    },
    {
        "text": "R plus O multiplied by its own complex conjugate, R-star plus O-star.",
        "start": 2522.911,
        "duration": 4.989
    },
    {
        "text": "The reason to do this is now you have something you can expand algebraically, ",
        "start": 2528.28,
        "duration": 4.075
    },
    {
        "text": "although admittedly when you do this it might first look like a big pile of symbols ",
        "start": 2532.355,
        "duration": 4.389
    },
    {
        "text": "that is very far removed from physical intuition about reconstructing a three-dimensional ",
        "start": 2536.744,
        "duration": 4.702
    },
    {
        "text": "scene.",
        "start": 2541.446,
        "duration": 0.314
    },
    {
        "text": "But give it just a moment here.",
        "start": 2542.24,
        "duration": 1.32
    },
    {
        "text": "When you organize the terms the right way, the answer sort of pops out.",
        "start": 2543.64,
        "duration": 3.16
    },
    {
        "text": "Whenever you see a value multiplied by its own complex conjugate, ",
        "start": 2547.2,
        "duration": 3.832
    },
    {
        "text": "just think of it as some real number, some scaling factor.",
        "start": 2551.032,
        "duration": 3.368
    },
    {
        "text": "For example, one part in the final expression looks like ",
        "start": 2555.08,
        "duration": 3.319
    },
    {
        "text": "some certain real number all times R, the reference wave.",
        "start": 2558.399,
        "duration": 3.321
    },
    {
        "text": "And what this corresponds to is a scaled copy of that ",
        "start": 2562.24,
        "duration": 2.99
    },
    {
        "text": "reference wave here on the other side of the film.",
        "start": 2565.23,
        "duration": 2.77
    },
    {
        "text": "In our simple point example, that would correspond to the zeroth ",
        "start": 2568.42,
        "duration": 3.616
    },
    {
        "text": "order beam from the diffraction grating off the zone plate.",
        "start": 2572.036,
        "duration": 3.284
    },
    {
        "text": "The key term is this part right here.",
        "start": 2575.32,
        "duration": 2.76
    },
    {
        "text": "It looks like some real number, some scaling factor, multiplied by the object wave itself.",
        "start": 2578.34,
        "duration": 5.54
    },
    {
        "text": "So here you are on the other side of the film during reconstruction, ",
        "start": 2584.56,
        "duration": 4.065
    },
    {
        "text": "and the expression for the state of the light field includes this scaled copy of ",
        "start": 2588.625,
        "duration": 4.772
    },
    {
        "text": "the object wave.",
        "start": 2593.397,
        "duration": 0.943
    },
    {
        "text": "It doesn't matter how complicated O is, the scene that it ",
        "start": 2594.76,
        "duration": 2.938
    },
    {
        "text": "comes from could have whatever complicated optics that you want.",
        "start": 2597.698,
        "duration": 3.242
    },
    {
        "text": "But here on the other side of the film there will always be this scaled copy of o.",
        "start": 2601.5,
        "duration": 4.64
    },
    {
        "text": "In our simple point example, this corresponds to one of those first order beams.",
        "start": 2606.6,
        "duration": 4.06
    },
    {
        "text": "And finally, you have this funny little term at the end ",
        "start": 2611.9,
        "duration": 2.694
    },
    {
        "text": "that involves the complex conjugate of the object wave.",
        "start": 2614.594,
        "duration": 2.646
    },
    {
        "text": "This corresponds, as you can probably guess, to the conjugate image, ",
        "start": 2617.98,
        "duration": 3.404
    },
    {
        "text": "and maybe now the name makes a little bit more sense.",
        "start": 2621.384,
        "duration": 2.616
    },
    {
        "text": "This is a difficult term to make sense of, and I'm not going to say ",
        "start": 2624.52,
        "duration": 3.728
    },
    {
        "text": "too much more about it, other than to show that for the hologram we made, ",
        "start": 2628.248,
        "duration": 4.058
    },
    {
        "text": "if you flip the film around, you can see this conjugate image as a very bizarre, ",
        "start": 2632.306,
        "duration": 4.442
    },
    {
        "text": "warped, and reflected version of the original scene.",
        "start": 2636.748,
        "duration": 2.852
    },
    {
        "text": "So that is it.",
        "start": 2642.2,
        "duration": 1.4
    },
    {
        "text": "A little piece of complex algebra shows why you have ",
        "start": 2643.84,
        "duration": 2.917
    },
    {
        "text": "a copy of the object wave on the other side of the film.",
        "start": 2646.757,
        "duration": 3.083
    },
    {
        "text": "And importantly, there were no assumptions about how simple that object wave is.",
        "start": 2650.34,
        "duration": 3.66
    },
    {
        "text": "Also, it makes no assumptions about how simple the reference wave is.",
        "start": 2654.3,
        "duration": 3.26
    },
    {
        "text": "You just need to be able to reproduce the same wave that you used during recording, ",
        "start": 2657.66,
        "duration": 4.1
    },
    {
        "text": "or at least something close to it.",
        "start": 2661.76,
        "duration": 1.66
    },
    {
        "text": "Even though this is more powerful, on its own ",
        "start": 2664.36,
        "duration": 2.28
    },
    {
        "text": "I would find this explanation very unsatisfying.",
        "start": 2666.64,
        "duration": 2.38
    },
    {
        "text": "The breakdown of a single point with the zone plate pattern and diffraction gradings, ",
        "start": 2669.36,
        "duration": 3.958
    },
    {
        "text": "for all of its shortcomings, gives a lot more intuition in my opinion.",
        "start": 2673.318,
        "duration": 3.222
    },
    {
        "text": "For instance, the algebra tells you nothing about how the film resolution could matter, ",
        "start": 2677.02,
        "duration": 4.334
    },
    {
        "text": "but the abstract path and all the power that it brings does offer some reassurance ",
        "start": 2681.354,
        "duration": 4.087
    },
    {
        "text": "that the shortcomings in that first explanation are all surmountable.",
        "start": 2685.441,
        "duration": 3.399
    },
    {
        "text": "In his Nobel Prize lecture, Gabor wrote, in holography, nature is on the inventor's side.",
        "start": 2689.54,
        "duration": 5.08
    },
    {
        "text": "You do actually need to say a little bit more to finish the abstract derivation.",
        "start": 2695.5,
        "duration": 3.68
    },
    {
        "text": "Strictly speaking, we've only shown that you have a copy of this ",
        "start": 2699.7,
        "duration": 3.481
    },
    {
        "text": "object wave on the plane immediately after the film, ",
        "start": 2703.181,
        "duration": 2.84
    },
    {
        "text": "but what you want to show is that it exists in all of 3D space, beyond that film.",
        "start": 2706.021,
        "duration": 4.339
    },
    {
        "text": "Rigorously justifying this would go beyond the scope of an already long lesson, ",
        "start": 2710.96,
        "duration": 4.226
    },
    {
        "text": "but it's not too hard a fact to believe.",
        "start": 2715.186,
        "duration": 2.114
    },
    {
        "text": "What we're basically saying is that if you have some function that you know ",
        "start": 2718.0,
        "duration": 4.35
    },
    {
        "text": "satisfies whatever equations light must obey, namely the object wave O, ",
        "start": 2722.35,
        "duration": 4.121
    },
    {
        "text": "and you have another function describing a steady state wave where you know ",
        "start": 2726.471,
        "duration": 4.35
    },
    {
        "text": "that O shows up as a component along a 2D boundary like this, ",
        "start": 2730.821,
        "duration": 3.549
    },
    {
        "text": "then in the free space beyond that boundary, the wave must also include as a ",
        "start": 2734.37,
        "duration": 4.407
    },
    {
        "text": "component O in its entirety.",
        "start": 2738.777,
        "duration": 1.603
    },
    {
        "text": "This actually has a nice connection to the key mystery from the very beginning of ",
        "start": 2740.84,
        "duration": 4.747
    },
    {
        "text": "the lesson of how a three-dimensional scene could possibly be stored on 2D film.",
        "start": 2745.587,
        "duration": 4.633
    },
    {
        "text": "Part of what's required for this to be possible is that light ",
        "start": 2750.62,
        "duration": 3.943
    },
    {
        "text": "obeys laws regular enough that the state of a light wave in 3D ",
        "start": 2754.563,
        "duration": 4.006
    },
    {
        "text": "space is sufficiently constrained by its value on a 2D boundary.",
        "start": 2758.569,
        "duration": 4.071
    }
]