[
    {
        "text": "This summer, James Schloss and I ran a contest that's meant to encourage more people ",
        "start": 0.0,
        "duration": 4.002
    },
    {
        "text": "to make online math explainers, and here I want to share with you some of my favorites.",
        "start": 4.002,
        "duration": 4.098
    },
    {
        "text": "I wrote up a much fuller blog post about the event and the process for selecting winners, ",
        "start": 8.82,
        "duration": 4.108
    },
    {
        "text": "but let's open here with some of the key points.",
        "start": 12.928,
        "duration": 2.192
    },
    {
        "text": "First of all, it was extremely open-ended.",
        "start": 15.68,
        "duration": 2.32
    },
    {
        "text": "It's meant for math explainers of any kind, any medium, ",
        "start": 18.38,
        "duration": 2.859
    },
    {
        "text": "any target audience, any topic, pretty much just as long as it's about math.",
        "start": 21.239,
        "duration": 3.881
    },
    {
        "text": "The promise was to select around 4-5 to be winners, ",
        "start": 25.68,
        "duration": 2.794
    },
    {
        "text": "which I would then feature in a video, here we are now, ",
        "start": 28.474,
        "duration": 3.009
    },
    {
        "text": "and after I made the initial announcement, Brilliant came in and kindly ",
        "start": 31.483,
        "duration": 3.868
    },
    {
        "text": "offered cash prizes to those winners.",
        "start": 35.351,
        "duration": 1.989
    },
    {
        "text": "Before anything, let me just emphasize this notion of a ",
        "start": 38.0,
        "duration": 2.448
    },
    {
        "text": "winner should really be taken with a heavy grain of salt.",
        "start": 40.448,
        "duration": 2.492
    },
    {
        "text": "The spirit of the event, and hopefully this is obvious, ",
        "start": 43.52,
        "duration": 2.866
    },
    {
        "text": "is to get more people sharing their knowledge, ",
        "start": 46.386,
        "duration": 2.406
    },
    {
        "text": "and preferably to have them do so in a way that's as engaging and ",
        "start": 48.792,
        "duration": 3.378
    },
    {
        "text": "empathetic and novel as possible.",
        "start": 52.17,
        "duration": 1.69
    },
    {
        "text": "The way I see it, there's some benefits to framing it as a contest, ",
        "start": 54.34,
        "duration": 3.057
    },
    {
        "text": "like we have a clear deadline, and that can be a great cure for perfectionism ",
        "start": 57.397,
        "duration": 3.508
    },
    {
        "text": "and stagnation.",
        "start": 60.905,
        "duration": 0.675
    },
    {
        "text": "Also, having some small stakes involved hopefully means that the lessons are ",
        "start": 62.2,
        "duration": 3.535
    },
    {
        "text": "put together with a little bit more care, and with a little bit more attention ",
        "start": 65.735,
        "duration": 3.627
    },
    {
        "text": "to the kind of principles that I wanted to emphasize with the whole event.",
        "start": 69.362,
        "duration": 3.398
    },
    {
        "text": "The downside, which is not to be taken lightly, ",
        "start": 73.5,
        "duration": 2.673
    },
    {
        "text": "is that it gives the false impression that success looks like winning, but it does not.",
        "start": 76.173,
        "duration": 4.847
    },
    {
        "text": "Success means having more material out there that ",
        "start": 81.56,
        "duration": 2.264
    },
    {
        "text": "explains math and inspires people to engage with it.",
        "start": 83.824,
        "duration": 2.356
    },
    {
        "text": "Ten years from now, no one is going to remember my arbitrary selections, ",
        "start": 86.6,
        "duration": 3.303
    },
    {
        "text": "but every one of the pieces made will still exist and will still potentially help someone ",
        "start": 89.903,
        "duration": 4.072
    },
    {
        "text": "trying to learn.",
        "start": 93.975,
        "duration": 0.725
    },
    {
        "text": "We received over 1200 submissions, and as a first pass for the ",
        "start": 95.28,
        "duration": 3.194
    },
    {
        "text": "judgment we had a peer review process to help filter that down to ",
        "start": 98.474,
        "duration": 3.347
    },
    {
        "text": "a little over 100 that James and I could give a really close look at.",
        "start": 101.821,
        "duration": 3.499
    },
    {
        "text": "We also had around half a dozen guest judges, people in the space of math exposition, ",
        "start": 105.68,
        "duration": 4.083
    },
    {
        "text": "to help us narrow down those final judgments.",
        "start": 109.763,
        "duration": 2.137
    },
    {
        "text": "Many, many thanks to those guests for being willing to volunteer some of their time, ",
        "start": 112.5,
        "duration": 3.946
    },
    {
        "text": "and generally helping to ensure that any of my subjective quirks ",
        "start": 116.446,
        "duration": 3.018
    },
    {
        "text": "weren't leaking too much into the final decision.",
        "start": 119.464,
        "duration": 2.276
    },
    {
        "text": "Also, a million thanks to James.",
        "start": 122.62,
        "duration": 1.92
    },
    {
        "text": "He really was the core organizer behind everything here, ",
        "start": 124.9,
        "duration": 2.537
    },
    {
        "text": "and if you participated in the event and found it helpful, ",
        "start": 127.437,
        "duration": 2.626
    },
    {
        "text": "he is absolutely the one you should be thanking.",
        "start": 130.063,
        "duration": 2.137
    },
    {
        "text": "As I said, there's a blog post with more details for any of you who are curious, ",
        "start": 133.12,
        "duration": 3.73
    },
    {
        "text": "but right now, without further ado, let me tell you about some outstanding ",
        "start": 136.85,
        "duration": 3.455
    },
    {
        "text": "math explainers made this summer that I really think you're going to enjoy.",
        "start": 140.305,
        "duration": 3.455
    },
    {
        "text": "This entry, from a channel called Paralogical, ",
        "start": 144.7,
        "duration": 2.737
    },
    {
        "text": "opens by asking why the light reflected at the bottom of a mug seems to form ",
        "start": 147.437,
        "duration": 4.484
    },
    {
        "text": "this characteristic cardioid shape.",
        "start": 151.921,
        "duration": 2.039
    },
    {
        "text": "The core mathematical idea that this video teaches is that of envelopes, ",
        "start": 154.9,
        "duration": 3.775
    },
    {
        "text": "which in short is a way to describe one curve using a family of other curves, ",
        "start": 158.675,
        "duration": 4.034
    },
    {
        "text": "and what really makes the video special is not just how clearly he explains that subject, ",
        "start": 162.709,
        "duration": 4.655
    },
    {
        "text": "but how tangible and well-chosen the examples are, ",
        "start": 167.364,
        "duration": 2.638
    },
    {
        "text": "all delivered with a tone that's just plain friendly and enjoyable to listen to.",
        "start": 170.002,
        "duration": 4.138
    },
    {
        "text": "The key formula he builds up to is really well motivated, ",
        "start": 174.6,
        "duration": 2.687
    },
    {
        "text": "and one of those things that would not be obvious if you just saw it out of context, ",
        "start": 177.287,
        "duration": 3.939
    },
    {
        "text": "and he gives the tools for any curious viewer to pause and work through for ",
        "start": 181.226,
        "duration": 3.522
    },
    {
        "text": "themselves a more detailed understanding, while still leaving room for someone ",
        "start": 184.748,
        "duration": 3.661
    },
    {
        "text": "watching to get the general idea and the core points without necessarily being ",
        "start": 188.409,
        "duration": 3.66
    },
    {
        "text": "bogged down into that algebra.",
        "start": 192.069,
        "duration": 1.391
    },
    {
        "text": "On the topic of fun ways that light gets redirected, ",
        "start": 194.4,
        "duration": 2.994
    },
    {
        "text": "another one of my picks is an absolutely mind-blowing piece of engineering wizardry.",
        "start": 197.394,
        "duration": 4.746
    },
    {
        "text": "This one is a blog post written by Matt Ferraro, ",
        "start": 202.58,
        "duration": 2.781
    },
    {
        "text": "where he explains how he made this acrylic square.",
        "start": 205.361,
        "duration": 2.839
    },
    {
        "text": "It might look innocent at first, like nothing more than a transparent square, ",
        "start": 208.76,
        "duration": 4.003
    },
    {
        "text": "maybe suspiciously wavy, but when you look at its shadow you can see that it's been ",
        "start": 212.763,
        "duration": 4.311
    },
    {
        "text": "carefully crafted to redirect light in such a way as to form a highly deliberate image.",
        "start": 217.074,
        "duration": 4.466
    },
    {
        "text": "The post walks through all of the math and the algorithms involved in pulling this off, ",
        "start": 222.48,
        "duration": 4.094
    },
    {
        "text": "including certain false starts in the discovery process, which I love, ",
        "start": 226.574,
        "duration": 3.303
    },
    {
        "text": "and the author skillfully draws the reader's attention to which details are ",
        "start": 229.877,
        "duration": 3.535
    },
    {
        "text": "important and deserve more of your focus, and which ones are more side notes and minutiae.",
        "start": 233.412,
        "duration": 4.188
    },
    {
        "text": "I found myself a little surprised about what parts of the process ",
        "start": 238.42,
        "duration": 2.931
    },
    {
        "text": "turned out to be hard and which ones were easy, ",
        "start": 241.351,
        "duration": 2.132
    },
    {
        "text": "and by the end the whole task felt a lot less mysterious while still ",
        "start": 243.483,
        "duration": 3.065
    },
    {
        "text": "commanding no shortage of respect for the fact that someone was actually ",
        "start": 246.548,
        "duration": 3.243
    },
    {
        "text": "able to pull it off.",
        "start": 249.791,
        "duration": 0.889
    },
    {
        "text": "The next pick that I have on my list here, I'll feel a little torn about, ",
        "start": 252.08,
        "duration": 3.964
    },
    {
        "text": "I wouldn't be surprised if many of you have already seen this video, ",
        "start": 256.044,
        "duration": 3.696
    },
    {
        "text": "it's called The Beauty of Bézier Curves by Freya Homare.",
        "start": 259.74,
        "duration": 3.0
    },
    {
        "text": "Given the spirit of the contest, which is to encourage people to share their knowledge ",
        "start": 263.96,
        "duration": 4.257
    },
    {
        "text": "without necessarily getting intimidated by a need for high production quality, you know, ",
        "start": 268.217,
        "duration": 4.356
    },
    {
        "text": "focus on the quality of the lesson more so than the medium used to express it, ",
        "start": 272.573,
        "duration": 3.866
    },
    {
        "text": "this video was so beautifully produced I almost felt like choosing it risked sending the ",
        "start": 276.439,
        "duration": 4.355
    },
    {
        "text": "wrong message.",
        "start": 280.794,
        "duration": 0.686
    },
    {
        "text": "Also, part of the goal here is to shine a light on comparatively unknown creators, ",
        "start": 282.2,
        "duration": 4.419
    },
    {
        "text": "and by the time I was watching this one it had around 400,000 views.",
        "start": 286.619,
        "duration": 3.621
    },
    {
        "text": "But the thing is, Freya's video really is a fantastic piece of exposition, ",
        "start": 291.02,
        "duration": 3.864
    },
    {
        "text": "and it would be a little bit silly of me to fault it for also being beautiful ",
        "start": 294.884,
        "duration": 4.02
    },
    {
        "text": "and evidently also being appreciated by many people in both respects.",
        "start": 298.904,
        "duration": 3.556
    },
    {
        "text": "I do want to be clear, the reason that I'm choosing it is not because of the smooth ",
        "start": 303.28,
        "duration": 4.276
    },
    {
        "text": "graphics, it's that here we have someone who uses a certain mathematical tool regularly ",
        "start": 307.556,
        "duration": 4.479
    },
    {
        "text": "in her work, and she has the ability to clearly motivate why you should care too, ",
        "start": 312.035,
        "duration": 4.175
    },
    {
        "text": "and to go into the details of how it works, the many different facets of how she uses it, ",
        "start": 316.21,
        "duration": 4.581
    },
    {
        "text": "how she thinks about it, and what makes it visually great is not so much the smoothness ",
        "start": 320.791,
        "duration": 4.48
    },
    {
        "text": "of the graphics or the aesthetic appeal, it's that they're clean and to the point, ",
        "start": 325.271,
        "duration": 4.225
    },
    {
        "text": "serving to aid what's the core value in the whole piece, ",
        "start": 329.496,
        "duration": 2.902
    },
    {
        "text": "a series of well-chosen intuitions and applications of a topic in math that deserves ",
        "start": 332.398,
        "duration": 4.327
    },
    {
        "text": "to be known by more people.",
        "start": 336.725,
        "duration": 1.375
    },
    {
        "text": "After that one I really did think that with my other picks I could ",
        "start": 339.42,
        "duration": 3.205
    },
    {
        "text": "help direct the audience of this channel to some excellent lessons ",
        "start": 342.625,
        "duration": 3.205
    },
    {
        "text": "that you might not have seen yet, like with the next one I chose.",
        "start": 345.83,
        "duration": 3.11
    },
    {
        "text": "When I saw it, it had a couple hundred views and I really ",
        "start": 349.26,
        "duration": 2.762
    },
    {
        "text": "loved it and I was excited to share it with you all.",
        "start": 352.022,
        "duration": 2.478
    },
    {
        "text": "But then it looks like the internet kind of beat me to it, ",
        "start": 354.66,
        "duration": 2.896
    },
    {
        "text": "this thing is quickly going on a million views, well deserved by the way.",
        "start": 357.556,
        "duration": 3.584
    },
    {
        "text": "If you haven't seen it, it really is delightful.",
        "start": 361.66,
        "duration": 2.1
    },
    {
        "text": "It's not a traditional math lesson in the sense of explaining some topic that ",
        "start": 364.18,
        "duration": 3.611
    },
    {
        "text": "you might need to learn for a course, or even one that exists in a clear field ",
        "start": 367.791,
        "duration": 3.658
    },
    {
        "text": "for that matter, but it absolutely captures the spirit of mathematical discovery.",
        "start": 371.449,
        "duration": 3.751
    },
    {
        "text": "The question posed in the video seems a little bit silly at first, ",
        "start": 375.88,
        "duration": 3.047
    },
    {
        "text": "which is what's the most complicated passcode for those sorts ",
        "start": 378.927,
        "duration": 2.82
    },
    {
        "text": "of swipey swipey pattern passcodes that some phones have.",
        "start": 381.747,
        "duration": 2.593
    },
    {
        "text": "The video opens by making that question rigorous, giving it a solid definition, ",
        "start": 384.34,
        "duration": 4.196
    },
    {
        "text": "and then proceeds with a really engaging story of problem solving that involves very ",
        "start": 388.536,
        "duration": 4.459
    },
    {
        "text": "real math lessons along the way, things about number theory, about induction, ",
        "start": 392.995,
        "duration": 4.091
    },
    {
        "text": "about generalizing a result even after you've solved a sub problem, ",
        "start": 397.086,
        "duration": 3.567
    },
    {
        "text": "definitely take a look.",
        "start": 400.653,
        "duration": 1.207
    },
    {
        "text": "The final pick I have on my list here, which again is in no particular order, ",
        "start": 402.66,
        "duration": 4.178
    },
    {
        "text": "is one that multiple different guest judges singled out as being especially good, ",
        "start": 406.838,
        "duration": 4.394
    },
    {
        "text": "and also easily underappreciated.",
        "start": 411.232,
        "duration": 1.768
    },
    {
        "text": "The video describes a really clever and memorable proof ",
        "start": 413.64,
        "duration": 2.68
    },
    {
        "text": "of this cute fact from geometry known as Pick's theorem.",
        "start": 416.32,
        "duration": 2.68
    },
    {
        "text": "And more than that, the author has some really nice thoughts about the role ",
        "start": 419.74,
        "duration": 3.341
    },
    {
        "text": "of different kinds of proofs in math, thoughts which more students, ",
        "start": 423.081,
        "duration": 2.99
    },
    {
        "text": "and for that matter more teachers, would really benefit from hearing and thinking about.",
        "start": 426.071,
        "duration": 3.869
    },
    {
        "text": "It's no fancier than it needs to be, but the core idea is just so good that, ",
        "start": 430.46,
        "duration": 3.929
    },
    {
        "text": "to me at least, the video has a lot more staying power than many of the professionally ",
        "start": 434.389,
        "duration": 4.439
    },
    {
        "text": "produced educational videos that I've seen from established channels out there.",
        "start": 438.828,
        "duration": 4.032
    },
    {
        "text": "So there you go, those are my five picks for this summer of Math Exposition.",
        "start": 444.3,
        "duration": 3.66
    },
    {
        "text": "But the thing is, if you had seen the submissions that I have seen, ",
        "start": 448.68,
        "duration": 3.3
    },
    {
        "text": "you would agree that choosing just five winners is ridiculous, to the point of absurdity.",
        "start": 451.98,
        "duration": 4.32
    },
    {
        "text": "Again, you know, the point is not the winners, ",
        "start": 457.1,
        "duration": 1.931
    },
    {
        "text": "the event is about encouraging people to follow through with projects, ",
        "start": 459.031,
        "duration": 2.917
    },
    {
        "text": "things about Math Exposition they might have been thinking about doing, all of that.",
        "start": 461.948,
        "duration": 3.452
    },
    {
        "text": "But just reiterating that point feels a little bit hollow, because there are at least, ",
        "start": 465.8,
        "duration": 4.543
    },
    {
        "text": "I don't know, twenty in here where I feel like it is a genuine crime not to have chosen ",
        "start": 470.343,
        "duration": 4.595
    },
    {
        "text": "them.",
        "start": 474.938,
        "duration": 0.262
    },
    {
        "text": "And, well you know, it's my contest, my rules, so if you'll indulge me, ",
        "start": 475.82,
        "duration": 3.36
    },
    {
        "text": "let me quickly tell you about some others that I just loved.",
        "start": 479.18,
        "duration": 2.8
    },
    {
        "text": "One that I think viewers of this channel would especially enjoy is almost an hour.",
        "start": 482.56,
        "duration": 4.16
    },
    {
        "text": "It's about Durock's belt trick by Noah Miller.",
        "start": 487.22,
        "duration": 2.18
    },
    {
        "text": "In a recent event that I was doing with Stephen Strogatz for the MoMath Museum, ",
        "start": 490.1,
        "duration": 3.7
    },
    {
        "text": "we had a call that was ostensibly meant to prepare for that event, ",
        "start": 493.8,
        "duration": 3.1
    },
    {
        "text": "but instead we spent much of it just both gushing over how much we liked this one ",
        "start": 496.9,
        "duration": 3.793
    },
    {
        "text": "particular video.",
        "start": 500.693,
        "duration": 0.787
    },
    {
        "text": "Any of you who have flirted with this topic will probably know how tricky ",
        "start": 501.92,
        "duration": 3.946
    },
    {
        "text": "it can be to understand the link between points on a 4D sphere and rotations in 3D space, ",
        "start": 505.866,
        "duration": 4.8
    },
    {
        "text": "and why any of that has to do with quantum mechanics, ",
        "start": 510.666,
        "duration": 2.88
    },
    {
        "text": "but this animated hour-long lecture does a really good job laying out the full story.",
        "start": 513.546,
        "duration": 4.534
    },
    {
        "text": "Another one which is long but good is about the unsolvability ",
        "start": 519.0,
        "duration": 3.894
    },
    {
        "text": "of the quintic by Carl Turner. For me it was a bit b",
        "start": 522.894,
        "duration": 3.266
    },
    {
        "text": "I'm not seeing it because when I did, I was actively working ",
        "start": 526.16,
        "duration": 3.017
    },
    {
        "text": "on a video that was not just about the same theorem, ",
        "start": 529.177,
        "duration": 2.621
    },
    {
        "text": "but about the same comparatively esoteric proof that it describes there.",
        "start": 531.798,
        "duration": 3.562
    },
    {
        "text": "I thought the video did such a wonderful job, I just kind of set aside the project.",
        "start": 535.68,
        "duration": 3.44
    },
    {
        "text": "I'll still probably cover it at some point, but now I'm motivated to do it in ",
        "start": 539.52,
        "duration": 3.768
    },
    {
        "text": "a different way, but in the meantime, any of you curious about why quintic ",
        "start": 543.288,
        "duration": 3.623
    },
    {
        "text": "polynomials are in a certain sense unsolvable will absolutely love this video.",
        "start": 546.911,
        "duration": 3.769
    },
    {
        "text": "So many entries here were just really solid explainers, plain and simple.",
        "start": 551.46,
        "duration": 3.44
    },
    {
        "text": "This includes the best overview I've seen of the two-envelope problem, ",
        "start": 555.38,
        "duration": 3.688
    },
    {
        "text": "a great explanation for how fonts get turned into pixels, ",
        "start": 559.068,
        "duration": 3.013
    },
    {
        "text": "a wonderful article on spinners, a comic style blog post about E, ",
        "start": 562.081,
        "duration": 3.429
    },
    {
        "text": "a video about an ancient Babylonian algorithm for multiplying numbers, ",
        "start": 565.51,
        "duration": 3.689
    },
    {
        "text": "which has unexpected usefulness for certain programming tasks.",
        "start": 569.199,
        "duration": 3.221
    },
    {
        "text": "There were a number of videos in Chinese on the site Bilibili, ",
        "start": 573.4,
        "duration": 2.76
    },
    {
        "text": "including one I really liked about a fundamental theorem for symmetric polynomials, ",
        "start": 576.16,
        "duration": 3.681
    },
    {
        "text": "perfectly understandable with the English subtitles.",
        "start": 579.841,
        "duration": 2.279
    },
    {
        "text": "And one absolutely fantastic video in here was about lemur factor stencils, ",
        "start": 583.58,
        "duration": 3.834
    },
    {
        "text": "which I had never heard of, and I learned a ton watching this and found it absolutely ",
        "start": 587.414,
        "duration": 4.34
    },
    {
        "text": "fascinating.",
        "start": 591.754,
        "duration": 0.606
    },
    {
        "text": "Many of the entries I saw had excellent aha moments, like this one here, ",
        "start": 593.58,
        "duration": 4.07
    },
    {
        "text": "with a mildly clickbaity title about a graph that will blow your mind, ",
        "start": 597.65,
        "duration": 3.959
    },
    {
        "text": "but the thing is, at least in my experience, that title is 100% accurate.",
        "start": 601.609,
        "duration": 4.071
    },
    {
        "text": "There's a video explaining why pi shows up in the Buffon needle ",
        "start": 606.3,
        "duration": 2.872
    },
    {
        "text": "problem with a really elegant shift in perspective, ",
        "start": 609.172,
        "duration": 2.335
    },
    {
        "text": "and what I especially appreciate is that the author also has an ",
        "start": 611.507,
        "duration": 2.873
    },
    {
        "text": "appendix video going through some of the more technical details not ",
        "start": 614.38,
        "duration": 3.052
    },
    {
        "text": "covered in the main video.",
        "start": 617.432,
        "duration": 1.168
    },
    {
        "text": "A few entries were highly interesting if for no other reason just from a technological ",
        "start": 619.14,
        "duration": 4.449
    },
    {
        "text": "standpoint alone, including a very well-executed interactive video by Rob Schlubb, ",
        "start": 623.589,
        "duration": 4.245
    },
    {
        "text": "which let me tell you is not easy to pull off, ",
        "start": 627.834,
        "duration": 2.404
    },
    {
        "text": "as well as a great interactive article introducing complex numbers and the fundamental ",
        "start": 630.238,
        "duration": 4.449
    },
    {
        "text": "theorem of algebra on the site Trina.",
        "start": 634.687,
        "duration": 1.893
    },
    {
        "text": "And then some of the entries, setting aside all the explanatory value, ",
        "start": 637.04,
        "duration": 3.352
    },
    {
        "text": "were just plain beautiful.",
        "start": 640.392,
        "duration": 1.228
    },
    {
        "text": "Like if I had a category here for greatest style, ",
        "start": 642.12,
        "duration": 2.492
    },
    {
        "text": "I think my pick would be this one about recreating curves from a children's toy.",
        "start": 644.612,
        "duration": 3.988
    },
    {
        "text": "But setting aside style or the core point of all of this, ",
        "start": 650.48,
        "duration": 2.674
    },
    {
        "text": "which is the explanatory quality, there's one feature of online explainers ",
        "start": 653.154,
        "duration": 3.458
    },
    {
        "text": "that can easily be underappreciated, which is the role of narrative and storylines.",
        "start": 656.612,
        "duration": 3.828
    },
    {
        "text": "And a couple entries I think did a great job exemplifying that component.",
        "start": 661.04,
        "duration": 3.22
    },
    {
        "text": "This includes not one but two entries on this game called Hackenbush, ",
        "start": 664.8,
        "duration": 3.82
    },
    {
        "text": "a story about how a lights-out puzzle can lead you to Gaussian elimination, ",
        "start": 668.62,
        "duration": 4.148
    },
    {
        "text": "a nice exploration of the most efficient way to choose a random point in a ",
        "start": 672.768,
        "duration": 4.094
    },
    {
        "text": "circle uniformly, a great puzzle about tiles, which carries with it explanations ",
        "start": 676.862,
        "duration": 4.421
    },
    {
        "text": "of core facts from Fibonacci numbers, and one really nicely done video about ",
        "start": 681.283,
        "duration": 4.203
    },
    {
        "text": "why the Sierpinski triangle shows up in three seemingly completely unrelated contexts.",
        "start": 685.486,
        "duration": 4.694
    },
    {
        "text": "Again, the list goes on for quite a while.",
        "start": 690.54,
        "duration": 2.18
    },
    {
        "text": "As I look at some of these now, I'm really pleased to see that a lot of them have picked ",
        "start": 693.64,
        "duration": 3.88
    },
    {
        "text": "up some traction on YouTube, but there still remain many which are very underappreciated.",
        "start": 697.52,
        "duration": 3.88
    },
    {
        "text": "I highly encourage you to go to the playlist including all the video ",
        "start": 701.92,
        "duration": 3.229
    },
    {
        "text": "submissions and to check out the blog post featuring all other submissions.",
        "start": 705.149,
        "duration": 3.511
    },
    {
        "text": "As you look at that playlist, I would not read into the order of it too much, ",
        "start": 709.48,
        "duration": 3.26
    },
    {
        "text": "it was generated programmatically, but I did try to go through and curate ",
        "start": 712.74,
        "duration": 3.093
    },
    {
        "text": "the first few ones with videos that I think you might especially like.",
        "start": 715.833,
        "duration": 2.927
    },
    {
        "text": "Honestly though, you can happily scroll down that ",
        "start": 719.32,
        "duration": 1.936
    },
    {
        "text": "playlist and find hidden gems all throughout.",
        "start": 721.256,
        "duration": 1.744
    },
    {
        "text": "Like really, go check it out right now.",
        "start": 723.64,
        "duration": 1.94
    },
    {
        "text": "If you do, I can almost guarantee that you have hours of edification ",
        "start": 725.8,
        "duration": 3.465
    },
    {
        "text": "waiting ahead of you, not to mention hours of just pure delight.",
        "start": 729.265,
        "duration": 3.215
    },
    {
        "text": "Thanks again to everyone who participated.",
        "start": 733.58,
        "duration": 1.62
    },
    {
        "text": "Let me just say one more time, I really was blown away by the quality here.",
        "start": 735.52,
        "duration": 3.02
    }
]