[
    {
        "text": "E to the pi i equals negative one is one of the most famous equations in math, but it's",
        "start": 0.0,
        "duration": 12.6
    },
    {
        "text": "also one of the most confusing.",
        "start": 12.6,
        "duration": 1.92
    },
    {
        "text": "Those watching this video likely fall into one of three categories.",
        "start": 14.52,
        "duration": 2.68
    },
    {
        "text": "One, you know what each term means, but the statement as a whole seems nonsensical.",
        "start": 17.2,
        "duration": 3.96
    },
    {
        "text": "Two, you were lucky enough to see what this means, and some long formulas explaining why",
        "start": 21.16,
        "duration": 4.36
    },
    {
        "text": "it works in a calculus class, but it still feels like black magic.",
        "start": 25.52,
        "duration": 3.8
    },
    {
        "text": "Or three, it's not entirely clear what the terms themselves are.",
        "start": 29.32,
        "duration": 4.36
    },
    {
        "text": "Those in this last category might be in the best position to understand the explanation",
        "start": 33.68,
        "duration": 3.36
    },
    {
        "text": "I'm about to give, since it doesn't require any calculus or advanced math, but will instead",
        "start": 37.04,
        "duration": 4.3
    },
    {
        "text": "require an open-mindedness to reframing how we think about numbers.",
        "start": 41.34,
        "duration": 3.82
    },
    {
        "text": "Once we do this, it will become clear what the equation means, why it's true, and most",
        "start": 45.16,
        "duration": 4.6
    },
    {
        "text": "importantly why it makes intuitive sense.",
        "start": 49.76,
        "duration": 2.6
    },
    {
        "text": "First, let's get one thing straight.",
        "start": 52.36,
        "duration": 2.72
    },
    {
        "text": "What we write as e to the x is not repeated multiplication.",
        "start": 55.08,
        "duration": 3.44
    },
    {
        "text": "That would only make sense when x is a number that we can count, one, two, three, and so",
        "start": 58.52,
        "duration": 3.72
    },
    {
        "text": "on, and even then you'd have to define the number e first.",
        "start": 62.24,
        "duration": 3.24
    },
    {
        "text": "To understand what this function actually does, we first need to learn how to think",
        "start": 65.48,
        "duration": 3.24
    },
    {
        "text": "about numbers as actions.",
        "start": 68.72,
        "duration": 2.64
    },
    {
        "text": "We are first taught to think about numbers as counting things, and addition and multiplication",
        "start": 71.36,
        "duration": 3.74
    },
    {
        "text": "are thought of with respect to counting.",
        "start": 75.1,
        "duration": 4.66
    },
    {
        "text": "However, this mode of thinking becomes tricky when we talk about fractional amounts, very",
        "start": 79.76,
        "duration": 5.96
    },
    {
        "text": "tricky when we talk about irrational amounts, and downright nonsensical when we introduce",
        "start": 85.72,
        "duration": 3.92
    },
    {
        "text": "things like the square root of negative one.",
        "start": 89.64,
        "duration": 2.2
    },
    {
        "text": "Instead, we should think of each number as simultaneously being three things, a point",
        "start": 91.84,
        "duration": 4.52
    },
    {
        "text": "on an infinitely extending line, an action which slides that line along itself, in which",
        "start": 96.36,
        "duration": 4.8
    },
    {
        "text": "case we call it an adder, and an action which stretches the line, in which case we call",
        "start": 101.16,
        "duration": 4.12
    },
    {
        "text": "it a multiplier.",
        "start": 105.28,
        "duration": 1.98
    },
    {
        "text": "When you think about a number as an adder, you could imagine adding it with all numbers",
        "start": 107.26,
        "duration": 3.78
    },
    {
        "text": "as points on the line all at once, but instead forget that you already know anything about",
        "start": 111.04,
        "duration": 4.12
    },
    {
        "text": "addition so that we can reframe how you think about it.",
        "start": 115.16,
        "duration": 2.88
    },
    {
        "text": "Think of adders purely as sliding the line with the following rule.",
        "start": 118.04,
        "duration": 3.24
    },
    {
        "text": "You slide until the point corresponding to zero ends up where the point corresponding",
        "start": 121.28,
        "duration": 3.64
    },
    {
        "text": "with the adder itself started.",
        "start": 124.92,
        "duration": 2.0
    },
    {
        "text": "When you successively apply two adders, the effect will be the same as just applying some",
        "start": 126.92,
        "duration": 3.2
    },
    {
        "text": "other adder.",
        "start": 130.12,
        "duration": 1.16
    },
    {
        "text": "This is how we define their sum.",
        "start": 131.28,
        "duration": 2.0
    },
    {
        "text": "Likewise, forget that you already know anything about multiplication, and think of a multiplier",
        "start": 133.28,
        "duration": 4.36
    },
    {
        "text": "purely as a way to stretch the line.",
        "start": 137.64,
        "duration": 2.4
    },
    {
        "text": "Now, the rule is to fix zero in place, and bring the point corresponding with one to",
        "start": 140.04,
        "duration": 4.84
    },
    {
        "text": "where the point corresponding with the multiplier itself started off, keeping everything evenly",
        "start": 144.88,
        "duration": 4.2
    },
    {
        "text": "spaced as you do so.",
        "start": 149.08,
        "duration": 1.7
    },
    {
        "text": "Just as with adders, we can now redefine multiplication as the successive application of two different",
        "start": 150.78,
        "duration": 5.1
    },
    {
        "text": "actions.",
        "start": 155.88,
        "duration": 1.48
    },
    {
        "text": "The life's ambition of e to the x is to transform adders into multipliers, and to do so as naturally",
        "start": 157.36,
        "duration": 5.12
    },
    {
        "text": "as possible.",
        "start": 162.48,
        "duration": 1.04
    },
    {
        "text": "For instance, if you take two adders, successively apply them, then pump the resulting sum through",
        "start": 163.52,
        "duration": 4.52
    },
    {
        "text": "the function, it's the same as first putting each adder through the function separately,",
        "start": 168.04,
        "duration": 3.92
    },
    {
        "text": "then successively applying the two multipliers you get.",
        "start": 171.96,
        "duration": 2.68
    },
    {
        "text": "More succinctly, e to the x plus y equals e to the x times e to the y.",
        "start": 174.64,
        "duration": 4.56
    },
    {
        "text": "If e to the x was thought of as repeated multiplication, this property would be a consequence, but",
        "start": 179.2,
        "duration": 4.6
    },
    {
        "text": "really it goes the other way around.",
        "start": 183.8,
        "duration": 1.68
    },
    {
        "text": "You should think of this property as defining e to the x, and the fact that the special",
        "start": 185.48,
        "duration": 3.46
    },
    {
        "text": "case of counting numbers has anything to do with repeated multiplication is a consequence",
        "start": 188.94,
        "duration": 4.28
    },
    {
        "text": "of the property.",
        "start": 193.22,
        "duration": 3.1
    },
    {
        "text": "Multiple functions satisfy this property, but when you try to define one explicitly,",
        "start": 196.32,
        "duration": 4.22
    },
    {
        "text": "one stands out as being the most natural, and we express it with this infinite sum.",
        "start": 200.54,
        "duration": 5.08
    },
    {
        "text": "By the way, the number e is just defined to be the value of this function at one, the",
        "start": 205.62,
        "duration": 4.48
    },
    {
        "text": "number isn't nearly as special as the function as a whole, and the convention to write this",
        "start": 210.1,
        "duration": 3.8
    },
    {
        "text": "function as e to the x is a vestige of its relationship with repeated multiplication.",
        "start": 213.9,
        "duration": 4.82
    },
    {
        "text": "The other, less natural function satisfying this property are the exponentials with different",
        "start": 218.72,
        "duration": 3.9
    },
    {
        "text": "bases.",
        "start": 222.62,
        "duration": 1.84
    },
    {
        "text": "Now the expression e to the pi i at least seems to have some meaning, but you shouldn't",
        "start": 224.46,
        "duration": 3.88
    },
    {
        "text": "think about this infinite sum when trying to make sense of it, you only need to think",
        "start": 228.34,
        "duration": 3.24
    },
    {
        "text": "about turning adders into multipliers.",
        "start": 231.58,
        "duration": 4.96
    },
    {
        "text": "You see, we can also play this game of sliding and stretching in the 2D plane, and this is",
        "start": 236.54,
        "duration": 4.28
    },
    {
        "text": "what complex numbers are.",
        "start": 240.82,
        "duration": 1.8
    },
    {
        "text": "Each number is simultaneously a point on the plane, an adder which slides the plane so",
        "start": 242.62,
        "duration": 4.48
    },
    {
        "text": "that the point for 0 lands on the point for the number, and a multiplier which fixes 0",
        "start": 247.1,
        "duration": 5.16
    },
    {
        "text": "in place and brings the point for 1 to the point for the number while keeping everything",
        "start": 252.26,
        "duration": 4.34
    },
    {
        "text": "evenly spaced.",
        "start": 256.6,
        "duration": 1.72
    },
    {
        "text": "These can now include rotating along with some stretching and shrinking.",
        "start": 258.32,
        "duration": 3.52
    },
    {
        "text": "All of the actions of the real numbers still apply, sliding side to side and stretching,",
        "start": 261.84,
        "duration": 7.08
    },
    {
        "text": "but now we have a whole host of new actions.",
        "start": 268.92,
        "duration": 2.16
    },
    {
        "text": "For instance, take this point here, we call it i, as an adder it slides the plane up,",
        "start": 271.08,
        "duration": 5.12
    },
    {
        "text": "and as a multiplier it turns it a quarter of the way around.",
        "start": 276.2,
        "duration": 3.6
    },
    {
        "text": "Since multiplying it by itself gives negative 1, which is to say, applying this action twice",
        "start": 279.8,
        "duration": 4.72
    },
    {
        "text": "is the same as the action of negative 1 as a multiplier, it is the square root of negative",
        "start": 284.52,
        "duration": 6.36
    },
    {
        "text": "1.",
        "start": 290.88,
        "duration": 1.32
    },
    {
        "text": "All adding is some combination of sliding sideways and sliding up or down, and all multiplication",
        "start": 292.2,
        "duration": 5.06
    },
    {
        "text": "is some combination of stretching and rotating.",
        "start": 297.26,
        "duration": 3.9
    },
    {
        "text": "Since we already know that e to the x turns slide side to side into stretches, the most",
        "start": 301.16,
        "duration": 4.0
    },
    {
        "text": "natural thing you might expect is for it to turn this new dimension of adders, slides",
        "start": 305.16,
        "duration": 3.8
    },
    {
        "text": "up and down, directly into the new dimension of multipliers, rotations.",
        "start": 308.96,
        "duration": 4.72
    },
    {
        "text": "In terms of points on the plane, this would mean e to the x takes points on this vertical",
        "start": 313.68,
        "duration": 3.84
    },
    {
        "text": "line which correspond to adders that slide the plane up and down, and puts them on the",
        "start": 317.52,
        "duration": 4.24
    },
    {
        "text": "circle with radius 1, which corresponds with the multipliers that rotate the plane.",
        "start": 321.76,
        "duration": 4.98
    },
    {
        "text": "The most natural way you could imagine doing this is to wrap the line around the circle",
        "start": 326.74,
        "duration": 3.86
    },
    {
        "text": "without stretching or squishing it, which would mean it takes a length of 2 pi to go",
        "start": 330.6,
        "duration": 3.76
    },
    {
        "text": "completely around the circle, since by definition this is the ratio of the circumference of",
        "start": 334.36,
        "duration": 4.36
    },
    {
        "text": "a circle to its radius.",
        "start": 338.72,
        "duration": 2.0
    },
    {
        "text": "This means going up pi would translate to going exactly halfway around the circle.",
        "start": 340.72,
        "duration": 5.28
    },
    {
        "text": "When in doubt, if there's a natural way to do things, this is exactly what e to the x",
        "start": 346.0,
        "duration": 3.88
    },
    {
        "text": "will do, and this case is no exception.",
        "start": 349.88,
        "duration": 2.66
    },
    {
        "text": "If you want to see a full justification for why e to the x behaves this way, see this",
        "start": 352.54,
        "duration": 3.72
    },
    {
        "text": "additional video here.",
        "start": 356.26,
        "duration": 3.18
    },
    {
        "text": "So there you have it.",
        "start": 359.44,
        "duration": 1.0
    },
    {
        "text": "This function e to the x takes the adder pi i to the multiplier negative 1.",
        "start": 360.44,
        "duration": 3.76
    },
    {
        "text": "Thank you.",
        "start": 370.72,
        "duration": 1.0
    },
    {
        "text": "Thank you.",
        "start": 371.72,
        "duration": 0.02
    }
]