[
    {
        "text": "So, in my video with Steve Strogatz about the brachistochrone, we reference this thing",
        "start": 0.0,
        "duration": 7.92
    },
    {
        "text": "called Snell's Law.",
        "start": 7.92,
        "duration": 1.6
    },
    {
        "text": "It's the principle in physics that tells you how light bends as it travels from one medium",
        "start": 9.52,
        "duration": 4.24
    },
    {
        "text": "into another where its speed changes.",
        "start": 13.76,
        "duration": 2.58
    },
    {
        "text": "Our conversation did talk about this in detail, but it was a little bit too much detail, so",
        "start": 16.34,
        "duration": 5.16
    },
    {
        "text": "I ended up cutting it out of the video.",
        "start": 21.5,
        "duration": 2.04
    },
    {
        "text": "So what I want to do here is just show you a condensed version of that, because it references",
        "start": 23.54,
        "duration": 3.9
    },
    {
        "text": "a pretty clever argument by Mark Levy, and it also gives a sense of completion to the",
        "start": 27.44,
        "duration": 4.28
    },
    {
        "text": "brachistochrone solution as a whole.",
        "start": 31.72,
        "duration": 6.16
    },
    {
        "text": "Consider when light travels from air into water.",
        "start": 37.88,
        "duration": 2.8
    },
    {
        "text": "The speed of light is a little bit slower in water than it is in air, and this results",
        "start": 40.68,
        "duration": 4.36
    },
    {
        "text": "in the beam of light bending as it enters the water.",
        "start": 45.04,
        "duration": 3.6
    },
    {
        "text": "Why?",
        "start": 48.64,
        "duration": 2.08
    },
    {
        "text": "There are many ways that you can think about this, but a pretty neat one is to use Fermat's",
        "start": 50.72,
        "duration": 3.56
    },
    {
        "text": "Principle.",
        "start": 54.28,
        "duration": 1.0
    },
    {
        "text": "We talked about this in detail in the brachistochrone video, but in short, it tells you that if",
        "start": 55.32,
        "duration": 4.0
    },
    {
        "text": "light goes from some point to another, it will always do it in the fastest way possible.",
        "start": 59.32,
        "duration": 7.4
    },
    {
        "text": "Consider some point A in its trajectory in the air, and some point B on its trajectory",
        "start": 66.72,
        "duration": 4.38
    },
    {
        "text": "in the water.",
        "start": 71.1,
        "duration": 2.3
    },
    {
        "text": "First you might think that the straight line between them is the fastest path.",
        "start": 73.4,
        "duration": 3.6
    },
    {
        "text": "The only problem with that strategy though, even though it's the shortest path, is that",
        "start": 77.0,
        "duration": 4.0
    },
    {
        "text": "you may be spending a long time in the water.",
        "start": 81.0,
        "duration": 2.9
    },
    {
        "text": "The light is slower in the water, so the path can become faster if we shift things to favor",
        "start": 84.02,
        "duration": 4.28
    },
    {
        "text": "spending more time in the air.",
        "start": 88.3,
        "duration": 2.08
    },
    {
        "text": "You might even try to minimize the time spent in the water by shifting it all the way to",
        "start": 90.38,
        "duration": 3.56
    },
    {
        "text": "the right.",
        "start": 93.94,
        "duration": 1.0
    },
    {
        "text": "However, it's not actually the best thing to do either.",
        "start": 94.94,
        "duration": 2.88
    },
    {
        "text": "As with the brachistochrone problem, we find ourselves trying to balance these two competing",
        "start": 97.82,
        "duration": 3.72
    },
    {
        "text": "factors.",
        "start": 101.54,
        "duration": 1.0
    },
    {
        "text": "It's a problem that you can write down with geometry.",
        "start": 102.54,
        "duration": 3.4
    },
    {
        "text": "And if this was a calculus class, we would set up the appropriate equation with a single",
        "start": 105.94,
        "duration": 3.78
    },
    {
        "text": "variable x, and find where its derivative is zero.",
        "start": 109.72,
        "duration": 3.68
    },
    {
        "text": "But we've got something better than calculus, a Mark-Levy solution.",
        "start": 113.4,
        "duration": 5.48
    },
    {
        "text": "He recognized that optics is not the only time that nature seeks out a minimum.",
        "start": 118.88,
        "duration": 4.24
    },
    {
        "text": "It does so with energy as well.",
        "start": 123.12,
        "duration": 2.08
    },
    {
        "text": "Any mechanical setup will stabilize when the potential energy is at a minimum.",
        "start": 125.2,
        "duration": 5.26
    },
    {
        "text": "So for this light-into-media problem, he imagines putting a rod on the border between the air",
        "start": 130.46,
        "duration": 5.38
    },
    {
        "text": "and the water, and placing a ring on the rod, which is free to slide left and right.",
        "start": 135.84,
        "duration": 5.56
    },
    {
        "text": "Now attach a spring from point A to the ring, and a second spring between the ring and point",
        "start": 141.4,
        "duration": 5.92
    },
    {
        "text": "B. You can think of the layout of the springs as a potential path that light could take",
        "start": 147.32,
        "duration": 4.88
    },
    {
        "text": "between A and B.",
        "start": 152.2,
        "duration": 2.2
    },
    {
        "text": "To finagle things so that the potential energy in the springs equals the amount of time that",
        "start": 154.4,
        "duration": 4.0
    },
    {
        "text": "light would take on that path, you just need to make sure that each spring has a constant",
        "start": 158.4,
        "duration": 4.2
    },
    {
        "text": "tension which is inversely proportional to the speed of light in its medium.",
        "start": 162.6,
        "duration": 7.32
    },
    {
        "text": "The only problem with this is that constant tension springs don't actually exist.",
        "start": 169.92,
        "duration": 4.56
    },
    {
        "text": "That's right, they're unphysical springs, but there's still the aspect of the system",
        "start": 174.48,
        "duration": 4.24
    },
    {
        "text": "wanting to minimize its total energy.",
        "start": 178.72,
        "duration": 3.36
    },
    {
        "text": "That physical principle will hold even though these springs don't exist in the world as",
        "start": 182.08,
        "duration": 4.44
    },
    {
        "text": "we know it.",
        "start": 186.52,
        "duration": 1.72
    },
    {
        "text": "The reason springs make the problem simpler though, is that we can find the stable state",
        "start": 188.24,
        "duration": 4.08
    },
    {
        "text": "just by balancing forces.",
        "start": 192.36,
        "duration": 1.84
    },
    {
        "text": "The leftward component of the force in the top spring has to cancel out with the rightward",
        "start": 194.2,
        "duration": 4.0
    },
    {
        "text": "component in the force of the bottom spring.",
        "start": 198.2,
        "duration": 2.32
    },
    {
        "text": "In this case, the horizontal component in each spring is just the total force times",
        "start": 200.52,
        "duration": 4.98
    },
    {
        "text": "the sine of the angle that that spring makes with the vertical.",
        "start": 205.5,
        "duration": 4.46
    },
    {
        "text": "And from that, out pops this thing called Snell's law, which many of us learned in our",
        "start": 209.96,
        "duration": 4.24
    },
    {
        "text": "first physics class.",
        "start": 214.2,
        "duration": 1.96
    },
    {
        "text": "Snell's law says that sine of theta divided by the speed of light stays constant when",
        "start": 216.16,
        "duration": 4.84
    },
    {
        "text": "light travels from one medium to another, where theta is the angle that beam of light",
        "start": 221.04,
        "duration": 4.2
    },
    {
        "text": "makes with a line perpendicular to the interface between the two media.",
        "start": 225.24,
        "duration": 4.5
    },
    {
        "text": "So there you go, no calculus necessary.",
        "start": 229.74,
        "duration": 1.9
    }
]