[
    {
        "text": "In a moment I'm going to tell you about a certain ",
        "start": 0.0,
        "duration": 2.15
    },
    {
        "text": "really nice puzzle involving the shadow of a cube.",
        "start": 2.15,
        "duration": 2.15
    },
    {
        "text": "But before we get to that, I should say that the point of this video is ",
        "start": 5.0,
        "duration": 3.306
    },
    {
        "text": "not exactly the puzzle per se, it's about two distinct problem-solving ",
        "start": 8.306,
        "duration": 3.26
    },
    {
        "text": "styles that are reflected in two different ways that we can tackle this problem.",
        "start": 11.566,
        "duration": 3.674
    },
    {
        "text": "In fact, let's anthropomorphize those two different styles by imagining two students, ",
        "start": 15.78,
        "duration": 4.25
    },
    {
        "text": "Alice and Bob, that embody each one of the approaches.",
        "start": 20.03,
        "duration": 2.67
    },
    {
        "text": "So Bob will be the kind of student who really loves calculation.",
        "start": 23.5,
        "duration": 3.48
    },
    {
        "text": "As soon as there's a moment when he can dig into the details and get a very concrete ",
        "start": 26.98,
        "duration": 3.723
    },
    {
        "text": "view of the concrete situation in front of him, that's where he's the most pleased.",
        "start": 30.703,
        "duration": 3.637
    },
    {
        "text": "Alice on the other hand is more inclined to procrastinate the computations, ",
        "start": 35.12,
        "duration": 3.774
    },
    {
        "text": "not because she doesn't know how to do them or doesn't want to per se, ",
        "start": 38.894,
        "duration": 3.526
    },
    {
        "text": "but she prefers to get a nice high-level general overview of the kind of problem ",
        "start": 42.42,
        "duration": 4.023
    },
    {
        "text": "she's dealing with, the general shape that it has before she digs into the ",
        "start": 46.443,
        "duration": 3.725
    },
    {
        "text": "computations themselves.",
        "start": 50.168,
        "duration": 1.192
    },
    {
        "text": "She's most pleased if she understands not just the specific question sitting ",
        "start": 52.16,
        "duration": 3.731
    },
    {
        "text": "in front of her, but also the broadest possible way that you could generalize it, ",
        "start": 55.891,
        "duration": 3.973
    },
    {
        "text": "and especially if the more general view can lend itself to more swift and ",
        "start": 59.864,
        "duration": 3.586
    },
    {
        "text": "elegant computations, once she does actually sit down to carry them out.",
        "start": 63.45,
        "duration": 3.49
    },
    {
        "text": "Now the puzzle that both of them are going to be faced ",
        "start": 73.02,
        "duration": 2.978
    },
    {
        "text": "with is to find the average area for the shadow of a cube.",
        "start": 75.998,
        "duration": 3.142
    },
    {
        "text": "So if I have a cube kind of sitting here hovering in space, ",
        "start": 79.9,
        "duration": 2.757
    },
    {
        "text": "there are a few things that influence the area of its shadow.",
        "start": 82.657,
        "duration": 2.803
    },
    {
        "text": "One obvious one would be the size of the cube, smaller cube, smaller shadow.",
        "start": 85.46,
        "duration": 3.8
    },
    {
        "text": "But also if it's sitting at different orientations, ",
        "start": 89.88,
        "duration": 2.418
    },
    {
        "text": "those orientations correspond to different particular shadows with different areas.",
        "start": 92.298,
        "duration": 3.862
    },
    {
        "text": "And when I say find the average here, what I mean is average ",
        "start": 96.78,
        "duration": 3.059
    },
    {
        "text": "over all possible orientations for a particular size of the cube.",
        "start": 99.839,
        "duration": 3.261
    },
    {
        "text": "The astute among you might point out that it also matters a lot where the light source is.",
        "start": 104.42,
        "duration": 3.68
    },
    {
        "text": "If the light source were very low, close to the cube itself, ",
        "start": 108.36,
        "duration": 2.851
    },
    {
        "text": "then the shadow ends up larger.",
        "start": 111.211,
        "duration": 1.449
    },
    {
        "text": "And if the light source were kind of positioned laterally off to the side, ",
        "start": 112.66,
        "duration": 3.206
    },
    {
        "text": "this can distort the shadow and give it a very different shape.",
        "start": 115.866,
        "duration": 2.694
    },
    {
        "text": "Accounting for that light position stands to be highly interesting in its own right, ",
        "start": 119.26,
        "duration": 4.344
    },
    {
        "text": "but the puzzle is hard enough as it is, so at least initially, ",
        "start": 123.604,
        "duration": 3.221
    },
    {
        "text": "let's do the easiest thing we can and say that the light is directly above the cube and ",
        "start": 126.825,
        "duration": 4.498
    },
    {
        "text": "really far away, effectively infinitely far, so that all we're considering is a flat ",
        "start": 131.323,
        "duration": 4.345
    },
    {
        "text": "projection, in the sense that if you look at any coordinates, x, y, z, in space, ",
        "start": 135.668,
        "duration": 4.14
    },
    {
        "text": "the flat projection would be x, y, 0.",
        "start": 139.808,
        "duration": 1.892
    },
    {
        "text": "So, just to get our bearings, the easiest situation to think about would ",
        "start": 142.48,
        "duration": 3.331
    },
    {
        "text": "be if the cube is straight up, with two of its faces parallel to the ground.",
        "start": 145.811,
        "duration": 3.469
    },
    {
        "text": "In that case, this flat projection shadow is simply a square, ",
        "start": 149.92,
        "duration": 3.365
    },
    {
        "text": "and if we say the side lengths of the cube are s, then the area of that shadow is s².",
        "start": 153.285,
        "duration": 4.615
    },
    {
        "text": "And by the way, any time that I have a label up on these animations, ",
        "start": 158.74,
        "duration": 2.972
    },
    {
        "text": "like the one down here, I'll be assuming that the relevant cube has a side length of 1.",
        "start": 161.712,
        "duration": 3.748
    },
    {
        "text": "Now, another special case among all the orientations that's fun to think ",
        "start": 166.24,
        "duration": 3.423
    },
    {
        "text": "about is if the long diagonal is parallel to the direction of the light.",
        "start": 169.663,
        "duration": 3.377
    },
    {
        "text": "In that case, the shadow actually looks like a regular hexagon, ",
        "start": 173.6,
        "duration": 3.043
    },
    {
        "text": "and if you use some of the methods that we will develop in a few minutes, ",
        "start": 176.643,
        "duration": 3.518
    },
    {
        "text": "you can compute that the area of that shadow is exactly the square root of 3 times ",
        "start": 180.161,
        "duration": 3.947
    },
    {
        "text": "the area of one of the square faces.",
        "start": 184.108,
        "duration": 1.712
    },
    {
        "text": "But of course, more often, the actual shadow will ",
        "start": 186.66,
        "duration": 2.44
    },
    {
        "text": "be not so regular as a square or a hexagon.",
        "start": 189.1,
        "duration": 2.1
    },
    {
        "text": "It's some harder to think about shape, based on ",
        "start": 191.66,
        "duration": 2.176
    },
    {
        "text": "some harder to think about orientation for this cube.",
        "start": 193.836,
        "duration": 2.404
    },
    {
        "text": "Earlier, I casually threw out this phrase of averaging over all possible orientations, ",
        "start": 197.06,
        "duration": 4.716
    },
    {
        "text": "but you could rightly ask, what exactly is that supposed to mean?",
        "start": 201.776,
        "duration": 3.524
    },
    {
        "text": "I think a lot of us have an intuitive feel for what we want it to mean, ",
        "start": 206.16,
        "duration": 3.47
    },
    {
        "text": "at least in the sense of what experiment would you do to verify it.",
        "start": 209.63,
        "duration": 3.23
    },
    {
        "text": "You might imagine tossing this cube in the air, like a die, ",
        "start": 213.06,
        "duration": 3.33
    },
    {
        "text": "freezing it at some arbitrary point, recording the area of the shadow from that position, ",
        "start": 216.39,
        "duration": 4.995
    },
    {
        "text": "and then repeating.",
        "start": 221.385,
        "duration": 1.055
    },
    {
        "text": "If you do this many many times, over and over, you can take the mean of your sample.",
        "start": 223.64,
        "duration": 4.74
    },
    {
        "text": "The number that we want to get at, the true average here, ",
        "start": 229.22,
        "duration": 2.957
    },
    {
        "text": "should be whatever that experimental mean approaches as you do more and more tosses, ",
        "start": 232.177,
        "duration": 4.335
    },
    {
        "text": "approaching infinitely many.",
        "start": 236.512,
        "duration": 1.428
    },
    {
        "text": "Even still, the sticklers among you could complain that doesn't really answer ",
        "start": 240.44,
        "duration": 3.565
    },
    {
        "text": "the question, because it leaves open the issue of how we're defining a random toss.",
        "start": 244.005,
        "duration": 3.795
    },
    {
        "text": "The proper way to answer this, if we want it to be more formal, ",
        "start": 248.3,
        "duration": 3.196
    },
    {
        "text": "would be to first describe the space of all possible orientations, ",
        "start": 251.496,
        "duration": 3.346
    },
    {
        "text": "which mathematicians have actually given a fancy name.",
        "start": 254.842,
        "duration": 2.698
    },
    {
        "text": "They call it SO3, typically defined in terms of a certain family of 3x3 matrices.",
        "start": 257.64,
        "duration": 4.8
    },
    {
        "text": "And the question we want to answer is, what probability ",
        "start": 263.1,
        "duration": 3.018
    },
    {
        "text": "distribution are we putting to this entire space?",
        "start": 266.118,
        "duration": 2.642
    },
    {
        "text": "It's only when such a probability distribution is well-defined, ",
        "start": 269.1,
        "duration": 3.005
    },
    {
        "text": "that we can answer a question involving an average.",
        "start": 272.105,
        "duration": 2.395
    },
    {
        "text": "If you are a stickler for that kind of thing, I want you ",
        "start": 275.8,
        "duration": 2.532
    },
    {
        "text": "to hold off on that question until the end of the video.",
        "start": 278.332,
        "duration": 2.488
    },
    {
        "text": "You'll be surprised at how far we can get with the more heuristic, ",
        "start": 280.98,
        "duration": 3.013
    },
    {
        "text": "experimental idea of just repeating a bunch of random tosses without really defining ",
        "start": 283.993,
        "duration": 3.822
    },
    {
        "text": "the distribution.",
        "start": 287.815,
        "duration": 0.765
    },
    {
        "text": "Once we see Alice and Bob's solutions, it's actually very interesting to ",
        "start": 289.28,
        "duration": 3.551
    },
    {
        "text": "ask how exactly each one of them defined this distribution along their way.",
        "start": 292.831,
        "duration": 3.649
    },
    {
        "text": "And remember, this is not meant to be a lesson about cube shadows per se, ",
        "start": 297.92,
        "duration": 3.538
    },
    {
        "text": "but a lesson about problem solving, told through the lens of two ",
        "start": 301.458,
        "duration": 3.107
    },
    {
        "text": "different mindsets that we might bring to the puzzle.",
        "start": 304.565,
        "duration": 2.535
    },
    {
        "text": "And as with any lesson on problem solving, the goal here is not to get to the answer ",
        "start": 307.86,
        "duration": 3.884
    },
    {
        "text": "as quickly as we can, but hopefully for you to feel like you found the answer yourself.",
        "start": 311.744,
        "duration": 3.976
    },
    {
        "text": "So if ever there's a point when you feel like you might have an idea, ",
        "start": 316.02,
        "duration": 2.526
    },
    {
        "text": "give yourself the freedom to pause and try to think it through.",
        "start": 318.546,
        "duration": 2.274
    },
    {
        "text": "As a first step, and this is really independent of any particular problem solving style, ",
        "start": 325.42,
        "duration": 4.543
    },
    {
        "text": "just any time you find a hard question, a good thing that you can do is ask, ",
        "start": 329.963,
        "duration": 3.931
    },
    {
        "text": "what's the simplest possible, non-trivial variant of the problem that you can try to ",
        "start": 333.894,
        "duration": 4.339
    },
    {
        "text": "solve?",
        "start": 338.233,
        "duration": 0.307
    },
    {
        "text": "So in our case, what you might say is, okay, let's ",
        "start": 339.56,
        "duration": 2.264
    },
    {
        "text": "forget about averaging over all the orientations.",
        "start": 341.824,
        "duration": 2.176
    },
    {
        "text": "That's a tricky thing to think about.",
        "start": 344.12,
        "duration": 1.3
    },
    {
        "text": "And let's even forget about all the different faces of the cube, ",
        "start": 345.68,
        "duration": 2.693
    },
    {
        "text": "because they overlap, and that's also tricky to think about.",
        "start": 348.373,
        "duration": 2.487
    },
    {
        "text": "Just for one particular face, and one particular orientation, ",
        "start": 351.34,
        "duration": 3.413
    },
    {
        "text": "can we compute the area of this shadow?",
        "start": 354.753,
        "duration": 2.147
    },
    {
        "text": "Once more, if you want to get your bearings with some special cases, ",
        "start": 357.66,
        "duration": 3.127
    },
    {
        "text": "the easiest is when that face is parallel to the ground, ",
        "start": 360.787,
        "duration": 2.584
    },
    {
        "text": "in which case the area of the shadow is the same as the area of the face.",
        "start": 363.371,
        "duration": 3.309
    },
    {
        "text": "And on the other hand, if we were to tilt that face 90 degrees, ",
        "start": 367.18,
        "duration": 3.035
    },
    {
        "text": "then its shadow will be a straight line, and it has an area of zero.",
        "start": 370.215,
        "duration": 3.225
    },
    {
        "text": "So Bob looks at this, and he wants an actual formula for that shadow.",
        "start": 374.3,
        "duration": 3.12
    },
    {
        "text": "And the way he might think about it is to consider ",
        "start": 377.9,
        "duration": 2.447
    },
    {
        "text": "the normal vector perpendicular off of that face.",
        "start": 380.347,
        "duration": 2.353
    },
    {
        "text": "And what seems relevant is the angle that that normal vector makes with the vertical, ",
        "start": 383.18,
        "duration": 3.64
    },
    {
        "text": "with the direction where the light is coming from, which we might call theta.",
        "start": 386.82,
        "duration": 3.26
    },
    {
        "text": "Now, from the two special cases we just looked at, ",
        "start": 391.2,
        "duration": 2.468
    },
    {
        "text": "we know that when theta is equal to zero, the area of that shadow is ",
        "start": 393.668,
        "duration": 3.341
    },
    {
        "text": "the same as the area of the shape itself, which is s squared if the ",
        "start": 397.009,
        "duration": 3.292
    },
    {
        "text": "square has side lengths s.",
        "start": 400.301,
        "duration": 1.259
    },
    {
        "text": "And if theta is equal to 90 degrees, then the area of that shadow is zero.",
        "start": 402.2,
        "duration": 3.6
    },
    {
        "text": "And it's probably not too hard to guess that trigonometry will be somehow relevant, ",
        "start": 406.24,
        "duration": 3.628
    },
    {
        "text": "so anyone comfortable with their trig functions could probably ",
        "start": 409.868,
        "duration": 2.721
    },
    {
        "text": "hazard a guess as to what the right formula is.",
        "start": 412.589,
        "duration": 2.031
    },
    {
        "text": "But Bob is more detail-oriented than that.",
        "start": 414.62,
        "duration": 2.5
    },
    {
        "text": "He wants to properly prove what that area should be, ",
        "start": 417.4,
        "duration": 2.267
    },
    {
        "text": "rather than just making a guess based on the endpoints.",
        "start": 419.667,
        "duration": 2.353
    },
    {
        "text": "And the way you might think about it could be something like this.",
        "start": 422.82,
        "duration": 1.92
    },
    {
        "text": "If we consider the plane that passes through the vertical as well as our normal vector, ",
        "start": 424.98,
        "duration": 4.515
    },
    {
        "text": "and then we consider all the different slices of our shape that are in that plane, ",
        "start": 429.495,
        "duration": 4.259
    },
    {
        "text": "or parallel to that plane, then we can focus our attention on a ",
        "start": 433.754,
        "duration": 3.284
    },
    {
        "text": "two-dimensional variant of the problem.",
        "start": 437.038,
        "duration": 2.002
    },
    {
        "text": "If we just look at one of those slices, who has a normal vector, ",
        "start": 439.32,
        "duration": 3.321
    },
    {
        "text": "an angle theta away from the vertical, its shadow might look something like this.",
        "start": 442.641,
        "duration": 4.139
    },
    {
        "text": "And if we draw a vertical line up to the left here, we have ourselves a right triangle.",
        "start": 447.46,
        "duration": 3.56
    },
    {
        "text": "And from here we can do a little bit of angle chasing, ",
        "start": 451.6,
        "duration": 2.359
    },
    {
        "text": "where we follow around what that angle theta implies about the rest of the diagram.",
        "start": 453.959,
        "duration": 3.561
    },
    {
        "text": "And this means the lower right angle in this triangle is precisely theta.",
        "start": 458.58,
        "duration": 3.78
    },
    {
        "text": "So, when we want to understand the size of this shadow in comparison ",
        "start": 463.48,
        "duration": 3.736
    },
    {
        "text": "to the original size of the piece, we can think about the cosine of that angle, ",
        "start": 467.216,
        "duration": 4.331
    },
    {
        "text": "theta, which remembers the adjacent over the hypotenuse.",
        "start": 471.547,
        "duration": 3.033
    },
    {
        "text": "It's literally the ratio between the size of the shadow and the size of the slice.",
        "start": 474.7,
        "duration": 3.48
    },
    {
        "text": "So, the factor by which the slice gets squished ",
        "start": 478.9,
        "duration": 2.752
    },
    {
        "text": "down in this direction is exactly cosine of theta.",
        "start": 481.652,
        "duration": 2.868
    },
    {
        "text": "And if we broaden our view to the entire square, ",
        "start": 485.14,
        "duration": 2.205
    },
    {
        "text": "all the slices in that direction get scaled by the same factor.",
        "start": 487.345,
        "duration": 2.835
    },
    {
        "text": "But in the other direction, in the one perpendicular to that slice, ",
        "start": 490.38,
        "duration": 3.269
    },
    {
        "text": "there is no stretching or squishing, because the face is not at all tilted in ",
        "start": 493.649,
        "duration": 3.749
    },
    {
        "text": "that direction.",
        "start": 497.398,
        "duration": 0.722
    },
    {
        "text": "So overall, the two-dimensional shadow of our two-dimensional face ",
        "start": 498.12,
        "duration": 3.906
    },
    {
        "text": "should also be scaled down by this factor of a cosine of theta.",
        "start": 502.026,
        "duration": 3.674
    },
    {
        "text": "It lines up with what you might intuitively guess, ",
        "start": 506.26,
        "duration": 2.298
    },
    {
        "text": "given the case where the angle is 0° and the case where it's 90°, ",
        "start": 508.558,
        "duration": 2.974
    },
    {
        "text": "but it's reassuring to see why it's true.",
        "start": 511.532,
        "duration": 1.848
    },
    {
        "text": "And actually, as stated so far, this is not quite correct.",
        "start": 514.96,
        "duration": 3.36
    },
    {
        "text": "There is a small problem with the formula that we've written.",
        "start": 518.52,
        "duration": 2.279
    },
    {
        "text": "In the case where theta is bigger than 90°, the ",
        "start": 521.34,
        "duration": 2.502
    },
    {
        "text": "cosine would actually come out to be negative.",
        "start": 523.842,
        "duration": 2.398
    },
    {
        "text": "But of course, we don't want to consider the shadow to have negative area, ",
        "start": 526.24,
        "duration": 3.486
    },
    {
        "text": "at least not in a problem like this.",
        "start": 529.726,
        "duration": 1.674
    },
    {
        "text": "So there's two different ways you could solve this.",
        "start": 531.86,
        "duration": 1.44
    },
    {
        "text": "You could say we only ever want to consider the normal vector that is pointing up, ",
        "start": 533.38,
        "duration": 3.579
    },
    {
        "text": "that has a positive z component.",
        "start": 536.959,
        "duration": 1.381
    },
    {
        "text": "Or, more simply, we could say, just take the absolute value of that cosine, ",
        "start": 538.84,
        "duration": 4.062
    },
    {
        "text": "and that gives us a valid formula.",
        "start": 542.902,
        "duration": 1.818
    },
    {
        "text": "So Bob's happy because he has a precise formula describing the area of the shadow.",
        "start": 546.98,
        "duration": 3.88
    },
    {
        "text": "But Alice starts to think about it a little bit differently.",
        "start": 551.5,
        "duration": 2.56
    },
    {
        "text": "She says, okay, we've got some shape, and then we apply a rotation ",
        "start": 554.06,
        "duration": 3.481
    },
    {
        "text": "that sort of situates it into 3D space in some way, ",
        "start": 557.541,
        "duration": 2.702
    },
    {
        "text": "and then we apply a flat projection that shoves that back into two-dimensional space.",
        "start": 560.243,
        "duration": 4.417
    },
    {
        "text": "And what stands out to her is that both of these are linear transformations.",
        "start": 565.08,
        "duration": 3.26
    },
    {
        "text": "That means that in principle you could describe each one of them with a matrix, ",
        "start": 569.06,
        "duration": 3.44
    },
    {
        "text": "and that the overall transformation would look like the product of those two matrices.",
        "start": 572.5,
        "duration": 3.7
    },
    {
        "text": "What Alice knows from one of her favorite subjects, linear algebra, ",
        "start": 577.0,
        "duration": 3.483
    },
    {
        "text": "is that if you take some shape and you consider its area, ",
        "start": 580.483,
        "duration": 2.972
    },
    {
        "text": "then you apply some linear transformation, then the area of that output looks like some ",
        "start": 583.455,
        "duration": 4.508
    },
    {
        "text": "constant times the original area of the shape.",
        "start": 587.963,
        "duration": 2.357
    },
    {
        "text": "More specifically, we have a name for that constant.",
        "start": 590.9,
        "duration": 1.88
    },
    {
        "text": "It's called the determinant of the transformation.",
        "start": 592.86,
        "duration": 2.1
    },
    {
        "text": "If you're not so comfortable with linear algebra, ",
        "start": 596.26,
        "duration": 2.424
    },
    {
        "text": "we could give a much more intuitive description and say, ",
        "start": 598.684,
        "duration": 2.765
    },
    {
        "text": "if you uniformly stretch the original shape in some direction, ",
        "start": 601.449,
        "duration": 3.055
    },
    {
        "text": "the output will also uniformly get stretched in some direction.",
        "start": 604.504,
        "duration": 3.056
    },
    {
        "text": "So the area of each of them should scale in proportion to each other.",
        "start": 607.56,
        "duration": 3.84
    },
    {
        "text": "Now, in principle, Alice could compute this determinant, ",
        "start": 612.16,
        "duration": 2.64
    },
    {
        "text": "but it's not really her style to do that, at least not to do so immediately.",
        "start": 614.8,
        "duration": 3.52
    },
    {
        "text": "Instead, the thing that she writes down is how this proportionality constant ",
        "start": 618.88,
        "duration": 4.031
    },
    {
        "text": "between our original shape and its shadow does not depend on the original shape.",
        "start": 622.911,
        "duration": 4.189
    },
    {
        "text": "We could be talking about the shadow of this cat outline, ",
        "start": 627.26,
        "duration": 2.667
    },
    {
        "text": "or anything else, and the size of it doesn't really matter.",
        "start": 629.927,
        "duration": 2.713
    },
    {
        "text": "The only thing affecting that proportionality constant is what transformation ",
        "start": 632.64,
        "duration": 3.791
    },
    {
        "text": "we're applying, which in this context means we could write it down as ",
        "start": 636.431,
        "duration": 3.403
    },
    {
        "text": "some factor that depends on the rotation being applied to the shape.",
        "start": 639.834,
        "duration": 3.306
    },
    {
        "text": "In the back of our mind, because of Bob's calculation, ",
        "start": 644.5,
        "duration": 2.248
    },
    {
        "text": "we know what that factor looks like.",
        "start": 646.748,
        "duration": 1.472
    },
    {
        "text": "You know, it's the absolute value of the cosine of ",
        "start": 648.36,
        "duration": 2.03
    },
    {
        "text": "the angle between the normal vector and the vertical.",
        "start": 650.39,
        "duration": 2.11
    },
    {
        "text": "But Alice right now is just saying, yeah, yeah, ",
        "start": 653.16,
        "duration": 1.705
    },
    {
        "text": "yeah, I can think about that eventually when I want to.",
        "start": 654.865,
        "duration": 1.955
    },
    {
        "text": "But she knows we're about to average over all the different orientations anyway, ",
        "start": 657.04,
        "duration": 3.856
    },
    {
        "text": "though she holds out some hope that any specific formula about a ",
        "start": 660.896,
        "duration": 3.095
    },
    {
        "text": "specific orientation might get washed away in that average.",
        "start": 663.991,
        "duration": 2.809
    },
    {
        "text": "Now it's easy to look at this and say, okay, well, Alice isn't really doing anything then.",
        "start": 668.22,
        "duration": 3.42
    },
    {
        "text": "Of course the area of the shadow is proportional to the area of the original shape.",
        "start": 671.78,
        "duration": 3.66
    },
    {
        "text": "They're both two-dimensional quantities.",
        "start": 675.62,
        "duration": 1.66
    },
    {
        "text": "They should both scale like two-dimensional things.",
        "start": 677.38,
        "duration": 2.26
    },
    {
        "text": "But keep in mind, this would not at all be true if we were ",
        "start": 680.2,
        "duration": 2.716
    },
    {
        "text": "dealing with the harder case that has a closer light source.",
        "start": 682.916,
        "duration": 2.764
    },
    {
        "text": "In that case, the projection is not linear.",
        "start": 685.84,
        "duration": 2.14
    },
    {
        "text": "For example, if I rotate this cat so that its tail ends up quite close to the light ",
        "start": 687.98,
        "duration": 4.462
    },
    {
        "text": "source, then if I stretch the original shape uniformly in the x-direction, ",
        "start": 692.442,
        "duration": 3.984
    },
    {
        "text": "say by a factor of 1.5, it might have a very disproportionate effect on the ultimate ",
        "start": 696.426,
        "duration": 4.515
    },
    {
        "text": "shadow because the tail gets very disproportionately blown up as it gets really close ",
        "start": 700.941,
        "duration": 4.568
    },
    {
        "text": "to the light.",
        "start": 705.509,
        "duration": 0.691
    },
    {
        "text": "Again, Alice is keeping an eye out for what properties of the problem are ",
        "start": 706.88,
        "duration": 3.131
    },
    {
        "text": "actually relevant because that helps her know how much she can generalize things.",
        "start": 710.011,
        "duration": 3.429
    },
    {
        "text": "Does the fact that we're thinking about a square face and not some other shape matter?",
        "start": 713.96,
        "duration": 3.3
    },
    {
        "text": "No, not really.",
        "start": 717.26,
        "duration": 1.38
    },
    {
        "text": "Does the fact that the transformation is linear matter?",
        "start": 718.78,
        "duration": 2.54
    },
    {
        "text": "Yes, absolutely.",
        "start": 721.82,
        "duration": 1.02
    },
    {
        "text": "Alice can also apply a similar way of thinking ",
        "start": 726.56,
        "duration": 2.545
    },
    {
        "text": "about the average shadow for any shape like this.",
        "start": 729.105,
        "duration": 2.655
    },
    {
        "text": "Say we have some sequence of rotations that we apply to our square face.",
        "start": 732.02,
        "duration": 3.98
    },
    {
        "text": "And let's call them R1, R2, R3, and so on.",
        "start": 736.58,
        "duration": 2.98
    },
    {
        "text": "Then the area of the shadow in each one of those cases ",
        "start": 739.72,
        "duration": 2.929
    },
    {
        "text": "looks like some factor times the area of the square.",
        "start": 742.649,
        "duration": 2.771
    },
    {
        "text": "And that factor depends on the rotation.",
        "start": 745.42,
        "duration": 1.88
    },
    {
        "text": "So if we take an empirical average for that shadow across the sample of ",
        "start": 748.06,
        "duration": 3.435
    },
    {
        "text": "rotations we're looking at right now, the way it looks is to add up all ",
        "start": 751.495,
        "duration": 3.436
    },
    {
        "text": "of those shadow areas and then divide by the total number that we have.",
        "start": 754.931,
        "duration": 3.389
    },
    {
        "text": "Now, because of the linearity, this area of the original square ",
        "start": 758.9,
        "duration": 3.721
    },
    {
        "text": "can cleanly factor out of all of that, and it ends up on the left.",
        "start": 762.621,
        "duration": 3.839
    },
    {
        "text": "This isn't the exact average that we're looking for, ",
        "start": 767.2,
        "duration": 2.5
    },
    {
        "text": "it's just an empirical mean of a sample of rotations.",
        "start": 769.7,
        "duration": 2.5
    },
    {
        "text": "But in principle what we're looking for is what this ",
        "start": 772.2,
        "duration": 2.621
    },
    {
        "text": "approaches as the size of our sample approaches infinity.",
        "start": 774.821,
        "duration": 2.819
    },
    {
        "text": "And all the parts that depend on the size of the ",
        "start": 777.98,
        "duration": 2.637
    },
    {
        "text": "sample sit cleanly away from the area itself.",
        "start": 780.617,
        "duration": 2.423
    },
    {
        "text": "So whatever this approaches in the limit, it's just going to be some number.",
        "start": 783.58,
        "duration": 2.88
    },
    {
        "text": "It might be a royal pain to compute, we're not sure about that yet, ",
        "start": 786.82,
        "duration": 3.02
    },
    {
        "text": "but the thing that Alice notes is that it's independent of the size ",
        "start": 789.84,
        "duration": 3.021
    },
    {
        "text": "and the shape of the particular 2D thing that we're looking at.",
        "start": 792.861,
        "duration": 2.799
    },
    {
        "text": "It's a universal proportionality constant.",
        "start": 795.72,
        "duration": 2.28
    },
    {
        "text": "And her hope is that that universality somehow lends ",
        "start": 798.46,
        "duration": 3.18
    },
    {
        "text": "itself to a more elegant way to deduce what it must be.",
        "start": 801.64,
        "duration": 3.3
    },
    {
        "text": "Now Bob would be eager to compute this constant here and now, ",
        "start": 806.26,
        "duration": 3.022
    },
    {
        "text": "and in a few minutes I'll show you how he does it.",
        "start": 809.282,
        "duration": 2.438
    },
    {
        "text": "But before that I do want to stay in Alice's world for a little bit more, ",
        "start": 812.04,
        "duration": 2.866
    },
    {
        "text": "because this is where things start to really get fun.",
        "start": 814.906,
        "duration": 2.054
    },
    {
        "text": "In her desire to understand the overall structure of the question ",
        "start": 820.08,
        "duration": 3.547
    },
    {
        "text": "before diving into the details, she's curious now about how the area ",
        "start": 823.627,
        "duration": 3.71
    },
    {
        "text": "of the shadow of the cube relates to the area of its individual faces.",
        "start": 827.337,
        "duration": 3.763
    },
    {
        "text": "Now if we can say something about the average area of a particular face, ",
        "start": 831.62,
        "duration": 3.39
    },
    {
        "text": "does that tell us anything about the average area of the cube as a whole?",
        "start": 835.01,
        "duration": 3.39
    },
    {
        "text": "For example, a simple thing we could say is that that area is ",
        "start": 839.1,
        "duration": 3.122
    },
    {
        "text": "definitely less than the sum of the areas across all the faces, ",
        "start": 842.222,
        "duration": 3.223
    },
    {
        "text": "because there's a meaningful amount of overlap between those shadows.",
        "start": 845.445,
        "duration": 3.475
    },
    {
        "text": "But it's not entirely clear how to think about that overlap, ",
        "start": 849.64,
        "duration": 3.099
    },
    {
        "text": "because if we focus our attention just on two particular faces, ",
        "start": 852.739,
        "duration": 3.252
    },
    {
        "text": "in some orientations they don't overlap at all.",
        "start": 855.991,
        "duration": 2.389
    },
    {
        "text": "But in other orientations they do have some overlap, ",
        "start": 858.46,
        "duration": 2.629
    },
    {
        "text": "and the specific shape and area of that overlap seems a little bit tricky to think about, ",
        "start": 861.089,
        "duration": 4.464
    },
    {
        "text": "much less how on Earth we would average that across all of the different orientations.",
        "start": 865.553,
        "duration": 4.267
    },
    {
        "text": "But Alice has about three clever insights through this whole problem, ",
        "start": 870.66,
        "duration": 3.23
    },
    {
        "text": "and this is the first one of them.",
        "start": 873.89,
        "duration": 1.57
    },
    {
        "text": "She says, actually, if we think about the whole cube, not just a pair of faces, ",
        "start": 875.88,
        "duration": 4.708
    },
    {
        "text": "we can conclude that the area of the shadow for a given orientation ",
        "start": 880.588,
        "duration": 4.002
    },
    {
        "text": "is exactly one half the sum of the areas of all of the faces.",
        "start": 884.59,
        "duration": 3.59
    },
    {
        "text": "Intuitively you can maybe guess that half of them are bathed in the ",
        "start": 889.58,
        "duration": 2.932
    },
    {
        "text": "light and half of them are not, but here's the way that she justifies it.",
        "start": 892.512,
        "duration": 3.148
    },
    {
        "text": "She says for a particular ray of light that would go from the sky and eventually ",
        "start": 895.82,
        "duration": 4.492
    },
    {
        "text": "hit a point in the shadow, that ray passes through the cube at exactly two points.",
        "start": 900.312,
        "duration": 4.548
    },
    {
        "text": "There's one moment when it enters and one moment when it exits.",
        "start": 905.12,
        "duration": 2.48
    },
    {
        "text": "So every point in that shadow corresponds to exactly two faces above it.",
        "start": 907.6,
        "duration": 6.18
    },
    {
        "text": "Well, okay, that's not exactly true if that beam of light ",
        "start": 914.46,
        "duration": 2.465
    },
    {
        "text": "happened to go through the edge of one of the squares.",
        "start": 916.925,
        "duration": 2.295
    },
    {
        "text": "There's a little bit of ambiguity on how many faces it's passing.",
        "start": 919.6,
        "duration": 2.72
    },
    {
        "text": "But those account for zero area inside the shadow, ",
        "start": 922.72,
        "duration": 2.441
    },
    {
        "text": "so we're safe to ignore them if the thing we're trying to do is compute the area.",
        "start": 925.161,
        "duration": 3.879
    },
    {
        "text": "If Alice is pressed and she needs to justify why exactly this is true, ",
        "start": 931.02,
        "duration": 3.823
    },
    {
        "text": "which is important for understanding how the problem might generalize, ",
        "start": 934.843,
        "duration": 3.823
    },
    {
        "text": "she can appeal to the idea of convexity.",
        "start": 938.666,
        "duration": 2.154
    },
    {
        "text": "Convexity is one of those properties where a lot of us have an intuitive sense for ",
        "start": 941.42,
        "duration": 3.495
    },
    {
        "text": "what it should mean, you know, it's shapes that just bulge out, they never dent inward.",
        "start": 944.915,
        "duration": 3.665
    },
    {
        "text": "But mathematicians have a pretty clever way of ",
        "start": 949.14,
        "duration": 1.919
    },
    {
        "text": "formalizing it that's helpful for actual proofs.",
        "start": 951.059,
        "duration": 1.961
    },
    {
        "text": "They say that a set is convex if the line that connects any two ",
        "start": 953.68,
        "duration": 3.898
    },
    {
        "text": "points inside that set is entirely contained within the set itself.",
        "start": 957.578,
        "duration": 4.082
    },
    {
        "text": "So, a square is convex because no matter where you put two points inside that square, ",
        "start": 961.66,
        "duration": 4.556
    },
    {
        "text": "the line connecting them is entirely contained inside the square.",
        "start": 966.216,
        "duration": 3.444
    },
    {
        "text": "But something like the symbol pi is not convex, ",
        "start": 970.28,
        "duration": 2.442
    },
    {
        "text": "I can easily find two different points so that the line connecting them has to ",
        "start": 972.722,
        "duration": 4.02
    },
    {
        "text": "peak outside of the set itself.",
        "start": 976.742,
        "duration": 1.578
    },
    {
        "text": "None of the letters in the word convex are themselves convex.",
        "start": 978.94,
        "duration": 3.66
    },
    {
        "text": "You can find two points so that the line connecting them has to pass outside of the set.",
        "start": 982.7,
        "duration": 4.32
    },
    {
        "text": "It's a really clever way to formalize this idea of a shape that only bulges out.",
        "start": 987.46,
        "duration": 3.96
    },
    {
        "text": "Because anytime that it dents inward, you can find these counterexample lines.",
        "start": 991.42,
        "duration": 4.12
    },
    {
        "text": "Or, our cube, because it's convex, between the first point of entry and the last ",
        "start": 996.1,
        "duration": 4.512
    },
    {
        "text": "point of exit, it has to stay entirely inside the cube by definition of convexity.",
        "start": 1000.612,
        "duration": 4.568
    },
    {
        "text": "But if we were dealing with some other non-convex shape, like a donut, ",
        "start": 1005.74,
        "duration": 3.362
    },
    {
        "text": "you could find a ray of light that enters, then exits, then enters, ",
        "start": 1009.102,
        "duration": 3.221
    },
    {
        "text": "then exits again, so you wouldn't have a clean two-to-one cover from the shadows.",
        "start": 1012.323,
        "duration": 3.837
    },
    {
        "text": "The shadows of all of its different parts, if you were to cover this in a bunch of faces, ",
        "start": 1016.6,
        "duration": 4.4
    },
    {
        "text": "would not be precisely two times the area of the shadow itself.",
        "start": 1021.0,
        "duration": 3.079
    },
    {
        "text": "So, that's the first key insight, the face shadows double cover the cube shadow.",
        "start": 1024.76,
        "duration": 3.5
    },
    {
        "text": "And the next one is a little bit more symbolic, ",
        "start": 1028.88,
        "duration": 1.995
    },
    {
        "text": "so let's start things off by abbreviating our notation a little to ",
        "start": 1030.875,
        "duration": 2.787
    },
    {
        "text": "make room on the screen.",
        "start": 1033.662,
        "duration": 0.998
    },
    {
        "text": "Instead of writing the area of the shadow of the cube, ",
        "start": 1035.359,
        "duration": 2.555
    },
    {
        "text": "I'm just going to write s of the cube.",
        "start": 1037.914,
        "duration": 1.766
    },
    {
        "text": "And similarly, instead of the area of the shadow of a particular face, ",
        "start": 1040.319,
        "duration": 3.486
    },
    {
        "text": "I'm just going to write s of f, where that subscript j indicates which face I'm ",
        "start": 1043.805,
        "duration": 3.927
    },
    {
        "text": "talking about.",
        "start": 1047.732,
        "duration": 0.688
    },
    {
        "text": "But of course, we should really be talking about the ",
        "start": 1048.42,
        "duration": 2.624
    },
    {
        "text": "shadow of a particular rotation applied to the cube.",
        "start": 1051.044,
        "duration": 2.576
    },
    {
        "text": "So I might write this as s of some rotation applied to the cube, ",
        "start": 1054.1,
        "duration": 3.344
    },
    {
        "text": "and likewise on the right, it's the area of the shadow of that same rotation applied to ",
        "start": 1057.444,
        "duration": 4.529
    },
    {
        "text": "a given one of the faces.",
        "start": 1061.973,
        "duration": 1.287
    },
    {
        "text": "With the more compact notation at hand, let's think about the average of this ",
        "start": 1063.76,
        "duration": 4.845
    },
    {
        "text": "shadow area across many different rotations, some sample of r1, r2, r3, and so on.",
        "start": 1068.605,
        "duration": 5.095
    },
    {
        "text": "Again, that average just involves adding up all ",
        "start": 1074.12,
        "duration": 2.497
    },
    {
        "text": "of those shadow areas and then dividing them by n.",
        "start": 1076.617,
        "duration": 2.603
    },
    {
        "text": "And in principle, if we were to look at this for larger and larger samples, ",
        "start": 1079.94,
        "duration": 3.459
    },
    {
        "text": "let n approach infinity, that would give us the average area of the shadow of the cube.",
        "start": 1083.399,
        "duration": 3.961
    },
    {
        "text": "Some of you might be thinking, yes, we know this, you've said this already, ",
        "start": 1088.26,
        "duration": 3.692
    },
    {
        "text": "but it's beneficial to write it out so that we can understand why it is that ",
        "start": 1091.952,
        "duration": 3.742
    },
    {
        "text": "expressing the shadow area for a particular rotation of the cube as a sum across ",
        "start": 1095.694,
        "duration": 3.936
    },
    {
        "text": "all of its faces, or one half times that sum at least, why is that beneficial?",
        "start": 1099.63,
        "duration": 3.79
    },
    {
        "text": "What is it going to do for us?",
        "start": 1103.6,
        "duration": 1.16
    },
    {
        "text": "Well, let's just write it out, where for each one of these rotations of the cube, ",
        "start": 1105.56,
        "duration": 3.778
    },
    {
        "text": "we could break down that shadow as a sum across that same ",
        "start": 1109.338,
        "duration": 2.672
    },
    {
        "text": "rotation applied across all of the faces.",
        "start": 1112.01,
        "duration": 1.89
    },
    {
        "text": "And when it's written as a grid like this, we can get to Alice's second insight, ",
        "start": 1114.54,
        "duration": 3.774
    },
    {
        "text": "which is to shift the way that we're thinking about the sum from ",
        "start": 1118.314,
        "duration": 3.029
    },
    {
        "text": "going row by row to instead going column by column.",
        "start": 1121.343,
        "duration": 2.377
    },
    {
        "text": "For example, if we focused our attention just on the first column, ",
        "start": 1125.84,
        "duration": 3.497
    },
    {
        "text": "what it's telling us is to add up the area of the shadow of the first face across many ",
        "start": 1129.337,
        "duration": 4.542
    },
    {
        "text": "different orientations.",
        "start": 1133.879,
        "duration": 1.201
    },
    {
        "text": "So if we were to take that sum and divide it by the size of our sample, ",
        "start": 1135.64,
        "duration": 3.575
    },
    {
        "text": "that gives us an empirical average for the area of the shadow of this face.",
        "start": 1139.215,
        "duration": 3.725
    },
    {
        "text": "So if we take larger and larger samples, letting that size go to infinity, ",
        "start": 1143.8,
        "duration": 3.687
    },
    {
        "text": "this will approach the average shadow area for a square.",
        "start": 1147.487,
        "duration": 2.753
    },
    {
        "text": "Likewise, the second column can be thought of as telling us the average area ",
        "start": 1152.12,
        "duration": 3.88
    },
    {
        "text": "for the second face of the cube, which should of course be the same number.",
        "start": 1156.0,
        "duration": 3.78
    },
    {
        "text": "And same deal for any other column, it's telling ",
        "start": 1160.44,
        "duration": 2.11
    },
    {
        "text": "us the average area for a particular face.",
        "start": 1162.55,
        "duration": 1.81
    },
    {
        "text": "So that gives us a very different way of thinking about our whole expression.",
        "start": 1164.98,
        "duration": 3.06
    },
    {
        "text": "Instead of saying add up the areas of the cubes at all the different orientations, ",
        "start": 1168.38,
        "duration": 4.031
    },
    {
        "text": "we could say just add up the average shadows for the six different ",
        "start": 1172.411,
        "duration": 3.254
    },
    {
        "text": "faces and divide the total by one half.",
        "start": 1175.665,
        "duration": 1.895
    },
    {
        "text": "The term on the left here is thinking about adding up rows first, ",
        "start": 1178.04,
        "duration": 2.817
    },
    {
        "text": "and the term on the right is thinking about adding up columns first.",
        "start": 1180.857,
        "duration": 2.903
    },
    {
        "text": "In short, the average of the sum of the face shadows is ",
        "start": 1184.68,
        "duration": 3.259
    },
    {
        "text": "the same as the sum of the average of the face shadows.",
        "start": 1187.939,
        "duration": 3.201
    },
    {
        "text": "Maybe that swap seems simple, maybe it doesn't, ",
        "start": 1192.14,
        "duration": 1.95
    },
    {
        "text": "but I can tell you that there is actually a little bit more ",
        "start": 1194.09,
        "duration": 2.439
    },
    {
        "text": "than meets the eye to the step that we just took, but we'll get to that later.",
        "start": 1196.529,
        "duration": 3.171
    },
    {
        "text": "And remember, we know that the average area for a particular face looks ",
        "start": 1200.78,
        "duration": 3.694
    },
    {
        "text": "like some universal proportionality constant times the area of that face.",
        "start": 1204.474,
        "duration": 3.746
    },
    {
        "text": "So if we're adding this up across all the faces of the cube, ",
        "start": 1208.8,
        "duration": 2.692
    },
    {
        "text": "we could think of this as equaling some constant times the surface area of the cube.",
        "start": 1211.492,
        "duration": 3.708
    },
    {
        "text": "And that's pretty interesting.",
        "start": 1215.92,
        "duration": 0.84
    },
    {
        "text": "The average area for the shadow of this cube is ",
        "start": 1216.98,
        "duration": 2.322
    },
    {
        "text": "going to be proportional to its surface area.",
        "start": 1219.302,
        "duration": 2.178
    },
    {
        "text": "But at the same time, you might complain, well Alice is just ",
        "start": 1222.68,
        "duration": 2.769
    },
    {
        "text": "pushing around a bunch of symbols here, because none of this ",
        "start": 1225.449,
        "duration": 2.77
    },
    {
        "text": "matters if we don't know what that proportionality constant is.",
        "start": 1228.219,
        "duration": 2.861
    },
    {
        "text": "I mean, it almost seems obvious.",
        "start": 1231.66,
        "duration": 1.72
    },
    {
        "text": "Like, of course the average shadow area should be proportional to the surface area.",
        "start": 1233.64,
        "duration": 3.98
    },
    {
        "text": "They're both two-dimensional quantities, so they should scale in lockstep with each other.",
        "start": 1237.88,
        "duration": 4.38
    },
    {
        "text": "I mean, it's not obvious.",
        "start": 1243.08,
        "duration": 1.3
    },
    {
        "text": "After all, for a closer light source, it simply wouldn't be true.",
        "start": 1244.64,
        "duration": 2.64
    },
    {
        "text": "And also, this business where we added up the grid column by column ",
        "start": 1248.12,
        "duration": 3.218
    },
    {
        "text": "versus row by row is a little more nuanced than it might look at first.",
        "start": 1251.338,
        "duration": 3.362
    },
    {
        "text": "There's a subtle, hidden assumption underlying all of this, ",
        "start": 1255.22,
        "duration": 3.008
    },
    {
        "text": "which carries a special significance when we choose to revisit the question ",
        "start": 1258.228,
        "duration": 3.81
    },
    {
        "text": "of what probability distribution is being taken across the space of all orientations.",
        "start": 1262.038,
        "duration": 4.262
    },
    {
        "text": "But more than anything, the reason that it's not obvious is that the significance ",
        "start": 1267.3,
        "duration": 4.105
    },
    {
        "text": "of this result right here is not merely that these two values are proportional.",
        "start": 1271.405,
        "duration": 3.955
    },
    {
        "text": "It's that an analogous fact will hold true for any convex solids, ",
        "start": 1276.14,
        "duration": 3.792
    },
    {
        "text": "and, crucially, the actual content of what Alice has built up so far ",
        "start": 1279.932,
        "duration": 3.965
    },
    {
        "text": "is that it'll be the same proportionality constant across all of them.",
        "start": 1283.897,
        "duration": 4.023
    },
    {
        "text": "Now if you really mull over that, some of you may be able to ",
        "start": 1289.28,
        "duration": 2.353
    },
    {
        "text": "predict the way that Alice is able to finish things off from here.",
        "start": 1291.633,
        "duration": 2.547
    },
    {
        "text": "It's really delightful, it's honestly my main reason for covering this topic.",
        "start": 1294.18,
        "duration": 3.76
    },
    {
        "text": "But before we get into it, I think it's easy to underappreciate her result ",
        "start": 1298.24,
        "duration": 4.058
    },
    {
        "text": "unless we dig into the details of what it is that she manages to avoid.",
        "start": 1302.298,
        "duration": 3.842
    },
    {
        "text": "So let's take a moment to turn our attention back into Bob's world, ",
        "start": 1306.86,
        "duration": 3.307
    },
    {
        "text": "because while Alice has been doing all of this, he's been busy doing some computations.",
        "start": 1310.167,
        "duration": 4.233
    },
    {
        "text": "In fact, what he's been working on is finding exactly what Alice has yet to figure out, ",
        "start": 1314.98,
        "duration": 4.459
    },
    {
        "text": "which is how to take the formula that he found for the area of a square's ",
        "start": 1319.439,
        "duration": 3.75
    },
    {
        "text": "shadow and taking the natural next step of trying to find the average of ",
        "start": 1323.189,
        "duration": 3.699
    },
    {
        "text": "that square's shadow averaged over all possible orientations.",
        "start": 1326.888,
        "duration": 3.092
    },
    {
        "text": "So the way Bob starts, if he's thinking about all the different possible ",
        "start": 1334.62,
        "duration": 3.313
    },
    {
        "text": "orientations for this square, is to ask, what are all the different ",
        "start": 1337.933,
        "duration": 3.087
    },
    {
        "text": "normal vectors that that square can have in all these orientations, ",
        "start": 1341.02,
        "duration": 3.087
    },
    {
        "text": "because everything about its shadow comes down to that normal vector.",
        "start": 1344.107,
        "duration": 3.133
    },
    {
        "text": "It's not too hard to see that all those possible normal vectors trace out the surface ",
        "start": 1347.8,
        "duration": 3.996
    },
    {
        "text": "of a sphere, if we assume it's a unit normal vector, it's a sphere with radius 1.",
        "start": 1351.796,
        "duration": 3.764
    },
    {
        "text": "And furthermore, Bob figures that each point of this ",
        "start": 1356.42,
        "duration": 2.555
    },
    {
        "text": "sphere should be just as likely to occur as any other.",
        "start": 1358.975,
        "duration": 2.605
    },
    {
        "text": "Our probabilities should be uniform in that way, ",
        "start": 1362.0,
        "duration": 2.035
    },
    {
        "text": "there's no reason to prefer one direction over another.",
        "start": 1364.035,
        "duration": 2.285
    },
    {
        "text": "But in the context of continuous probabilities, ",
        "start": 1367.12,
        "duration": 2.182
    },
    {
        "text": "it's not very helpful to talk about the likelihood of a particular individual point, ",
        "start": 1369.302,
        "duration": 3.864
    },
    {
        "text": "because in the uncountable infinity of points on the sphere, ",
        "start": 1373.166,
        "duration": 2.773
    },
    {
        "text": "that would be zero and unhelpful.",
        "start": 1375.939,
        "duration": 1.501
    },
    {
        "text": "So instead, the more precise way to phrase this uniformity would be ",
        "start": 1377.44,
        "duration": 4.0
    },
    {
        "text": "to say the probability that our normal vector lands in any given ",
        "start": 1381.44,
        "duration": 3.823
    },
    {
        "text": "patch of area on the sphere should be proportional to that area itself.",
        "start": 1385.263,
        "duration": 4.177
    },
    {
        "text": "More specifically, it should equal the area of that little ",
        "start": 1389.96,
        "duration": 2.694
    },
    {
        "text": "patch divided by the total surface area of the sphere.",
        "start": 1392.654,
        "duration": 2.466
    },
    {
        "text": "If that's true, no matter what patch of area we're considering, ",
        "start": 1395.68,
        "duration": 2.776
    },
    {
        "text": "that's what we mean by a uniform distribution on the sphere.",
        "start": 1398.456,
        "duration": 2.604
    },
    {
        "text": "Now to be clear, points on the sphere are not the same thing as orientations in 3D space, ",
        "start": 1402.0,
        "duration": 4.145
    },
    {
        "text": "because even if you know what normal vector this square is going to have, ",
        "start": 1406.145,
        "duration": 3.408
    },
    {
        "text": "that leaves us with another degree of freedom, ",
        "start": 1409.553,
        "duration": 2.165
    },
    {
        "text": "the square could be rotated about that normal vector.",
        "start": 1411.718,
        "duration": 2.442
    },
    {
        "text": "But Bob doesn't actually have to care about that extra degree of freedom, ",
        "start": 1414.96,
        "duration": 3.668
    },
    {
        "text": "because in all of those cases, the area of the shadow is the same, ",
        "start": 1418.628,
        "duration": 3.321
    },
    {
        "text": "it's only dependent on the cosine of the angle between that normal vector and ",
        "start": 1421.949,
        "duration": 3.866
    },
    {
        "text": "the vertical.",
        "start": 1425.815,
        "duration": 0.645
    },
    {
        "text": "Which is kind of neat, all those shadows are genuinely different shapes, ",
        "start": 1427.18,
        "duration": 3.292
    },
    {
        "text": "they're not the same, but the area of each of them will be the same.",
        "start": 1430.472,
        "duration": 3.068
    },
    {
        "text": "What this means is that when Bob wants this average shadow area over ",
        "start": 1434.72,
        "duration": 3.455
    },
    {
        "text": "all possible orientations, all he really needs to know is the average ",
        "start": 1438.175,
        "duration": 3.505
    },
    {
        "text": "value of this absolute value of cosine of theta for all different ",
        "start": 1441.68,
        "duration": 3.304
    },
    {
        "text": "possible normal vectors, all different possible points on the sphere.",
        "start": 1444.984,
        "duration": 3.456
    },
    {
        "text": "So, how do you compute an average like this?",
        "start": 1449.12,
        "duration": 2.2
    },
    {
        "text": "Well, if we lived in some kind of discrete pixelated world, ",
        "start": 1452.54,
        "duration": 2.67
    },
    {
        "text": "where there's only a finite number of possible angles theta that ",
        "start": 1455.21,
        "duration": 2.892
    },
    {
        "text": "that normal vector could have, the average would be pretty straightforward.",
        "start": 1458.102,
        "duration": 3.338
    },
    {
        "text": "What you do is find the probability of landing on any particular value of theta, ",
        "start": 1461.44,
        "duration": 4.036
    },
    {
        "text": "which will tell us something like how much of the sphere do normal vectors ",
        "start": 1465.476,
        "duration": 3.737
    },
    {
        "text": "with that angle make up, and then you multiply it by the thing we want ",
        "start": 1469.213,
        "duration": 3.537
    },
    {
        "text": "to take the average of, this formula for the area of the shadow.",
        "start": 1472.75,
        "duration": 3.19
    },
    {
        "text": "And then you would add that up over all of the different possible values of theta, ",
        "start": 1476.86,
        "duration": 4.536
    },
    {
        "text": "ranging from 0 up to 180 degrees, or pi radians.",
        "start": 1481.396,
        "duration": 2.624
    },
    {
        "text": "But of course, in reality, there is a continuum of possible values of theta, ",
        "start": 1485.06,
        "duration": 4.29
    },
    {
        "text": "this uncountable infinity, and the probability of landing on any ",
        "start": 1489.35,
        "duration": 3.621
    },
    {
        "text": "specific particular value of theta will actually be 0.",
        "start": 1492.971,
        "duration": 3.009
    },
    {
        "text": "And so a sum like this unfortunately doesn't really make any sense, ",
        "start": 1496.68,
        "duration": 3.39
    },
    {
        "text": "or if it does make sense, adding up infinitely many zeros should just give us a 0.",
        "start": 1500.07,
        "duration": 4.09
    },
    {
        "text": "The short answer for what we do instead is that we compute an integral.",
        "start": 1505.8,
        "duration": 3.08
    },
    {
        "text": "And I'll level with you, the hard part here is I'm not entirely sure ",
        "start": 1509.66,
        "duration": 2.702
    },
    {
        "text": "what background I should be assuming from those of you watching right now.",
        "start": 1512.362,
        "duration": 2.898
    },
    {
        "text": "Maybe it's the case that you're quite comfortable with ",
        "start": 1515.64,
        "duration": 2.042
    },
    {
        "text": "calculus and you don't need me to belabor the point here.",
        "start": 1517.682,
        "duration": 2.118
    },
    {
        "text": "Maybe it's the case that you're not familiar with calculus ",
        "start": 1519.8,
        "duration": 2.511
    },
    {
        "text": "and I shouldn't just be throwing down integrals like that.",
        "start": 1522.311,
        "duration": 2.469
    },
    {
        "text": "Or maybe you, you know, you took a calculus class a while ago, ",
        "start": 1524.86,
        "duration": 2.774
    },
    {
        "text": "but you need a little bit of a refresher.",
        "start": 1527.634,
        "duration": 1.806
    },
    {
        "text": "I'm going to go with the option of setting this up as if it's a calculus lesson, ",
        "start": 1529.82,
        "duration": 3.443
    },
    {
        "text": "because to be honest, even when you are quite comfortable with integrals, ",
        "start": 1533.263,
        "duration": 3.145
    },
    {
        "text": "setting them up can be kind of an error-prone process, ",
        "start": 1536.408,
        "duration": 2.338
    },
    {
        "text": "and calling back to the underlying definition is a good way to sort of check ",
        "start": 1538.746,
        "duration": 3.273
    },
    {
        "text": "yourself in the process.",
        "start": 1542.019,
        "duration": 1.021
    },
    {
        "text": "If we lived in a time before calculus existed and integrals weren't a thing, ",
        "start": 1543.78,
        "duration": 4.087
    },
    {
        "text": "and we wanted to approximate an answer to this question, ",
        "start": 1547.867,
        "duration": 3.026
    },
    {
        "text": "one way we could go about it is to take a sample of values for theta that ranges ",
        "start": 1550.893,
        "duration": 4.299
    },
    {
        "text": "from 0 up to 180 degrees.",
        "start": 1555.192,
        "duration": 1.328
    },
    {
        "text": "We might think of them as evenly spaced with some sort of difference between each one, ",
        "start": 1557.18,
        "duration": 4.065
    },
    {
        "text": "some delta theta.",
        "start": 1561.245,
        "duration": 0.795
    },
    {
        "text": "And it's still the case that it would be unhelpful to ask about the probability ",
        "start": 1562.62,
        "duration": 3.507
    },
    {
        "text": "of a particular value of theta occurring, even if it's 1 in our sample.",
        "start": 1566.127,
        "duration": 3.113
    },
    {
        "text": "That probability would still be 0 and it would be unhelpful.",
        "start": 1569.66,
        "duration": 2.7
    },
    {
        "text": "But what is helpful to ask is the probability of falling between two different ",
        "start": 1572.36,
        "duration": 4.681
    },
    {
        "text": "values from our sample, in this little band of latitude with a width of delta theta.",
        "start": 1577.041,
        "duration": 4.979
    },
    {
        "text": "Based on our assumption that the distribution along this sphere should be uniform, ",
        "start": 1582.4,
        "duration": 4.126
    },
    {
        "text": "that probability comes down to knowing the area of this band.",
        "start": 1586.526,
        "duration": 3.034
    },
    {
        "text": "More specifically, the chances that a randomly chosen vector lands in that ",
        "start": 1590.02,
        "duration": 3.395
    },
    {
        "text": "band should be that area divided by the total surface area of the sphere.",
        "start": 1593.415,
        "duration": 3.305
    },
    {
        "text": "To figure out that area, let's first think of the radius of that band, which, ",
        "start": 1596.72,
        "duration": 4.363
    },
    {
        "text": "if the radius of our sphere is 1, is definitely going to be smaller than 1.",
        "start": 1601.083,
        "duration": 4.197
    },
    {
        "text": "And in fact, if we draw the appropriate little right triangle here, ",
        "start": 1605.9,
        "duration": 3.096
    },
    {
        "text": "you can see that that little radius, let's just say at the top of the band, ",
        "start": 1608.996,
        "duration": 3.461
    },
    {
        "text": "should be the sine of our angle, the sine of theta.",
        "start": 1612.457,
        "duration": 2.323
    },
    {
        "text": "This means that the circumference of the band should be 2 pi times ",
        "start": 1615.52,
        "duration": 3.435
    },
    {
        "text": "the sine of that angle, and then the area of the band should be ",
        "start": 1618.955,
        "duration": 3.282
    },
    {
        "text": "that circumference times its thickness, that little delta theta.",
        "start": 1622.237,
        "duration": 3.283
    },
    {
        "text": "Or rather, the area of our band is approximately this quantity.",
        "start": 1625.52,
        "duration": 3.56
    },
    {
        "text": "What's important is that for a finer sample of many more values of theta, ",
        "start": 1629.54,
        "duration": 3.662
    },
    {
        "text": "the accuracy of that approximation would get better and better.",
        "start": 1633.202,
        "duration": 3.118
    },
    {
        "text": "Now remember, the reason we wanted this area is to know the probability ",
        "start": 1637.54,
        "duration": 3.596
    },
    {
        "text": "of falling into that band, which is this area divided by the surface area of the sphere, ",
        "start": 1641.136,
        "duration": 4.446
    },
    {
        "text": "which we know to be 4 pi times its radius squared.",
        "start": 1645.582,
        "duration": 2.498
    },
    {
        "text": "That's a value that you could also compute with an integral similar to the one that we're ",
        "start": 1648.66,
        "duration": 3.751
    },
    {
        "text": "setting up now, but for now we can take it as a given, as a standard well-known formula.",
        "start": 1652.411,
        "duration": 3.669
    },
    {
        "text": "And this probability itself is just a stepping stone in the direction of ",
        "start": 1656.84,
        "duration": 3.174
    },
    {
        "text": "what we actually want, which is the average area for the shadow of a square.",
        "start": 1660.014,
        "duration": 3.306
    },
    {
        "text": "To get that, we'll multiply this probability times the corresponding shadow area, ",
        "start": 1664.24,
        "duration": 4.067
    },
    {
        "text": "which is this absolute value of cosine theta expression we've seen many times up to this ",
        "start": 1668.307,
        "duration": 4.415
    },
    {
        "text": "point.",
        "start": 1672.722,
        "duration": 0.298
    },
    {
        "text": "And our estimate for this average would now come down to adding up this expression ",
        "start": 1673.5,
        "duration": 3.934
    },
    {
        "text": "across all of the different bands, all of the different samples of theta that we've taken.",
        "start": 1677.434,
        "duration": 4.266
    },
    {
        "text": "This right here, by the way, is when Bob is just totally in his element.",
        "start": 1683.44,
        "duration": 2.92
    },
    {
        "text": "We've got a lot of exact formulas describing something very concrete, ",
        "start": 1686.58,
        "duration": 3.132
    },
    {
        "text": "actually digging in on our way to a real answer.",
        "start": 1689.712,
        "duration": 2.148
    },
    {
        "text": "And again, if it feels like a lot of detail, I want you to appreciate that fact, ",
        "start": 1692.52,
        "duration": 4.253
    },
    {
        "text": "so that you can appreciate just how magical it is when Alice manages to somehow avoid all ",
        "start": 1696.773,
        "duration": 4.726
    },
    {
        "text": "of this.",
        "start": 1701.499,
        "duration": 0.421
    },
    {
        "text": "Anyway, looking back at our expression, let's clean things up a little bit, ",
        "start": 1702.88,
        "duration": 3.185
    },
    {
        "text": "like factoring out all of the terms that don't depend on theta itself.",
        "start": 1706.065,
        "duration": 2.935
    },
    {
        "text": "And we can simplify that 2 pi divided by 4 pi to simply be 1 half.",
        "start": 1709.72,
        "duration": 3.76
    },
    {
        "text": "And to make it a little more analogous to calculus, ",
        "start": 1714.54,
        "duration": 2.132
    },
    {
        "text": "with integrals, let me just swap the main terms inside the sum here.",
        "start": 1716.672,
        "duration": 2.788
    },
    {
        "text": "What we now have, this sum that's going to approximate the answer to our question, ",
        "start": 1719.96,
        "duration": 4.465
    },
    {
        "text": "is almost what an integral is.",
        "start": 1724.425,
        "duration": 1.615
    },
    {
        "text": "Instead of writing the sigma for sum, we write the integral symbol, ",
        "start": 1726.48,
        "duration": 3.493
    },
    {
        "text": "this kind of elongated Leibnizian s, showing us that we're going from 0 to pi.",
        "start": 1729.973,
        "duration": 4.007
    },
    {
        "text": "And instead of describing the step size as delta theta, ",
        "start": 1734.72,
        "duration": 2.88
    },
    {
        "text": "a concrete finite amount, we instead describe it as d theta, ",
        "start": 1737.6,
        "duration": 3.137
    },
    {
        "text": "which I like to think of as signaling the fact that some kind of limit is being taken.",
        "start": 1740.737,
        "duration": 4.423
    },
    {
        "text": "What that integral means, by definition, is whatever the ",
        "start": 1746.08,
        "duration": 3.592
    },
    {
        "text": "sum on the bottom approaches for finer and finer subdivisions.",
        "start": 1749.672,
        "duration": 3.908
    },
    {
        "text": "More dense samples that we might take for theta itself.",
        "start": 1753.58,
        "duration": 3.52
    },
    {
        "text": "And at this point, for those of you who do know calculus, ",
        "start": 1759.04,
        "duration": 2.389
    },
    {
        "text": "I'll just write down the details of how you would actually carry this out, ",
        "start": 1761.429,
        "duration": 3.09
    },
    {
        "text": "as you might see it written down in Bob's notebook.",
        "start": 1764.519,
        "duration": 2.101
    },
    {
        "text": "It's the usual anti-derivative stuff, but the one ",
        "start": 1767.16,
        "duration": 2.551
    },
    {
        "text": "key step is to bring in a certain trig identity.",
        "start": 1769.711,
        "duration": 2.449
    },
    {
        "text": "In the end, what Bob finds after doing this is the surprisingly clean fact that ",
        "start": 1773.06,
        "duration": 5.071
    },
    {
        "text": "the average area for a square's shadow is precisely one half the area of that square.",
        "start": 1778.131,
        "duration": 5.389
    },
    {
        "text": "This is the mystery constant, which Alice doesn't yet know.",
        "start": 1784.58,
        "duration": 2.98
    },
    {
        "text": "If Bob were to look over her shoulder and see the work that she's done, ",
        "start": 1788.12,
        "duration": 2.943
    },
    {
        "text": "he could finish out the problem right now.",
        "start": 1791.063,
        "duration": 1.717
    },
    {
        "text": "He plugs in the constant that he just found, and he knows the final answer.",
        "start": 1793.0,
        "duration": 3.16
    },
    {
        "text": "And now, finally, with all of this as backdrop, ",
        "start": 1800.22,
        "duration": 2.682
    },
    {
        "text": "what is it that Alice does to carry out the final solution?",
        "start": 1802.902,
        "duration": 3.298
    },
    {
        "text": "I introduced her as someone who really likes to generalize the results she finds.",
        "start": 1806.86,
        "duration": 3.4
    },
    {
        "text": "And usually those generalizations end up as interesting footnotes ",
        "start": 1810.84,
        "duration": 3.059
    },
    {
        "text": "that aren't really material for solving particular problems.",
        "start": 1813.899,
        "duration": 2.781
    },
    {
        "text": "But this is a case where the generalization itself draws her to a quantitative result.",
        "start": 1817.18,
        "duration": 4.58
    },
    {
        "text": "Remember, the substance of what she's found so far is that if you look at any convex ",
        "start": 1821.76,
        "duration": 4.763
    },
    {
        "text": "solid, then the average area for its shadow is going to be proportional to its surface ",
        "start": 1826.523,
        "duration": 4.876
    },
    {
        "text": "area.",
        "start": 1831.399,
        "duration": 0.281
    },
    {
        "text": "And critically, it'll be the same proportionality constant across all of these solids.",
        "start": 1832.18,
        "duration": 4.32
    },
    {
        "text": "So all Alice needs to do is find just a single convex solid ",
        "start": 1837.1,
        "duration": 3.532
    },
    {
        "text": "out there where she already knows the average area of its shadow.",
        "start": 1840.632,
        "duration": 3.828
    },
    {
        "text": "And some of you may see where this is going.",
        "start": 1845.16,
        "duration": 1.68
    },
    {
        "text": "The most symmetric solid available to us is a sphere.",
        "start": 1846.84,
        "duration": 3.22
    },
    {
        "text": "No matter what the orientation of that sphere, its shadow, ",
        "start": 1850.52,
        "duration": 3.277
    },
    {
        "text": "the flat projection shadow, is always a circle with an area of pi r squared.",
        "start": 1853.797,
        "duration": 4.223
    },
    {
        "text": "So in particular, that's its average shadow area.",
        "start": 1858.62,
        "duration": 2.42
    },
    {
        "text": "And the surface area of a sphere, like I mentioned before, is exactly 4 pi r squared.",
        "start": 1861.78,
        "duration": 4.54
    },
    {
        "text": "By the way, I did make a video talking all about that surface ",
        "start": 1867.1,
        "duration": 3.063
    },
    {
        "text": "area formula and how Archimedes proved it thousands of years before calculus existed, ",
        "start": 1870.163,
        "duration": 4.249
    },
    {
        "text": "so you don't need integrals to find it.",
        "start": 1874.412,
        "duration": 1.928
    },
    {
        "text": "The magic of what Alice has done is that she can take this seemingly specific ",
        "start": 1876.34,
        "duration": 4.228
    },
    {
        "text": "fact that the shadow of a sphere has an area exactly 1 fourth its surface area ",
        "start": 1880.568,
        "duration": 4.283
    },
    {
        "text": "and use it to conclude a much more general fact that for any convex solid out there, ",
        "start": 1884.851,
        "duration": 4.608
    },
    {
        "text": "its shadow and surface area are related in the same way, in a certain sense.",
        "start": 1889.459,
        "duration": 4.121
    },
    {
        "text": "So with that, she can go and fill in the details of the particular question about a cube ",
        "start": 1894.64,
        "duration": 4.464
    },
    {
        "text": "and say that its average shadow area will be 1 fourth times its surface area, 6 s squared.",
        "start": 1899.104,
        "duration": 4.516
    },
    {
        "text": "But the much more memorable fact that you'll go to sleep thinking about ",
        "start": 1903.62,
        "duration": 3.59
    },
    {
        "text": "is how it didn't really matter that we were talking about a cube at all.",
        "start": 1907.21,
        "duration": 3.59
    },
    {
        "text": "Now, that's all very pretty, but some of you might complain that this ",
        "start": 1912.52,
        "duration": 3.479
    },
    {
        "text": "isn't really a valid argument because spheres don't have flat faces.",
        "start": 1915.999,
        "duration": 3.381
    },
    {
        "text": "When I said Alice's argument generalizes to any convex solid, ",
        "start": 1920.1,
        "duration": 3.186
    },
    {
        "text": "if we actually look at the argument itself, it definitely depends on the use of a finite ",
        "start": 1923.286,
        "duration": 4.574
    },
    {
        "text": "number of flat faces.",
        "start": 1927.86,
        "duration": 1.08
    },
    {
        "text": "For example, if we were mapping it to a dodecahedron, ",
        "start": 1928.94,
        "duration": 2.784
    },
    {
        "text": "you would start by saying that the area of a particular shadow of that ",
        "start": 1931.724,
        "duration": 3.662
    },
    {
        "text": "dodecahedron looks like exactly 1 half times the sum of the areas of the ",
        "start": 1935.386,
        "duration": 3.764
    },
    {
        "text": "shadows of all its faces.",
        "start": 1939.15,
        "duration": 1.29
    },
    {
        "text": "Once again, you could use a certain ray of light ",
        "start": 1941.0,
        "duration": 2.112
    },
    {
        "text": "mixed with convexity argument to draw that conclusion.",
        "start": 1943.112,
        "duration": 2.328
    },
    {
        "text": "And remember, the benefit of expressing that shadow area as a sum is that when we want to ",
        "start": 1946.28,
        "duration": 4.846
    },
    {
        "text": "average over a bunch of different rotations, we can describe that sum as a big grid where ",
        "start": 1951.126,
        "duration": 4.847
    },
    {
        "text": "we can then go column by column and consider the average area for the shadow of each face.",
        "start": 1955.973,
        "duration": 4.847
    },
    {
        "text": "And also, a critical fact was the conclusion from much earlier that ",
        "start": 1961.46,
        "duration": 3.646
    },
    {
        "text": "the average shadow for any 2D object, a flat 2D object, which is important, ",
        "start": 1965.106,
        "duration": 4.075
    },
    {
        "text": "will equal some universal proportionality constant times its area.",
        "start": 1969.181,
        "duration": 3.539
    },
    {
        "text": "The significance was that that constant didn't depend on the shape itself.",
        "start": 1973.26,
        "duration": 2.86
    },
    {
        "text": "It could have been a square, or a cat, or the pentagonal faces of our dodecahedron, ",
        "start": 1976.22,
        "duration": 4.172
    },
    {
        "text": "whatever.",
        "start": 1980.392,
        "duration": 0.448
    },
    {
        "text": "Though, after hastily carrying this over to a sphere that doesn't ",
        "start": 1980.84,
        "duration": 3.682
    },
    {
        "text": "have a finite number of flat faces, you would be right to complain.",
        "start": 1984.522,
        "duration": 3.738
    },
    {
        "text": "But luckily, it's a pretty easy detail to fill in.",
        "start": 1988.9,
        "duration": 2.34
    },
    {
        "text": "What you can do is imagine a sequence of different polyhedra that ",
        "start": 1991.64,
        "duration": 3.205
    },
    {
        "text": "successively approximate a sphere, in the sense that their faces ",
        "start": 1994.845,
        "duration": 3.157
    },
    {
        "text": "hug tighter and tighter around the genuine surface of the sphere.",
        "start": 1998.002,
        "duration": 3.158
    },
    {
        "text": "For each one of those approximations, we can draw the same conclusion, ",
        "start": 2001.68,
        "duration": 3.436
    },
    {
        "text": "that its average shadow is going to be proportional to its ",
        "start": 2005.116,
        "duration": 2.856
    },
    {
        "text": "surface area with this universal proportionality constant.",
        "start": 2007.972,
        "duration": 2.808
    },
    {
        "text": "So then, if we say, okay, let's take the limit of the ratio between ",
        "start": 2011.2,
        "duration": 3.306
    },
    {
        "text": "the average shadow area at each step and the surface area at each step, ",
        "start": 2014.506,
        "duration": 3.501
    },
    {
        "text": "well, since that ratio is never changing, it's always equal to this constant, ",
        "start": 2018.007,
        "duration": 3.792
    },
    {
        "text": "then in the limit, it's also going to equal that constant.",
        "start": 2021.799,
        "duration": 2.821
    },
    {
        "text": "But on the other hand, by their definition, in the limit, ",
        "start": 2024.62,
        "duration": 3.463
    },
    {
        "text": "their average shadow area should be that of a circle, which is πr², ",
        "start": 2028.083,
        "duration": 4.06
    },
    {
        "text": "and the limit of the surface areas would be the surface area of the sphere, 4πr².",
        "start": 2032.143,
        "duration": 4.837
    },
    {
        "text": "So we do genuinely get the conclusion that intuition would suggest, ",
        "start": 2037.66,
        "duration": 3.433
    },
    {
        "text": "but, as is so common with Alice's argument here, ",
        "start": 2041.093,
        "duration": 2.473
    },
    {
        "text": "we do have to be a little delicate in how we justify that intuition.",
        "start": 2043.566,
        "duration": 3.434
    },
    {
        "text": "It's easy for this contrast of Alice and Bob to come across like a value judgment, ",
        "start": 2052.199,
        "duration": 4.512
    },
    {
        "text": "as if I'm saying, look how clever Alice has managed to be, ",
        "start": 2056.711,
        "duration": 3.207
    },
    {
        "text": "she insightfully avoided all those computations that Bob had to do.",
        "start": 2059.918,
        "duration": 3.642
    },
    {
        "text": "But that would be a very, um, misguided conclusion.",
        "start": 2063.88,
        "duration": 4.02
    },
    {
        "text": "I think there's an important way that popularizations ",
        "start": 2068.56,
        "duration": 2.734
    },
    {
        "text": "of math differ from the feeling of actually doing math.",
        "start": 2071.294,
        "duration": 2.786
    },
    {
        "text": "There's this bias towards showing the slick proofs, ",
        "start": 2074.08,
        "duration": 2.58
    },
    {
        "text": "the arguments with some clever keen insight that lets you avoid doing calculations.",
        "start": 2076.66,
        "duration": 4.12
    },
    {
        "text": "I could just be projecting, since I'm very guilty of this, but what I can tell you, ",
        "start": 2081.239,
        "duration": 4.243
    },
    {
        "text": "sitting on the other side of the screen here, is that it feels a lot more ",
        "start": 2085.482,
        "duration": 3.737
    },
    {
        "text": "attractive to make a video about Alice's approach than Bob's.",
        "start": 2089.219,
        "duration": 3.081
    },
    {
        "text": "For one thing, in Alice's approach, the line of reasoning is fun, ",
        "start": 2092.46,
        "duration": 3.203
    },
    {
        "text": "it has these nice aha moments.",
        "start": 2095.663,
        "duration": 1.457
    },
    {
        "text": "But also, crucially, the way that you explain it is more or ",
        "start": 2097.12,
        "duration": 3.28
    },
    {
        "text": "less the same for a very wide range of mathematical backgrounds.",
        "start": 2100.4,
        "duration": 3.5
    },
    {
        "text": "It's much less enticing to do a video about Bob's approach, ",
        "start": 2104.64,
        "duration": 2.892
    },
    {
        "text": "not because the computations are all that bad, I mean, they're honestly not, ",
        "start": 2107.532,
        "duration": 3.711
    },
    {
        "text": "but the pragmatic reality is that the appropriate pace to explain it looks ",
        "start": 2111.243,
        "duration": 3.616
    },
    {
        "text": "very different depending on the different mathematical backgrounds in the audience.",
        "start": 2114.859,
        "duration": 4.001
    },
    {
        "text": "So you, watching this right now, clearly consume math videos online, ",
        "start": 2119.82,
        "duration": 3.637
    },
    {
        "text": "and I think in doing so it's worth being aware of this bias.",
        "start": 2123.457,
        "duration": 3.163
    },
    {
        "text": "If the aim is to have a genuine lesson on problem solving, ",
        "start": 2126.62,
        "duration": 3.585
    },
    {
        "text": "too much focus on the slick proofs runs the risk of being disingenuous.",
        "start": 2130.205,
        "duration": 4.315
    },
    {
        "text": "For example, let's say we were to step up to challenge ",
        "start": 2135.84,
        "duration": 2.477
    },
    {
        "text": "mode here and ask about the case with a closer light source.",
        "start": 2138.317,
        "duration": 2.703
    },
    {
        "text": "To my knowledge, there is not a similarly slick solution to Alice's here, ",
        "start": 2141.7,
        "duration": 3.621
    },
    {
        "text": "where you can just relate to a single shape like a sphere.",
        "start": 2145.321,
        "duration": 2.839
    },
    {
        "text": "The much more productive warmup to have done would ",
        "start": 2148.86,
        "duration": 2.461
    },
    {
        "text": "have been the calculus of Bob's approach.",
        "start": 2151.321,
        "duration": 1.979
    },
    {
        "text": "And if you look at the history of this problem, ",
        "start": 2153.88,
        "duration": 2.72
    },
    {
        "text": "it was proved by Cauchy in 1832, and if we paw through his handwritten notes, ",
        "start": 2156.6,
        "duration": 4.422
    },
    {
        "text": "they look a lot more similar to Bob's work than Alice's work.",
        "start": 2161.022,
        "duration": 3.458
    },
    {
        "text": "Right here at the top of page 11, you can see what is ",
        "start": 2164.9,
        "duration": 2.475
    },
    {
        "text": "essentially the same integral that you and I set up in the middle.",
        "start": 2167.375,
        "duration": 3.025
    },
    {
        "text": "On the other hand, the whole framing of the paper is to find a general fact, ",
        "start": 2171.3,
        "duration": 3.688
    },
    {
        "text": "not something specific like the case of a cube.",
        "start": 2174.988,
        "duration": 2.252
    },
    {
        "text": "So if we were asking the question which of these two mindsets correlates with the act of ",
        "start": 2177.24,
        "duration": 4.579
    },
    {
        "text": "discovering new math, the right answer would almost certainly have to be a blend of both.",
        "start": 2181.819,
        "duration": 4.581
    },
    {
        "text": "But I would suggest that many people don't sign enough weight to ",
        "start": 2187.22,
        "duration": 3.401
    },
    {
        "text": "the part of that blend where you're eager to dive into calculations.",
        "start": 2190.621,
        "duration": 3.559
    },
    {
        "text": "And I think there's some risk that the videos I make might contribute to that.",
        "start": 2194.72,
        "duration": 3.44
    },
    {
        "text": "In the podcast I did with the mathematician Alex Kontorovich, ",
        "start": 2198.96,
        "duration": 3.228
    },
    {
        "text": "he talked about the often underappreciated importance of just drilling on ",
        "start": 2202.188,
        "duration": 3.853
    },
    {
        "text": "computations to build intuition, whether you're a student engaging with a new class, ",
        "start": 2206.041,
        "duration": 4.425
    },
    {
        "text": "or a practicing research mathematician engaging with a new field of study.",
        "start": 2210.466,
        "duration": 3.854
    },
    {
        "text": "A listener actually wrote in to highlight what an impression that particular section made.",
        "start": 2214.8,
        "duration": 4.24
    },
    {
        "text": "They're a PhD student and describe themselves as being worried that their mathematical ",
        "start": 2219.18,
        "duration": 4.205
    },
    {
        "text": "abilities were starting to fade, which they attributed to becoming older and less sharp.",
        "start": 2223.385,
        "duration": 4.255
    },
    {
        "text": "But hearing a practicing mathematician talk about the importance of doing hundreds of ",
        "start": 2227.64,
        "duration": 4.193
    },
    {
        "text": "concrete examples in order to learn something new, ",
        "start": 2231.833,
        "duration": 2.487
    },
    {
        "text": "evidently that changed their perspective.",
        "start": 2234.32,
        "duration": 2.0
    },
    {
        "text": "In their own words, recognizing this completely reshaped their outlook and their results.",
        "start": 2236.9,
        "duration": 4.26
    },
    {
        "text": "And if you look at the famous mathematicians through history, ",
        "start": 2242.02,
        "duration": 2.868
    },
    {
        "text": "you know, Newton, Euler, Gauss, all of them, they all have ",
        "start": 2244.888,
        "duration": 2.73
    },
    {
        "text": "this seemingly infinite patience for doing tedious calculations.",
        "start": 2247.618,
        "duration": 2.962
    },
    {
        "text": "The irony of being biased to show insights that let us avoid calculations ",
        "start": 2250.58,
        "duration": 4.217
    },
    {
        "text": "is that the way people often train up the intuitions to find those ",
        "start": 2254.797,
        "duration": 3.819
    },
    {
        "text": "insights in the first place is by doing piles and piles of calculations.",
        "start": 2258.616,
        "duration": 4.104
    },
    {
        "text": "All that said, something would definitely be missing without the Alice mindset here.",
        "start": 2264.72,
        "duration": 4.7
    },
    {
        "text": "I mean, think about it, how sad would it be if we solved this problem for a ",
        "start": 2269.98,
        "duration": 3.431
    },
    {
        "text": "cube and we never stepped outside of the trees to see the forest and understand ",
        "start": 2273.411,
        "duration": 3.612
    },
    {
        "text": "that this is a super general fact, it applies to a huge family of shapes.",
        "start": 2277.023,
        "duration": 3.297
    },
    {
        "text": "And if you consider that math is not just about answering the questions that are ",
        "start": 2281.14,
        "duration": 4.379
    },
    {
        "text": "posed to you, but about introducing new ideas and constructs, ",
        "start": 2285.519,
        "duration": 3.353
    },
    {
        "text": "one fun side note about Alice's approach here is that it suggests a fun way to quantify ",
        "start": 2288.872,
        "duration": 4.758
    },
    {
        "text": "the idea of convexity.",
        "start": 2293.63,
        "duration": 1.19
    },
    {
        "text": "Rather than just having a yes-no answer, is it convex, is it not, ",
        "start": 2295.36,
        "duration": 3.655
    },
    {
        "text": "we could put a number to it by saying, consider the average area of the shadow ",
        "start": 2299.015,
        "duration": 4.375
    },
    {
        "text": "of some solid, multiply that by four, divide it by the surface area, ",
        "start": 2303.39,
        "duration": 3.821
    },
    {
        "text": "and if that number is one, you've got a convex solid, but if it's less than one, ",
        "start": 2307.211,
        "duration": 4.486
    },
    {
        "text": "it's non-convex, and how close it is to one tells you how close it is to being convex.",
        "start": 2311.697,
        "duration": 4.763
    },
    {
        "text": "Also, one of the nice things about the Alice solution here is that it ",
        "start": 2317.1,
        "duration": 3.807
    },
    {
        "text": "helps explain why it is that mathematicians have what can sometimes ",
        "start": 2320.907,
        "duration": 3.699
    },
    {
        "text": "look like a bizarre infatuation with generality and with abstraction.",
        "start": 2324.606,
        "duration": 3.754
    },
    {
        "text": "The more examples that you see where generalizing and abstracting actually helps ",
        "start": 2328.36,
        "duration": 4.556
    },
    {
        "text": "you to solve a specific case, the more you start to adopt the same infatuation.",
        "start": 2332.916,
        "duration": 4.444
    },
    {
        "text": "And as a final thought for the stalwart viewers among you who've stuck through it ",
        "start": 2339.24,
        "duration": 3.787
    },
    {
        "text": "this far, there is still one unanswered question about the very premise of our puzzle.",
        "start": 2343.027,
        "duration": 3.973
    },
    {
        "text": "What exactly does it mean to choose a random orientation?",
        "start": 2347.76,
        "duration": 3.18
    },
    {
        "text": "Now if that feels like a silly question, like of course we know what it should mean, ",
        "start": 2350.94,
        "duration": 3.854
    },
    {
        "text": "I would encourage you to watch a video that I just did with Numberphile ",
        "start": 2354.794,
        "duration": 3.265
    },
    {
        "text": "on a conundrum from probability known as Bertrand's paradox.",
        "start": 2358.059,
        "duration": 2.721
    },
    {
        "text": "After you watch it, and if you appreciate some of the nuance at play here, ",
        "start": 2361.58,
        "duration": 3.877
    },
    {
        "text": "homework for you is to reflect on where exactly Alice and Bob implicitly answered this ",
        "start": 2365.457,
        "duration": 4.497
    },
    {
        "text": "question.",
        "start": 2369.954,
        "duration": 0.466
    },
    {
        "text": "The case with Bob is relatively straightforward, ",
        "start": 2370.42,
        "duration": 2.888
    },
    {
        "text": "but the point at which Alice locks down some specific distribution on the space of ",
        "start": 2373.308,
        "duration": 4.893
    },
    {
        "text": "all orientations is not at all obvious.",
        "start": 2378.201,
        "duration": 2.299
    },
    {
        "text": "It's actually very subtle.\n680\n00:40:00,420 --> 00:39:41,700\n.",
        "start": 2380.64,
        "duration": 1.06
    }
]