[
    {
        "text": "Every year, more than 100 countries send six of their brightest teenagers, ",
        "start": 2.56,
        "duration": 4.315
    },
    {
        "text": "or the occasional prepubescent prodigy, to represent them at the ",
        "start": 6.875,
        "duration": 3.74
    },
    {
        "text": "International Math Olympiad, commonly known as the IMO.",
        "start": 10.615,
        "duration": 3.165
    },
    {
        "text": "Considering that each country has its own elaborate system of contests leading ",
        "start": 14.36,
        "duration": 3.997
    },
    {
        "text": "to their choice of six representatives, the IMO stands as the culminating ",
        "start": 18.357,
        "duration": 3.745
    },
    {
        "text": "symbol for the surprisingly expansive and wonderful world that is contest math.",
        "start": 22.102,
        "duration": 3.998
    },
    {
        "text": "The contest itself is essentially a test, split over two days, ",
        "start": 26.72,
        "duration": 3.58
    },
    {
        "text": "with three questions given over four and a half hours each day.",
        "start": 30.3,
        "duration": 3.58
    },
    {
        "text": "The questions are all proofs, meaning you don't simply find some numerical answer, ",
        "start": 34.52,
        "duration": 4.398
    },
    {
        "text": "you have to discover and articulate a rigorous line of reasoning to answer each ",
        "start": 38.918,
        "duration": 4.24
    },
    {
        "text": "difficult question, and then each one is scored on a scale from 0 up to 7.",
        "start": 43.158,
        "duration": 3.922
    },
    {
        "text": "Of interest to you and me today is the one from 2011, ",
        "start": 47.9,
        "duration": 3.705
    },
    {
        "text": "with 563 total participants representing 101 countries.",
        "start": 51.605,
        "duration": 3.775
    },
    {
        "text": "I know what you're thinking, and the answer is yes, ",
        "start": 56.26,
        "duration": 2.86
    },
    {
        "text": "those do all happen to be prime numbers.",
        "start": 59.12,
        "duration": 2.2
    },
    {
        "text": "But that's not why this test was interesting.",
        "start": 61.78,
        "duration": 1.6
    },
    {
        "text": "Out of all these prime problem solvers, only one of them, ",
        "start": 63.88,
        "duration": 2.883
    },
    {
        "text": "Lisa Sauermann from Germany, got a perfect score.",
        "start": 66.763,
        "duration": 2.437
    },
    {
        "text": "And the only thing standing between the next two runners ",
        "start": 69.66,
        "duration": 2.834
    },
    {
        "text": "up that year and a perfect score was problem number two.",
        "start": 72.494,
        "duration": 2.786
    },
    {
        "text": "And this problem is beautiful, and despite evading many of the world's best ",
        "start": 75.94,
        "duration": 4.013
    },
    {
        "text": "mathematicians of their age, the solution is something that anyone watching this video ",
        "start": 79.953,
        "duration": 4.594
    },
    {
        "text": "can understand.",
        "start": 84.547,
        "duration": 0.793
    },
    {
        "text": "So let's begin by reading through it carefully.",
        "start": 86.36,
        "duration": 2.28
    },
    {
        "text": "Let S be a finite set of at least two points on the plane.",
        "start": 89.38,
        "duration": 3.08
    },
    {
        "text": "Okay, so as you read the question it's often helpful ",
        "start": 93.48,
        "duration": 2.368
    },
    {
        "text": "to start drawing an example for yourself.",
        "start": 95.848,
        "duration": 1.832
    },
    {
        "text": "Assume that no three points of S are collinear, ",
        "start": 98.36,
        "duration": 2.473
    },
    {
        "text": "in other words you never have three points lining up, ",
        "start": 100.833,
        "duration": 2.782
    },
    {
        "text": "so you can probably predict that the problem's going to involve drawing lines in ",
        "start": 103.615,
        "duration": 4.173
    },
    {
        "text": "some way that three points on one line would mess things up.",
        "start": 107.788,
        "duration": 3.092
    },
    {
        "text": "A windmill is a process that starts with the line L going through a single point P in S.",
        "start": 111.5,
        "duration": 5.52
    },
    {
        "text": "The line rotates clockwise around the pivot P until the first ",
        "start": 117.58,
        "duration": 3.637
    },
    {
        "text": "time that that line meets some other point belonging to S.",
        "start": 121.217,
        "duration": 3.403
    },
    {
        "text": "And again, while reading it's helpful to draw out an example so we've ",
        "start": 125.52,
        "duration": 3.42
    },
    {
        "text": "got this line that's pivoting around some point until it hits another.",
        "start": 128.94,
        "duration": 3.42
    },
    {
        "text": "This point, Q, takes over as the new pivot, and the line now ",
        "start": 132.88,
        "duration": 4.056
    },
    {
        "text": "rotates clockwise about Q until it next meets a point of S.",
        "start": 136.936,
        "duration": 3.924
    },
    {
        "text": "This process continues indefinitely.",
        "start": 141.18,
        "duration": 1.94
    },
    {
        "text": "Alright, that's kind of fun.",
        "start": 144.26,
        "duration": 1.16
    },
    {
        "text": "We keep rotating and changing the pivot, and you can see why they call it a windmill ",
        "start": 145.8,
        "duration": 4.245
    },
    {
        "text": "process, and you can also see why they specified that no three points lie on one line.",
        "start": 150.045,
        "duration": 4.295
    },
    {
        "text": "You wouldn't want to run into the ambiguity where you don't know which pivot to switch to.",
        "start": 154.76,
        "duration": 3.98
    },
    {
        "text": "Okay, so with all this setup, what's the question?",
        "start": 159.24,
        "duration": 2.72
    },
    {
        "text": "Show that we can choose a point P in S and a line L going through P such that ",
        "start": 162.92,
        "duration": 5.213
    },
    {
        "text": "the resulting windmill uses each point of S as a pivot infinitely many times.",
        "start": 168.133,
        "duration": 5.147
    },
    {
        "text": "Alright, depending on your tolerance of puzzles for puzzle's sake, ",
        "start": 174.44,
        "duration": 3.538
    },
    {
        "text": "you might wonder why would anyone care about such a question?",
        "start": 177.978,
        "duration": 3.222
    },
    {
        "text": "There's a very good reason, in fact.",
        "start": 181.74,
        "duration": 1.6
    },
    {
        "text": "I would argue that the act of solving this will make you better at math ",
        "start": 183.68,
        "duration": 3.252
    },
    {
        "text": "and related fields, and I'll explain why once you've seen the solution.",
        "start": 186.932,
        "duration": 3.208
    },
    {
        "text": "But certainly on the surface, it feels disconnected from other parts of math.",
        "start": 190.68,
        "duration": 3.86
    },
    {
        "text": "I mean, you look at other Olympiad problems, and they often involve ",
        "start": 195.12,
        "duration": 3.223
    },
    {
        "text": "some function to analyze, or a numerical pattern to deduce, ",
        "start": 198.343,
        "duration": 2.844
    },
    {
        "text": "maybe a difficult counting setup or an elaborate geometric construction.",
        "start": 201.187,
        "duration": 3.413
    },
    {
        "text": "But problem two, it's an unusually pure puzzle, and in some ways that's its charm.",
        "start": 205.16,
        "duration": 5.44
    },
    {
        "text": "Proving that some initial condition will result in this windmill hitting all the points ",
        "start": 211.08,
        "duration": 4.079
    },
    {
        "text": "infinitely many times, well that doesn't test your knowledge of a particular theorem.",
        "start": 215.159,
        "duration": 3.941
    },
    {
        "text": "It tests if you can find a clever perspective.",
        "start": 219.62,
        "duration": 2.46
    },
    {
        "text": "But that blade cuts both ways.",
        "start": 222.9,
        "duration": 1.58
    },
    {
        "text": "Without resting on an existing result from math, ",
        "start": 224.82,
        "duration": 2.466
    },
    {
        "text": "what could possibly prepare someone to study for something like this?",
        "start": 227.286,
        "duration": 3.474
    },
    {
        "text": "And in fact, that brings us to the second unusual thing about this problem.",
        "start": 231.32,
        "duration": 3.46
    },
    {
        "text": "Based on the results, I'm guessing that it turned out ",
        "start": 235.48,
        "duration": 2.427
    },
    {
        "text": "to be much harder than the contest organizers expected.",
        "start": 237.907,
        "duration": 2.473
    },
    {
        "text": "You see, typically the three problems each day are supposed to get progressively harder.",
        "start": 240.38,
        "duration": 5.04
    },
    {
        "text": "They're all hard, of course, it's the IMO, but problems one and four should be doable.",
        "start": 246.02,
        "duration": 4.4
    },
    {
        "text": "Problems two and five, they're challenging.",
        "start": 250.88,
        "duration": 1.96
    },
    {
        "text": "And problems three and six, well they can be brutal.",
        "start": 253.46,
        "duration": 2.38
    },
    {
        "text": "But take a look at how many of our 563 participants ",
        "start": 256.68,
        "duration": 3.129
    },
    {
        "text": "that year got perfect scores on each of the problems.",
        "start": 259.809,
        "duration": 3.191
    },
    {
        "text": "Only 22 of them got full marks for question number two.",
        "start": 264.92,
        "duration": 3.16
    },
    {
        "text": "By contrast, 170 got a perfect score on problem five, ",
        "start": 268.6,
        "duration": 2.984
    },
    {
        "text": "which is supposed to be about the same difficulty, ",
        "start": 271.584,
        "duration": 2.819
    },
    {
        "text": "and more than twice as many got a perfect score for problem three, ",
        "start": 274.403,
        "duration": 3.703
    },
    {
        "text": "which is supposed to be harder.",
        "start": 278.106,
        "duration": 1.714
    },
    {
        "text": "Some of you might notice that only six students got full points for problem ",
        "start": 280.9,
        "duration": 3.402
    },
    {
        "text": "six that year, so by some measure that was the hardest problem on the test.",
        "start": 284.302,
        "duration": 3.358
    },
    {
        "text": "In fact, the way I introduced things earlier was a little disingenuous, ",
        "start": 288.32,
        "duration": 3.387
    },
    {
        "text": "the full data would suggest that problem six was the real clincher.",
        "start": 291.707,
        "duration": 3.153
    },
    {
        "text": "But what's strange is that if you look at the results of those six students ",
        "start": 295.3,
        "duration": 4.384
    },
    {
        "text": "who solved this hardest problem, all of whom are clearly phenomenal world-class ",
        "start": 299.684,
        "duration": 4.615
    },
    {
        "text": "problem solvers, this windmill puzzle evaded five out of six of them.",
        "start": 304.299,
        "duration": 3.981
    },
    {
        "text": "But again, this problem is not hard because of the background knowledge it demands, ",
        "start": 309.72,
        "duration": 4.377
    },
    {
        "text": "it asks only for insight.",
        "start": 314.097,
        "duration": 1.303
    },
    {
        "text": "So how do you approach something like this?",
        "start": 316.26,
        "duration": 1.98
    },
    {
        "text": "The first step with any puzzle is to simply play around with it and get a feel for it, ",
        "start": 318.88,
        "duration": 4.23
    },
    {
        "text": "and it's always good to start simple and slowly get more complicated from there.",
        "start": 323.11,
        "duration": 3.89
    },
    {
        "text": "The simplest case would be two points, where the line trades off between each point.",
        "start": 327.58,
        "duration": 4.34
    },
    {
        "text": "That works well enough.",
        "start": 333.16,
        "duration": 1.14
    },
    {
        "text": "Adding a third point, it's pretty clear that the line will just rotate around them.",
        "start": 334.96,
        "duration": 3.62
    },
    {
        "text": "It might not be entirely clear how you would phrase this as a rigorous proof yet, ",
        "start": 340.24,
        "duration": 3.736
    },
    {
        "text": "but right now we're just getting a feel for things.",
        "start": 343.976,
        "duration": 2.324
    },
    {
        "text": "The fourth point is where it gets interesting.",
        "start": 347.0,
        "duration": 1.66
    },
    {
        "text": "In some places, your windmill will go around the four points just like it did with the ",
        "start": 348.66,
        "duration": 4.905
    },
    {
        "text": "triangle, but if we put it inside that triangle, it looks like our windmill never hits it.",
        "start": 353.565,
        "duration": 5.075
    },
    {
        "text": "Looking back at the problem, it's asking you to show that for some starting position of ",
        "start": 359.34,
        "duration": 4.44
    },
    {
        "text": "the line, not any position, the process will hit all the points infinitely many times.",
        "start": 363.78,
        "duration": 4.34
    },
    {
        "text": "So for an example like this, if you start with the line ",
        "start": 369.98,
        "duration": 2.583
    },
    {
        "text": "going through that troublesome middle point, what happens?",
        "start": 372.563,
        "duration": 2.677
    },
    {
        "text": "And again, at this point we're just playing around, ",
        "start": 376.08,
        "duration": 1.927
    },
    {
        "text": "perhaps moving your pencil among dots that you've drawn on a piece of scratch paper.",
        "start": 378.007,
        "duration": 3.113
    },
    {
        "text": "You want to believe a result before you try too hard to prove it.",
        "start": 381.52,
        "duration": 3.46
    },
    {
        "text": "Here you'd see that your windmill does indeed bounce off of all the ",
        "start": 385.72,
        "duration": 3.244
    },
    {
        "text": "points as it goes through a cycle, and it ends up back where it started.",
        "start": 388.964,
        "duration": 3.436
    },
    {
        "text": "The worry you might have is that in some large sets of points, ",
        "start": 393.1,
        "duration": 3.306
    },
    {
        "text": "where some are kind of inside the others, you might be able to start off on the inside, ",
        "start": 396.406,
        "duration": 4.62
    },
    {
        "text": "but maybe something about this windmill process takes the line to the outside, ",
        "start": 401.026,
        "duration": 4.147
    },
    {
        "text": "where as time goes on to infinity it'll be blocked off from those inner points.",
        "start": 405.173,
        "duration": 4.147
    },
    {
        "text": "If you play around, and mind you it can take some time to draw out many ",
        "start": 411.32,
        "duration": 3.503
    },
    {
        "text": "examples and think this through, you would notice that when the line ",
        "start": 414.823,
        "duration": 3.358
    },
    {
        "text": "starts off passing through the middle of the points, it tends to stay there.",
        "start": 418.181,
        "duration": 3.699
    },
    {
        "text": "It never seems to venture off to the outside.",
        "start": 424.26,
        "duration": 2.36
    },
    {
        "text": "But can you guarantee that this will always happen?",
        "start": 429.84,
        "duration": 2.32
    },
    {
        "text": "Or rather, can you first make this idea of starting in the middle a little more rigorous, ",
        "start": 432.86,
        "duration": 4.789
    },
    {
        "text": "and from there prove that all the points will be hit infinitely many times?",
        "start": 437.649,
        "duration": 3.991
    },
    {
        "text": "As a general problem-solving tip, whenever you have a vague idea that feels productive, ",
        "start": 459.56,
        "duration": 4.506
    },
    {
        "text": "you should of course find a way to be more exact about what you're saying, ",
        "start": 464.066,
        "duration": 3.842
    },
    {
        "text": "but preferably put numbers to it, and then see if you can ask questions about those ",
        "start": 467.908,
        "duration": 4.302
    },
    {
        "text": "numbers.",
        "start": 472.21,
        "duration": 0.41
    },
    {
        "text": "In our example, one way to formalize this idea of a middle ",
        "start": 473.26,
        "duration": 3.18
    },
    {
        "text": "is to count how many points are on either side of the line.",
        "start": 476.44,
        "duration": 3.18
    },
    {
        "text": "If you give the line some orientation, you can reasonably talk about a left half, ",
        "start": 480.3,
        "duration": 4.189
    },
    {
        "text": "say coloring all the points on the left blue, and a right half, ",
        "start": 484.489,
        "duration": 3.269
    },
    {
        "text": "say coloring all the points on the right brown.",
        "start": 487.758,
        "duration": 2.402
    },
    {
        "text": "And what it means for a line to be in the middle is that ",
        "start": 490.76,
        "duration": 2.744
    },
    {
        "text": "there are as many blue points as there are brown points.",
        "start": 493.504,
        "duration": 2.696
    },
    {
        "text": "For the moment, let's say that the total number of points is an odd number, ",
        "start": 497.98,
        "duration": 3.474
    },
    {
        "text": "and the point that the line passes through is colored white, sort of a neutral color.",
        "start": 501.454,
        "duration": 3.886
    },
    {
        "text": "So for example, if there were 11 points, you would have 5 blue ones on the left, ",
        "start": 506.0,
        "duration": 4.433
    },
    {
        "text": "5 brown ones on the right, and the single white point as the pivot.",
        "start": 510.433,
        "duration": 3.667
    },
    {
        "text": "The case with an even number of points will be similar, just slightly less symmetric.",
        "start": 514.679,
        "duration": 3.62
    },
    {
        "text": "What this gives us is a new question to ask.",
        "start": 519.26,
        "duration": 2.12
    },
    {
        "text": "What happens to the number of blue points and brown points as the process plays out?",
        "start": 521.84,
        "duration": 4.46
    },
    {
        "text": "In the example on screen now, you might notice it's always 5 and 5, never changing.",
        "start": 528.7,
        "duration": 5.2
    },
    {
        "text": "Playing around with other examples, you would find that the same is true.",
        "start": 534.68,
        "duration": 3.66
    },
    {
        "text": "Take a moment to pause right now, and see if you ",
        "start": 539.16,
        "duration": 2.364
    },
    {
        "text": "can think through why exactly that would happen.",
        "start": 541.524,
        "duration": 2.316
    },
    {
        "text": "Why would these numbers not change?",
        "start": 544.14,
        "duration": 1.66
    },
    {
        "text": "Well, the key is to think through what happens as the line changes its pivot.",
        "start": 559.46,
        "duration": 4.38
    },
    {
        "text": "Having given the line an orientation, we can talk reasonably ",
        "start": 564.56,
        "duration": 3.024
    },
    {
        "text": "about which half is above the pivot, and which one is below.",
        "start": 567.584,
        "duration": 2.976
    },
    {
        "text": "If the line hits a blue point on its left, it must happen below the pivot.",
        "start": 571.23,
        "duration": 4.31
    },
    {
        "text": "So then when it changes the pivot and continues rotating clockwise a bit, that old pivot, ",
        "start": 576.22,
        "duration": 4.866
    },
    {
        "text": "now above the new one, ends up to the left, meaning it ends up in the blue region.",
        "start": 581.086,
        "duration": 4.434
    },
    {
        "text": "And entirely symmetrically, when it hits a brown point, ",
        "start": 586.12,
        "duration": 2.941
    },
    {
        "text": "it happens above the pivot, meaning that the old pivot ends up in the brown region.",
        "start": 589.061,
        "duration": 4.359
    },
    {
        "text": "So no matter what, the number of points on a given side of the line cannot change, ",
        "start": 594.02,
        "duration": 4.247
    },
    {
        "text": "except for the instances where the line is passing through two points at once.",
        "start": 598.267,
        "duration": 3.993
    },
    {
        "text": "When you lose a blue point, you gain a new one.",
        "start": 602.86,
        "duration": 1.82
    },
    {
        "text": "When you lose a brown point, you gain a new one.",
        "start": 604.94,
        "duration": 2.08
    },
    {
        "text": "And that is our key insight number one.",
        "start": 607.58,
        "duration": 2.18
    },
    {
        "text": "So why would this imply that the line must hit every point infinitely many times, ",
        "start": 610.64,
        "duration": 4.401
    },
    {
        "text": "no matter what weird set of points you could dream up?",
        "start": 615.041,
        "duration": 2.899
    },
    {
        "text": "The second key is to think about letting this process ",
        "start": 618.94,
        "duration": 3.356
    },
    {
        "text": "go until the line has turned 180 degrees around.",
        "start": 622.296,
        "duration": 2.984
    },
    {
        "text": "What that means is that it's parallel to the starting position, ",
        "start": 625.28,
        "duration": 3.18
    },
    {
        "text": "and because it has to remain the case that half the points are on one side ",
        "start": 628.46,
        "duration": 3.728
    },
    {
        "text": "and half the points are on the other, it must be passing through the same ",
        "start": 632.188,
        "duration": 3.678
    },
    {
        "text": "point it started on.",
        "start": 635.866,
        "duration": 0.994
    },
    {
        "text": "I mean, think about it, if it ended up on some other point, ",
        "start": 637.84,
        "duration": 3.075
    },
    {
        "text": "it would change the number on a given side.",
        "start": 640.915,
        "duration": 2.205
    },
    {
        "text": "Additionally, since the line has rotated halfway around, ",
        "start": 648.44,
        "duration": 3.303
    },
    {
        "text": "everything that was blue has become brown, and everything which was ",
        "start": 651.743,
        "duration": 3.941
    },
    {
        "text": "brown has become blue, and the only way to change the color is if you get hit by the line.",
        "start": 655.684,
        "duration": 5.216
    },
    {
        "text": "So for our odd-numbered case, that means that after a half rotation, ",
        "start": 667.56,
        "duration": 3.885
    },
    {
        "text": "the line is back where it started, and it's hit all of the other points.",
        "start": 671.445,
        "duration": 4.055
    },
    {
        "text": "So as time goes forward, it repeats this exact set of motions over and over, ",
        "start": 676.06,
        "duration": 4.656
    },
    {
        "text": "hitting all of those points infinitely many times.",
        "start": 680.716,
        "duration": 3.024
    },
    {
        "text": "For the case with an even number of points, we need to alter the scheme slightly, ",
        "start": 688.32,
        "duration": 4.132
    },
    {
        "text": "but only slightly.",
        "start": 692.452,
        "duration": 0.908
    },
    {
        "text": "To make it so that the number of blues can equal the number of browns, ",
        "start": 693.92,
        "duration": 3.046
    },
    {
        "text": "let's say that the pivot counts now as a brown point.",
        "start": 696.966,
        "duration": 2.274
    },
    {
        "text": "So to define our initial condition, we still say for a given angle of the line, ",
        "start": 699.9,
        "duration": 4.126
    },
    {
        "text": "select an initial point so that half of the points are blue, all on the left, ",
        "start": 704.026,
        "duration": 4.024
    },
    {
        "text": "and half of them are brown, now either meaning they're on the right, or the pivot.",
        "start": 708.05,
        "duration": 4.23
    },
    {
        "text": "The same argument from before implies that after a 180° turn, ",
        "start": 713.0,
        "duration": 3.919
    },
    {
        "text": "everything has swapped colors, but this time the line will be passing through ",
        "start": 716.919,
        "duration": 4.932
    },
    {
        "text": "a different point after that first half turn, specifically one that used to be blue, ",
        "start": 721.851,
        "duration": 5.374
    },
    {
        "text": "but after another 180° it has to be passing through the one that it started on.",
        "start": 727.225,
        "duration": 4.995
    },
    {
        "text": "Again, the logic is that it's parallel to its starting position, ",
        "start": 733.4,
        "duration": 3.22
    },
    {
        "text": "and if it was passing through any other point, ",
        "start": 736.62,
        "duration": 2.329
    },
    {
        "text": "the number of points on a given side would have to be different.",
        "start": 738.949,
        "duration": 3.171
    },
    {
        "text": "So once more, we have a cycle which hits all of the points, ",
        "start": 743.08,
        "duration": 2.93
    },
    {
        "text": "and which ends in the same position where it started.",
        "start": 746.01,
        "duration": 2.59
    },
    {
        "text": "This time it takes 360°, but that doesn't matter, ",
        "start": 749.18,
        "duration": 2.925
    },
    {
        "text": "as the cycle continues it'll hit all the points infinitely many times.",
        "start": 752.105,
        "duration": 4.095
    },
    {
        "text": "Stepping back, there are two important lessons to take away from this puzzle, ",
        "start": 760.14,
        "duration": 3.667
    },
    {
        "text": "the first one social and the second one mathematical.",
        "start": 763.807,
        "duration": 2.493
    },
    {
        "text": "Once you know this solution, and if you ponder it a bit and ",
        "start": 767.16,
        "duration": 3.114
    },
    {
        "text": "turn it around in your head a couple times, it's very easy to ",
        "start": 770.274,
        "duration": 3.219
    },
    {
        "text": "fool yourself into thinking that the problem is easier than it is.",
        "start": 773.493,
        "duration": 3.427
    },
    {
        "text": "After all, of course the number of points on a given side stays constant, right?",
        "start": 777.44,
        "duration": 3.66
    },
    {
        "text": "Of course that's a question you would ask.",
        "start": 781.48,
        "duration": 1.42
    },
    {
        "text": "And of course when you start in the middle, every ",
        "start": 783.4,
        "duration": 2.106
    },
    {
        "text": "point will switch sides after a half a turn.",
        "start": 785.506,
        "duration": 1.854
    },
    {
        "text": "But the advantage of this problem coming from the IMO is that we ",
        "start": 788.46,
        "duration": 3.378
    },
    {
        "text": "don't have to rest on In the subject of statements, ",
        "start": 791.838,
        "duration": 2.702
    },
    {
        "text": "we have the data to show it's a genuinely hard problem, ",
        "start": 794.54,
        "duration": 2.91
    },
    {
        "text": "in that it evaded many of the world's best students who are demonstrably ",
        "start": 797.45,
        "duration": 3.794
    },
    {
        "text": "able to solve hard problems.",
        "start": 801.244,
        "duration": 1.456
    },
    {
        "text": "In math, it's extremely hard to empathize with ",
        "start": 803.56,
        "duration": 2.46
    },
    {
        "text": "what it feels like to not understand something.",
        "start": 806.02,
        "duration": 2.46
    },
    {
        "text": "I was discussing this video with a former coworker of mine from Khan Academy, ",
        "start": 808.96,
        "duration": 3.892
    },
    {
        "text": "who worked a lot with people creating math exercises, ",
        "start": 812.852,
        "duration": 2.695
    },
    {
        "text": "and he pointed out that across a wide variety of contributors, there's one constant.",
        "start": 815.547,
        "duration": 4.193
    },
    {
        "text": "Nobody is able to tell how difficult their exercises are.",
        "start": 820.37,
        "duration": 3.17
    },
    {
        "text": "Knowing when math is hard is way harder than the math itself.",
        "start": 824.08,
        "duration": 3.32
    },
    {
        "text": "This is important to keep in mind when teaching, ",
        "start": 828.04,
        "duration": 2.271
    },
    {
        "text": "but it's equally important to keep in mind when being taught.",
        "start": 830.311,
        "duration": 2.829
    },
    {
        "text": "On our windmill puzzle, even if counting the number of points on one side ",
        "start": 834.8,
        "duration": 4.388
    },
    {
        "text": "seems obvious in hindsight, you have to ask, given the vast space of possible ",
        "start": 839.188,
        "duration": 4.627
    },
    {
        "text": "things you might consider, Why would anyone's mind turn to that particular idea?",
        "start": 843.815,
        "duration": 4.745
    },
    {
        "text": "This brings us to the mathematical takeaway.",
        "start": 849.98,
        "duration": 1.82
    },
    {
        "text": "What ultimately led to the solution was finding something about the ",
        "start": 852.44,
        "duration": 3.765
    },
    {
        "text": "complex system which stays constant during this chaotic unfolding.",
        "start": 856.205,
        "duration": 3.655
    },
    {
        "text": "This is a ubiquitous theme through math, and especially through physics.",
        "start": 860.84,
        "duration": 3.24
    },
    {
        "text": "We're finding what's called an invariant.",
        "start": 864.34,
        "duration": 2.24
    },
    {
        "text": "Topologists do this when they count the number of holes in a surface.",
        "start": 867.24,
        "duration": 2.98
    },
    {
        "text": "Physicists do this when they define the ideas of energy and momentum, ",
        "start": 870.78,
        "duration": 3.467
    },
    {
        "text": "or in special relativity when they define more abstract ideas like proper time.",
        "start": 874.247,
        "duration": 3.913
    },
    {
        "text": "As a student, it's easy to take for granted the definitions handed down to you, ",
        "start": 878.94,
        "duration": 3.996
    },
    {
        "text": "but the more puzzles you solve where the insight involves an invariant, ",
        "start": 882.936,
        "duration": 3.597
    },
    {
        "text": "the more you come to appreciate that each one of these definitions was once a clever ",
        "start": 886.533,
        "duration": 4.247
    },
    {
        "text": "discovery.",
        "start": 890.78,
        "duration": 0.5
    },
    {
        "text": "Terence Tao, one of the greatest modern mathematicians and the world's ",
        "start": 893.88,
        "duration": 3.642
    },
    {
        "text": "youngest IMO medalist, wrote that mathematical problems or puzzles are ",
        "start": 897.522,
        "duration": 3.643
    },
    {
        "text": "important to real mathematics, like solving real-life problems, just as fables, ",
        "start": 901.165,
        "duration": 4.104
    },
    {
        "text": "stories, and anecdotes are important to the young in understanding real life.",
        "start": 905.269,
        "duration": 3.951
    },
    {
        "text": "Sure, these kinds of puzzles are contrived, but they carry lessons ",
        "start": 909.94,
        "duration": 3.36
    },
    {
        "text": "relevant to useful problems you may actually need to solve one day.",
        "start": 913.3,
        "duration": 3.36
    },
    {
        "text": "Maybe it seems silly to liken this windmill puzzle to a fairy tale, ",
        "start": 917.38,
        "duration": 3.419
    },
    {
        "text": "a mathematical Aesop summarizing that the moral of the story is to seek quantities ",
        "start": 920.799,
        "duration": 4.175
    },
    {
        "text": "which stay constant.",
        "start": 924.974,
        "duration": 1.006
    },
    {
        "text": "But some of you watching this will one day face a problem where finding an invariant ",
        "start": 926.46,
        "duration": 4.462
    },
    {
        "text": "reveals a slick solution, and you might even look like a genius for doing so. ",
        "start": 930.922,
        "duration": 4.095
    },
    {
        "text": "If a made-up windmill prepares you for a real problem, who cares that it's a fiction?",
        "start": 935.017,
        "duration": 4.463
    }
]