[
    {
        "start": 0.273,
        "text": "(upbeat music) - Good afternoon and welcome to this the celebration of\nthe 10th anniversary of the Department of Computational\nMedicine and Bioinformatics. And congratulations on\nthis milestone achievement to the leadership of the\ndepartment, the faculty, the staff, current students, and alums. And welcome to all who are attending in person, or virtually. Later in the program, Dr. Athey\nis going to be talking about his vision for the\nfuture of the department, but I think it is worthwhile to look back and think about the\ncreation of the department. Because a very valid question is why does the University of\nMichigan Medical School have a Department of Computational\nMedicine and Bioinformatics? It's not a traditional\nbasic science department, it isn't a clinical department. So, what were the events\nthat led to its creation, "
    },
    {
        "start": 62.97,
        "text": "over a decade ago? The Human Genome Project was released, there were dramatic advances\nin high performance computing, new methods were developed to\nanalyze very large databases, and faculty here at the\nUniversity of Michigan became increasingly\ninterested in this new field that was called bioinformatics. Students were also interested. A graduate program was\ninitiated, and in 1999, the multi-disciplinary Bioinformatics Graduate\nProgram was launched. Very importantly, with\nsupport from the EVPMA and from Pfizer and the Howard\nHughes Medical Institute. In 2005, the rapid growth and success of the graduate program was\nfollowed by the creation of a university-wide consortium of faculty who participated in the\nBioinformatics Graduate Program. "
    },
    {
        "start": 124.89,
        "text": "This consortium co-founded by\nGil Omenn, and Brian Athey, was the Center for Computational\nMedicine and Bioinformatics or CCMB. Also, in 2005, the NIH founded the National Center for\nIntegrative Bioinformatics, sending a strong signal\nthat bioinformatics was a particularly important new branch of medicine and science. This nascent scientific\nfield kept growing, and in 2011 the Institute of\nMedicine published a monograph that codified a lot of the\nwork that was being done right here in Michigan. It recognized that biology\nwas a data intensive science. There was a great opportunity to integrate data intensive biology with medicine. Dramatic advances in\ninformation technology were driving systemic changes. And very importantly,\nthere was a need to bring "
    },
    {
        "start": 185.1,
        "text": "the multiple stakeholders\ninvolved together. The result of all these events,\nand a series of discussions, among Gil Omenn, Mike Savageau, who at the time was the chair of the Department of\nMicrobiology and Immunology, Brian Athey, myself, and others, led to the initiation of the process to create a new medical school department. But a new department isn't just created. Our medical school bylaws\nlay out a series of steps that must be followed successfully to initiate a new department's creation. This culminated in a vote by\nthe executive faculty approving the creation of such a department on August 5th, 2011. And on September 15th, 2011, the Board of Regents unanimously approved the establishment of a\nnew academic department "
    },
    {
        "start": 246.84,
        "text": "named Computational\nMedicine and Bioinformatics to begin January, 2012. As I look at what has been accomplished in the ensuing 10 years,\nyou have not only lived up to what was envisioned at the\ncreation of the department, but vastly exceeded it. Congratulations to all\nwho have worked so hard to make DCMB a thriving\ndepartment in our medical school. Looking forward, I fully\nexpect that the department will continue to be a major contributor to the intellectual climate, research, and educational excellence of\nnot only the medical school but the university at large, and also to the nation and beyond. I trust that you will enjoy\nthe remainder of the program and thank you for the opportunity to reflect on the department's beginnings. (upbeat music) "
    }
]