[
    {
        "text": "Today, many members of the YouTube math community are getting ",
        "start": 4.32,
        "duration": 3.039
    },
    {
        "text": "together to make videos about their favorite numbers over 1 million, ",
        "start": 7.359,
        "duration": 3.384
    },
    {
        "text": "and we're encouraging you, the viewers, to do the same.",
        "start": 10.743,
        "duration": 2.697
    },
    {
        "text": "Take a look at the description for details.",
        "start": 13.92,
        "duration": 1.64
    },
    {
        "text": "My own choice is considerably larger than a million, roughly 8x10 to the 53.",
        "start": 16.2,
        "duration": 4.24
    },
    {
        "text": "For a sense of scale, that's around the number of atoms in the planet Jupiter, ",
        "start": 21.1,
        "duration": 3.794
    },
    {
        "text": "so it might seem completely arbitrary.",
        "start": 24.894,
        "duration": 1.826
    },
    {
        "text": "But what I love is that if you were to talk with an alien civilization or a ",
        "start": 27.17,
        "duration": 3.902
    },
    {
        "text": "super-intelligent AI that invented math for itself without any connection to ",
        "start": 31.072,
        "duration": 3.954
    },
    {
        "text": "our particular culture or experiences, I think both would agree that this ",
        "start": 35.026,
        "duration": 3.8
    },
    {
        "text": "number is something very peculiar and that it reflects something fundamental.",
        "start": 38.826,
        "duration": 3.954
    },
    {
        "text": "What is it, exactly?",
        "start": 43.64,
        "duration": 0.94
    },
    {
        "text": "Well, it's the size of the monster, but to explain what that ",
        "start": 45.02,
        "duration": 2.836
    },
    {
        "text": "means we're going to need to back up and talk about group theory.",
        "start": 47.856,
        "duration": 3.024
    },
    {
        "text": "This field is all about codifying the idea of symmetry.",
        "start": 52.5,
        "duration": 3.38
    },
    {
        "text": "For example, when we say a face is symmetric, what we mean is that you ",
        "start": 56.86,
        "duration": 4.018
    },
    {
        "text": "can reflect it about a line and it's left looking completely the same.",
        "start": 60.878,
        "duration": 3.962
    },
    {
        "text": "It's a statement about an action that you can take.",
        "start": 65.22,
        "duration": 2.52
    },
    {
        "text": "Something like a snowflake is also symmetric, but in more ways.",
        "start": 68.42,
        "duration": 3.34
    },
    {
        "text": "You can rotate it 60 degrees or 120 degrees, you can flip it along ",
        "start": 71.98,
        "duration": 3.952
    },
    {
        "text": "various different axes, and all these actions leave it looking the same.",
        "start": 75.932,
        "duration": 4.248
    },
    {
        "text": "A collection of all the actions like this taken together is called a group.",
        "start": 80.86,
        "duration": 4.62
    },
    {
        "text": "Kind of, at least.",
        "start": 86.18,
        "duration": 0.72
    },
    {
        "text": "Groups are typically defined a little more abstractly than this, ",
        "start": 87.12,
        "duration": 2.404
    },
    {
        "text": "but we'll get to that later.",
        "start": 89.524,
        "duration": 1.036
    },
    {
        "text": "Take note, the fact that mathematicians have co-opted such an ",
        "start": 91.48,
        "duration": 3.129
    },
    {
        "text": "otherwise generic word for this seemingly specific kind of ",
        "start": 94.609,
        "duration": 2.978
    },
    {
        "text": "collection should give you some sense of how fundamental they find it.",
        "start": 97.587,
        "duration": 3.533
    },
    {
        "text": "Also take note, we always consider the action of doing nothing to be part of the group.",
        "start": 101.98,
        "duration": 4.02
    },
    {
        "text": "So if we include that do-nothing action, the group of ",
        "start": 106.0,
        "duration": 3.2
    },
    {
        "text": "symmetries of a snowflake includes 12 distinct actions.",
        "start": 109.2,
        "duration": 3.26
    },
    {
        "text": "It even has a fancy name, D6.",
        "start": 113.04,
        "duration": 2.18
    },
    {
        "text": "The simple group of symmetries that only has two ",
        "start": 116.5,
        "duration": 2.901
    },
    {
        "text": "elements acting on a face also has a fancy name, C2.",
        "start": 119.401,
        "duration": 3.079
    },
    {
        "text": "In general, there is a whole zoo of groups with no shortage of jargon to their ",
        "start": 123.38,
        "duration": 4.124
    },
    {
        "text": "names categorizing the many different ways that something can be symmetric.",
        "start": 127.504,
        "duration": 3.916
    },
    {
        "text": "When we describe these sorts of actions, there's ",
        "start": 132.12,
        "duration": 2.585
    },
    {
        "text": "always an implicit structure being preserved.",
        "start": 134.705,
        "duration": 2.375
    },
    {
        "text": "For example, there are 24 rotations that I can apply to a cube that leave it ",
        "start": 137.74,
        "duration": 4.379
    },
    {
        "text": "looking the same, and those 24 actions taken together do indeed constitute a group.",
        "start": 142.119,
        "duration": 4.721
    },
    {
        "text": "But if we allow for reflections, which is a kind of way of saying ",
        "start": 147.38,
        "duration": 3.372
    },
    {
        "text": "that the orientation of the cube is not part of the structure we intend to preserve, ",
        "start": 150.752,
        "duration": 4.344
    },
    {
        "text": "you get a bigger group, with 48 actions in total.",
        "start": 155.096,
        "duration": 2.504
    },
    {
        "text": "If you loosen things further and consider the faces to be a little less rigidly attached, ",
        "start": 158.18,
        "duration": 4.535
    },
    {
        "text": "maybe free to rotate and get shuffled around, you would get a much larger set of actions.",
        "start": 162.715,
        "duration": 4.485
    },
    {
        "text": "And yes, you could consider these symmetries in the sense that they ",
        "start": 167.9,
        "duration": 3.246
    },
    {
        "text": "leave it looking the same, and all of these shuffling rotating actions ",
        "start": 171.146,
        "duration": 3.389
    },
    {
        "text": "do constitute a group, but it's a much bigger and more complicated group.",
        "start": 174.535,
        "duration": 3.485
    },
    {
        "text": "The large size in this group reflects the much ",
        "start": 180.98,
        "duration": 2.484
    },
    {
        "text": "looser sense of structure which each action preserves.",
        "start": 183.464,
        "duration": 2.856
    },
    {
        "text": "The loosest sense of structure is if we have a collection of points and we consider ",
        "start": 188.7,
        "duration": 4.372
    },
    {
        "text": "any way you could shuffle them, any permutation, to be a symmetry of those points.",
        "start": 193.072,
        "duration": 4.268
    },
    {
        "text": "Unconstrained by any underlying property that needs to be preserved, ",
        "start": 198.32,
        "duration": 3.268
    },
    {
        "text": "these permutation groups can get quite large.",
        "start": 201.588,
        "duration": 2.132
    },
    {
        "text": "Here, it's kind of fun to flash through every possible ",
        "start": 204.38,
        "duration": 2.664
    },
    {
        "text": "permutation of six objects and see how many there are.",
        "start": 207.044,
        "duration": 2.616
    },
    {
        "text": "In total, it amounts to 6!",
        "start": 221.0,
        "duration": 1.86
    },
    {
        "text": "or 720.",
        "start": 223.36,
        "duration": 1.28
    },
    {
        "text": "By contrast, if we gave these points some structure, ",
        "start": 225.36,
        "duration": 2.739
    },
    {
        "text": "maybe making them the corners of a hexagon and only considering the permutations that ",
        "start": 228.099,
        "duration": 4.445
    },
    {
        "text": "preserve how far apart each one is from the other, ",
        "start": 232.544,
        "duration": 2.636
    },
    {
        "text": "well then we only get the 12 snowflake symmetries we saw earlier.",
        "start": 235.18,
        "duration": 3.36
    },
    {
        "text": "Bump the number of points up to 12, and the number ",
        "start": 239.98,
        "duration": 3.146
    },
    {
        "text": "of permutations grows to about 479 million.",
        "start": 243.126,
        "duration": 2.654
    },
    {
        "text": "The monster we'll get to is rather large, but it's important to understand ",
        "start": 246.54,
        "duration": 3.648
    },
    {
        "text": "that largeness in and of itself is not that interesting when it comes to groups.",
        "start": 250.188,
        "duration": 3.892
    },
    {
        "text": "The permutation groups already make that easy to see.",
        "start": 254.64,
        "duration": 2.199
    },
    {
        "text": "If we were shuffling 101 objects, for example, ",
        "start": 257.519,
        "duration": 3.114
    },
    {
        "text": "with the 101 factorial different actions that can do this, ",
        "start": 260.633,
        "duration": 3.909
    },
    {
        "text": "we have a group with a size of around 9x10 to the 159.",
        "start": 264.542,
        "duration": 3.578
    },
    {
        "text": "If every atom in the observable universe had a copy of that universe inside itself, ",
        "start": 268.82,
        "duration": 5.165
    },
    {
        "text": "this is roughly how many sub-atoms there would be.",
        "start": 273.985,
        "duration": 3.075
    },
    {
        "text": "These permutation groups go by the name S-sub-n, ",
        "start": 277.94,
        "duration": 2.619
    },
    {
        "text": "and they play a very important role in group theory.",
        "start": 280.559,
        "duration": 2.781
    },
    {
        "text": "In a certain sense, they encompass all other groups.",
        "start": 283.86,
        "duration": 2.74
    },
    {
        "text": "And so far you might be thinking, okay, this is intellectually playful enough, ",
        "start": 287.52,
        "duration": 3.603
    },
    {
        "text": "but is any of this actually useful?",
        "start": 291.123,
        "duration": 1.597
    },
    {
        "text": "One of the earliest applications of group theory came when ",
        "start": 293.4,
        "duration": 2.828
    },
    {
        "text": "mathematicians realized that the structure of these permutation ",
        "start": 296.228,
        "duration": 3.068
    },
    {
        "text": "groups tells us something about solutions to polynomial equations.",
        "start": 299.296,
        "duration": 3.164
    },
    {
        "text": "You know how, in order to find the two roots of a quadratic equation, ",
        "start": 304.06,
        "duration": 3.647
    },
    {
        "text": "everyone learns a certain formula in school?",
        "start": 307.707,
        "duration": 2.293
    },
    {
        "text": "Slightly lesser known is the fact that there's also a cubic formula, ",
        "start": 310.82,
        "duration": 3.163
    },
    {
        "text": "one that involves nesting cube roots with square roots in a larger expression.",
        "start": 313.983,
        "duration": 3.577
    },
    {
        "text": "There's even a quartic formula for a degree 4 polynomial, which is an absolute mess.",
        "start": 318.22,
        "duration": 4.88
    },
    {
        "text": "It's almost impossible to write without factoring things out.",
        "start": 323.38,
        "duration": 2.6
    },
    {
        "text": "And for the longest time, mathematicians struggled ",
        "start": 326.54,
        "duration": 2.431
    },
    {
        "text": "to find a formula to solve degree 5 polynomials.",
        "start": 328.971,
        "duration": 2.289
    },
    {
        "text": "Maybe there's one, but it's just super complicated.",
        "start": 331.26,
        "duration": 2.72
    },
    {
        "text": "It turns out, though, if you think about the group which permutes ",
        "start": 334.98,
        "duration": 3.575
    },
    {
        "text": "the roots of such a polynomial, there's something about the ",
        "start": 338.555,
        "duration": 3.251
    },
    {
        "text": "nature of this group that reveals no quintic formula can exist.",
        "start": 341.806,
        "duration": 3.414
    },
    {
        "text": "For example, the five roots of the polynomial you see on screen now have definite values, ",
        "start": 345.94,
        "duration": 4.585
    },
    {
        "text": "you could write out decimal approximations, but what you can never do is write those ",
        "start": 350.525,
        "duration": 4.331
    },
    {
        "text": "exact values by starting with the coefficients of the polynomial and using only the four ",
        "start": 354.856,
        "duration": 4.534
    },
    {
        "text": "basic operations of arithmetic together with radicals, ",
        "start": 359.39,
        "duration": 2.802
    },
    {
        "text": "no matter how many times you nest them.",
        "start": 362.192,
        "duration": 1.988
    },
    {
        "text": "And that impossibility has everything to do with ",
        "start": 364.52,
        "duration": 3.0
    },
    {
        "text": "the inner structure of the permutation group S5.",
        "start": 367.52,
        "duration": 2.94
    },
    {
        "text": "A theme in math through the last two centuries has been that ",
        "start": 373.04,
        "duration": 3.271
    },
    {
        "text": "the nature of symmetry in and of itself can show us all sorts ",
        "start": 376.311,
        "duration": 3.325
    },
    {
        "text": "of non-obvious facts about the other objects that we study.",
        "start": 379.636,
        "duration": 3.164
    },
    {
        "text": "To give just a hint of the many many ways that this applies to physics, ",
        "start": 383.32,
        "duration": 3.833
    },
    {
        "text": "there's a beautiful fact known as Noether's theorem saying that every ",
        "start": 387.153,
        "duration": 3.727
    },
    {
        "text": "conservation law corresponds to some kind of symmetry, a certain group.",
        "start": 390.88,
        "duration": 3.78
    },
    {
        "text": "So all those fundamental laws like conservation of momentum ",
        "start": 395.46,
        "duration": 3.0
    },
    {
        "text": "and conservation of energy each correspond to a group.",
        "start": 398.46,
        "duration": 2.7
    },
    {
        "text": "More specifically, the actions we should be able to apply ",
        "start": 401.82,
        "duration": 2.744
    },
    {
        "text": "to a setup such that the laws of physics don't change.",
        "start": 404.564,
        "duration": 2.556
    },
    {
        "text": "All of this is to say that groups really are fundamental, ",
        "start": 408.14,
        "duration": 2.488
    },
    {
        "text": "and the one thing I want you to recognize right now is that they are one of the most ",
        "start": 410.628,
        "duration": 3.647
    },
    {
        "text": "natural things that you could study.",
        "start": 414.275,
        "duration": 1.545
    },
    {
        "text": "What could be more universal than symmetry?",
        "start": 415.82,
        "duration": 2.16
    },
    {
        "text": "So you might think that the patterns among groups ",
        "start": 418.86,
        "duration": 2.364
    },
    {
        "text": "themselves would somehow be very beautiful and symmetric.",
        "start": 421.224,
        "duration": 2.696
    },
    {
        "text": "The monster, however, tells a different story.",
        "start": 424.64,
        "duration": 1.92
    },
    {
        "text": "Before we get to the monster, though, at this point some mathematicians ",
        "start": 427.28,
        "duration": 3.382
    },
    {
        "text": "might complain that what I've described so far are not groups exactly, ",
        "start": 430.662,
        "duration": 3.335
    },
    {
        "text": "but group actions, and that groups are something slightly more abstract.",
        "start": 433.997,
        "duration": 3.383
    },
    {
        "text": "By way of analogy, if I mention the number 3, you ",
        "start": 438.26,
        "duration": 2.66
    },
    {
        "text": "probably don't think about a specific triplet of things.",
        "start": 440.92,
        "duration": 2.98
    },
    {
        "text": "You probably think about 3 as an object in and of itself, ",
        "start": 444.52,
        "duration": 3.02
    },
    {
        "text": "an abstraction, maybe represented with a symbol.",
        "start": 447.54,
        "duration": 2.5
    },
    {
        "text": "In much the same way, when mathematicians discuss the elements of a group, ",
        "start": 450.72,
        "duration": 3.684
    },
    {
        "text": "they don't necessarily think about specific actions on specific objects, ",
        "start": 454.404,
        "duration": 3.586
    },
    {
        "text": "they might think of these elements as a kind of thing in and of itself, ",
        "start": 457.99,
        "duration": 3.537
    },
    {
        "text": "maybe represented with a symbol.",
        "start": 461.527,
        "duration": 1.573
    },
    {
        "text": "For something like the number 3, the abstract symbol does us very little good unless we ",
        "start": 464.14,
        "duration": 4.605
    },
    {
        "text": "define its relation with other numbers, for example the way it adds or multiplies with ",
        "start": 468.745,
        "duration": 4.553
    },
    {
        "text": "them.",
        "start": 473.298,
        "duration": 0.262
    },
    {
        "text": "For each of these, you could think of a literal triplet of something, but again, ",
        "start": 474.24,
        "duration": 4.467
    },
    {
        "text": "most of us are comfortable, probably even more comfortable, using the symbols alone.",
        "start": 478.707,
        "duration": 4.633
    },
    {
        "text": "Similarly, what makes a group a group are all of ",
        "start": 484.3,
        "duration": 2.606
    },
    {
        "text": "the ways that its elements combine with each other.",
        "start": 486.906,
        "duration": 2.714
    },
    {
        "text": "And in the context of actions, this has a very vivid meaning.",
        "start": 490.18,
        "duration": 2.6
    },
    {
        "text": "What we mean by combining is to apply one action after the other, read from right to left.",
        "start": 492.78,
        "duration": 5.18
    },
    {
        "text": "If you flip a snowflake about the x-axis, then rotate it 60 degrees counterclockwise, ",
        "start": 498.36,
        "duration": 4.876
    },
    {
        "text": "the overall action is the same as if you had flipped it about a diagonal line.",
        "start": 503.236,
        "duration": 4.424
    },
    {
        "text": "All possible ways that you can combine two elements ",
        "start": 511.64,
        "duration": 2.707
    },
    {
        "text": "of a group like this defines a kind of multiplication.",
        "start": 514.347,
        "duration": 2.812
    },
    {
        "text": "That is what really gives a group its structure.",
        "start": 517.78,
        "duration": 2.36
    },
    {
        "text": "Here, I'm drawing out the full 8x8 table of the symmetries of a square.",
        "start": 520.799,
        "duration": 3.921
    },
    {
        "text": "If you apply an action from the top row and follow it by an action from the left column, ",
        "start": 525.32,
        "duration": 4.45
    },
    {
        "text": "it'll be the same as the action in the corresponding grid square.",
        "start": 529.77,
        "duration": 3.25
    },
    {
        "text": "But if we replace each one of these symmetric actions with something purely symbolic, ",
        "start": 538.62,
        "duration": 4.731
    },
    {
        "text": "well, the multiplication table still captures the inner structure of the group, ",
        "start": 543.351,
        "duration": 4.401
    },
    {
        "text": "but now it's abstracted away from any specific object that it might act on, ",
        "start": 547.752,
        "duration": 4.182
    },
    {
        "text": "like a square or roots of a polynomial.",
        "start": 551.934,
        "duration": 2.146
    },
    {
        "text": "This is entirely analogous to how the usual multiplication table is written symbolically, ",
        "start": 554.74,
        "duration": 4.858
    },
    {
        "text": "which abstracts away from the idea of literal counts.",
        "start": 559.598,
        "duration": 2.862
    },
    {
        "text": "Literal counts, arguably, would make it much clearer what's going on, ",
        "start": 563.24,
        "duration": 3.426
    },
    {
        "text": "but since grade school we all grow comfortable with the symbols.",
        "start": 566.666,
        "duration": 3.134
    },
    {
        "text": "After all, they're less cumbersome, they free us to think about more complicated numbers, ",
        "start": 570.36,
        "duration": 4.077
    },
    {
        "text": "and they also free us to think about numbers in new and very different ways.",
        "start": 574.437,
        "duration": 3.443
    },
    {
        "text": "All of this is true of groups as well, which are best ",
        "start": 578.82,
        "duration": 2.997
    },
    {
        "text": "understood as abstractions above the idea of symmetry actions.",
        "start": 581.817,
        "duration": 3.443
    },
    {
        "text": "I'm emphasizing this for two reasons.",
        "start": 586.12,
        "duration": 1.56
    },
    {
        "text": "One is that understanding what groups really are gives a better ",
        "start": 588.1,
        "duration": 3.05
    },
    {
        "text": "appreciation for the monster, and the other is that many students ",
        "start": 591.15,
        "duration": 3.147
    },
    {
        "text": "learning about groups for the first time can find them frustratingly opaque.",
        "start": 594.297,
        "duration": 3.623
    },
    {
        "text": "I know that I did.",
        "start": 598.38,
        "duration": 0.76
    },
    {
        "text": "A typical course starts with this very formal and abstract definition, ",
        "start": 599.69,
        "duration": 4.283
    },
    {
        "text": "which is that a group is a set in a collection of things, ",
        "start": 603.973,
        "duration": 3.499
    },
    {
        "text": "with a binary operation, a notion of multiplication between those things, ",
        "start": 607.472,
        "duration": 4.464
    },
    {
        "text": "such that this multiplication satisfies four special rules, or axioms.",
        "start": 611.936,
        "duration": 4.224
    },
    {
        "text": "And all of this can feel, well, kind of random, ",
        "start": 616.9,
        "duration": 2.654
    },
    {
        "text": "especially when it isn't made clear that all of these axioms arise from ",
        "start": 619.554,
        "duration": 3.982
    },
    {
        "text": "the things that must obviously be true when you're thinking about actions ",
        "start": 623.536,
        "duration": 4.093
    },
    {
        "text": "and composing them.",
        "start": 627.629,
        "duration": 1.051
    },
    {
        "text": "To any students among you with such a course in the future, ",
        "start": 629.4,
        "duration": 2.815
    },
    {
        "text": "I would say if you appreciate that the relationship groups have with symmetric actions ",
        "start": 632.215,
        "duration": 4.083
    },
    {
        "text": "is analogous to the relationship numbers have with counts, ",
        "start": 636.298,
        "duration": 2.768
    },
    {
        "text": "it can help to make the course a lot more grounded.",
        "start": 639.066,
        "duration": 2.394
    },
    {
        "text": "An example might help to see why this kind of abstraction is desirable.",
        "start": 642.48,
        "duration": 3.44
    },
    {
        "text": "Consider the symmetries of a cube and the permutation group of four objects.",
        "start": 646.7,
        "duration": 4.28
    },
    {
        "text": "At first, these groups feel very different.",
        "start": 651.58,
        "duration": 2.32
    },
    {
        "text": "You might think of the one on the left as acting on eight corners in ",
        "start": 653.9,
        "duration": 3.597
    },
    {
        "text": "a way that preserves the distance and orientation structure among them.",
        "start": 657.497,
        "duration": 3.703
    },
    {
        "text": "But on the right, we have a completely unconstrained ",
        "start": 661.3,
        "duration": 2.83
    },
    {
        "text": "set of actions on a much smaller set of points.",
        "start": 664.13,
        "duration": 2.51
    },
    {
        "text": "As it happens, though, these two groups are really the same, ",
        "start": 667.48,
        "duration": 2.901
    },
    {
        "text": "in the sense that their multiplication tables will look identical.",
        "start": 670.381,
        "duration": 3.139
    },
    {
        "text": "Anything that you can say about one group will be true of the other.",
        "start": 674.34,
        "duration": 3.6
    },
    {
        "text": "For example, there are eight distinct permutations where applying it three ",
        "start": 678.66,
        "duration": 3.809
    },
    {
        "text": "times in a row gets you back to where you started, not counting the identity.",
        "start": 682.469,
        "duration": 3.911
    },
    {
        "text": "These are the ones that cycle three different elements together.",
        "start": 687.06,
        "duration": 2.68
    },
    {
        "text": "There are also eight rotations of the cube that have this property, ",
        "start": 690.96,
        "duration": 4.459
    },
    {
        "text": "the various 120 and 240 degree rotations about each diagonal.",
        "start": 695.419,
        "duration": 4.001
    },
    {
        "text": "This is no coincidence.",
        "start": 700.04,
        "duration": 1.56
    },
    {
        "text": "The way to phrase this more precisely is to say there is a one-to-one mapping between ",
        "start": 702.68,
        "duration": 4.579
    },
    {
        "text": "rotations of a cube and permutations of four elements, which preserves composition.",
        "start": 707.259,
        "duration": 4.421
    },
    {
        "text": "For example, rotating 180 degrees about the y-axis followed by 180 degrees about ",
        "start": 712.32,
        "duration": 5.363
    },
    {
        "text": "the x-axis gives the same overall effect as rotating 180 degrees around the z-axis.",
        "start": 717.683,
        "duration": 5.497
    },
    {
        "text": "Remember, that's what we mean by a product of two actions.",
        "start": 723.8,
        "duration": 2.4
    },
    {
        "text": "And if you look at the corresponding permutations under a certain one-to-one association, ",
        "start": 726.82,
        "duration": 4.19
    },
    {
        "text": "this product will still be true.",
        "start": 731.01,
        "duration": 1.49
    },
    {
        "text": "Applying the two actions on the left gives the ",
        "start": 732.96,
        "duration": 2.148
    },
    {
        "text": "same overall effect as the one on the right.",
        "start": 735.108,
        "duration": 2.012
    },
    {
        "text": "When you have a correspondence where this remains true for all products, ",
        "start": 738.16,
        "duration": 4.043
    },
    {
        "text": "it's called an isomorphism, which is maybe the most important idea in group theory.",
        "start": 742.203,
        "duration": 4.597
    },
    {
        "text": "This particular isomorphism between cube rotations and permutations of four ",
        "start": 747.74,
        "duration": 4.085
    },
    {
        "text": "objects is a bit subtle, but for the curious among you, ",
        "start": 751.825,
        "duration": 3.01
    },
    {
        "text": "you may enjoy taking a moment to think hard about how the rotations of a cube ",
        "start": 754.835,
        "duration": 4.193
    },
    {
        "text": "permute its four diagonals.",
        "start": 759.028,
        "duration": 1.452
    },
    {
        "text": "In your mathematical life, you'll see more examples of a given ",
        "start": 764.1,
        "duration": 3.13
    },
    {
        "text": "group arising from seemingly unrelated situations, and as you do, ",
        "start": 767.23,
        "duration": 3.279
    },
    {
        "text": "you'll get a better sense for what group theory is all about.",
        "start": 770.509,
        "duration": 3.031
    },
    {
        "text": "Think about how a number like 3 is not really about a particular triplet of things, ",
        "start": 774.32,
        "duration": 4.1
    },
    {
        "text": "it's about all possible triplets of things.",
        "start": 778.42,
        "duration": 2.1
    },
    {
        "text": "In the same way, a group is not really about symmetries of a particular object, ",
        "start": 781.08,
        "duration": 4.231
    },
    {
        "text": "it's an abstract way that things can even be symmetric.",
        "start": 785.311,
        "duration": 2.909
    },
    {
        "text": "There are even plenty of situations where groups come up in a way that does not feel ",
        "start": 788.76,
        "duration": 4.03
    },
    {
        "text": "like a set of symmetric actions at all, just as numbers can do a lot more than count.",
        "start": 792.79,
        "duration": 4.03
    },
    {
        "text": "In fact, seeing the same group come up in different situations is a great way to reveal ",
        "start": 797.74,
        "duration": 4.69
    },
    {
        "text": "unexpected connections between distinct objects, ",
        "start": 802.43,
        "duration": 2.611
    },
    {
        "text": "that's a very common theme in modern math.",
        "start": 805.041,
        "duration": 2.239
    },
    {
        "text": "And once you understand this about groups, it leads you to a natural question, ",
        "start": 808.24,
        "duration": 3.434
    },
    {
        "text": "which will eventually lead to the monster.",
        "start": 811.674,
        "duration": 1.826
    },
    {
        "text": "What are all the groups?",
        "start": 814.08,
        "duration": 1.36
    },
    {
        "text": "But now you're in a position to ask that question in a more sophisticated way.",
        "start": 815.44,
        "duration": 3.84
    },
    {
        "text": "What are all the groups up to isomorphism?",
        "start": 819.54,
        "duration": 2.46
    },
    {
        "text": "Which is to say, we consider two groups to be ",
        "start": 822.58,
        "duration": 2.27
    },
    {
        "text": "the same if there's an isomorphism between them.",
        "start": 824.85,
        "duration": 2.37
    },
    {
        "text": "This is asking something more fundamental than what are all the symmetric things.",
        "start": 829.64,
        "duration": 3.64
    },
    {
        "text": "It's a way of asking, what are all the ways that something can be symmetric?",
        "start": 833.46,
        "duration": 4.12
    },
    {
        "text": "Is there some formula or procedure for producing them all, ",
        "start": 837.68,
        "duration": 3.283
    },
    {
        "text": "some meta-pattern lying at the heart of symmetry itself?",
        "start": 840.963,
        "duration": 3.117
    },
    {
        "text": "This question turns out to be hard, exceedingly hard.",
        "start": 845.96,
        "duration": 4.02
    },
    {
        "text": "For one thing, there's the division between infinite groups, ",
        "start": 850.76,
        "duration": 2.848
    },
    {
        "text": "for example the ones describing the symmetries of a line or a circle, ",
        "start": 853.608,
        "duration": 3.269
    },
    {
        "text": "and finite groups, like the ones we've looked at up to this point.",
        "start": 856.877,
        "duration": 3.083
    },
    {
        "text": "To maintain some hope of sanity, let's limit our view to finite groups.",
        "start": 860.62,
        "duration": 3.3
    },
    {
        "text": "In the same way that numbers can be broken down into their prime factorization, ",
        "start": 865.0,
        "duration": 4.048
    },
    {
        "text": "or molecules can be described based on the atoms within them, ",
        "start": 869.048,
        "duration": 3.138
    },
    {
        "text": "there's a certain way that finite groups can be broken down into a kind of composition ",
        "start": 872.186,
        "duration": 4.403
    },
    {
        "text": "of smaller groups.",
        "start": 876.589,
        "duration": 0.911
    },
    {
        "text": "The ones which can't be broken down any further, ",
        "start": 878.2,
        "duration": 2.554
    },
    {
        "text": "analogous to prime numbers or atoms, are known as the simple groups.",
        "start": 880.754,
        "duration": 3.546
    },
    {
        "text": "To give a hint for why this is useful, remember how we said that ",
        "start": 885.22,
        "duration": 2.935
    },
    {
        "text": "group theory can be used to prove that there's no formula for ",
        "start": 888.155,
        "duration": 2.8
    },
    {
        "text": "a degree 5 polynomial the way there is for quadratic equations?",
        "start": 890.955,
        "duration": 2.845
    },
    {
        "text": "Well, if you're wondering what that proof actually looks like, ",
        "start": 894.52,
        "duration": 3.272
    },
    {
        "text": "it involves showing that if there were some kind of mythical quintic formula, ",
        "start": 897.792,
        "duration": 4.052
    },
    {
        "text": "something which uses only radicals and the basic arithmetic operations, ",
        "start": 901.844,
        "duration": 3.74
    },
    {
        "text": "it would imply that the permutation group on 5 elements decomposes into a ",
        "start": 905.584,
        "duration": 3.844
    },
    {
        "text": "special kind of simple group, known fancifully as the cyclic groups of prime order.",
        "start": 909.428,
        "duration": 4.312
    },
    {
        "text": "But the actual way that this breaks down involves a different kind of simple group, ",
        "start": 914.5,
        "duration": 4.251
    },
    {
        "text": "a different kind of atom, one which polynomial solutions built from radicals would never ",
        "start": 918.751,
        "duration": 4.505
    },
    {
        "text": "allow.",
        "start": 923.256,
        "duration": 0.304
    },
    {
        "text": "That is a super high-level description of course, ",
        "start": 924.8,
        "duration": 2.369
    },
    {
        "text": "with about a semester's worth of details missing, ",
        "start": 927.169,
        "duration": 2.37
    },
    {
        "text": "but the point is that you have this really not obvious fact about a different part of ",
        "start": 929.539,
        "duration": 4.076
    },
    {
        "text": "math whose solutions come from finding the atomic structure of a certain group.",
        "start": 933.615,
        "duration": 3.745
    },
    {
        "text": "This is one of many different examples where understanding the nature of ",
        "start": 937.9,
        "duration": 3.423
    },
    {
        "text": "these simple groups, these atoms, actually matters outside of group theory.",
        "start": 941.323,
        "duration": 3.517
    },
    {
        "text": "The task of categorizing all finite groups breaks down into two steps.",
        "start": 945.8,
        "duration": 3.86
    },
    {
        "text": "One, find all the simple groups, and two, find all of the ways to combine them.",
        "start": 950.12,
        "duration": 4.22
    },
    {
        "text": "The first question is like finding the periodic table, ",
        "start": 954.92,
        "duration": 2.526
    },
    {
        "text": "and the second is a bit like doing all of chemistry thereafter.",
        "start": 957.446,
        "duration": 2.894
    },
    {
        "text": "The good news is that mathematicians have found all of the finite simple groups.",
        "start": 960.88,
        "duration": 4.32
    },
    {
        "text": "Well, more pertinent is that they proved that the ones they found are, ",
        "start": 966.2,
        "duration": 3.598
    },
    {
        "text": "in fact, all the ones out there.",
        "start": 969.798,
        "duration": 1.622
    },
    {
        "text": "It took many decades, tens of thousands of dense pages of advanced math, ",
        "start": 972.08,
        "duration": 3.663
    },
    {
        "text": "hundreds of some of the smartest minds out there, and significant help from computers.",
        "start": 975.743,
        "duration": 4.317
    },
    {
        "text": "But by 2004, with a culminating 12,000 pages to tie up the loose ends, ",
        "start": 980.6,
        "duration": 4.147
    },
    {
        "text": "there was a definitive answer.",
        "start": 984.747,
        "duration": 1.753
    },
    {
        "text": "Many experts agree, this is one of the most monumental ",
        "start": 986.5,
        "duration": 2.973
    },
    {
        "text": "achievements in the history of math.",
        "start": 989.473,
        "duration": 1.947
    },
    {
        "text": "The bad news, though, is that the answer is absurd.",
        "start": 993.26,
        "duration": 2.64
    },
    {
        "text": "There are 18 distinct infinite families of simple groups, ",
        "start": 996.5,
        "duration": 2.938
    },
    {
        "text": "which makes it really tempting to lean into the whole periodic table analogy.",
        "start": 999.438,
        "duration": 3.902
    },
    {
        "text": "But groups are stranger than chemistry, because there are also these 26 ",
        "start": 1003.9,
        "duration": 3.436
    },
    {
        "text": "simple groups that are just left over, they don't fit the other patterns.",
        "start": 1007.336,
        "duration": 3.484
    },
    {
        "text": "These 26 are known as the sporadic groups.",
        "start": 1011.46,
        "duration": 2.32
    },
    {
        "text": "That a field of study rooted in symmetry itself has such a patched ",
        "start": 1014.22,
        "duration": 3.877
    },
    {
        "text": "together fundamental structure is, well I mean it's just bizarre.",
        "start": 1018.097,
        "duration": 3.763
    },
    {
        "text": "It's like the universe was designed by committee.",
        "start": 1022.46,
        "duration": 1.899
    },
    {
        "text": "If you're wondering what we mean by an infinite family, examples might help.",
        "start": 1025.18,
        "duration": 3.26
    },
    {
        "text": "One such family of simple groups includes all of these cyclic groups with prime order.",
        "start": 1028.96,
        "duration": 4.26
    },
    {
        "text": "These are essentially the symmetries of a regular polygon with a prime number of sides, ",
        "start": 1033.859,
        "duration": 4.177
    },
    {
        "text": "but where you're not allowed to flip the polygon over.",
        "start": 1038.036,
        "duration": 2.563
    },
    {
        "text": "Another of these infinite families is very similar to the permutation groups we saw ",
        "start": 1041.18,
        "duration": 4.437
    },
    {
        "text": "earlier, but there's the tiniest constraint on how they're allowed to shuffle n items.",
        "start": 1045.617,
        "duration": 4.543
    },
    {
        "text": "If they act on 5 or more elements, these groups are simple.",
        "start": 1051.64,
        "duration": 3.26
    },
    {
        "text": "Which incidentally is heavily related to why polynomials with degree ",
        "start": 1056.08,
        "duration": 3.49
    },
    {
        "text": "5 or more have solutions that can't be written down using radicals.",
        "start": 1059.57,
        "duration": 3.39
    },
    {
        "text": "The other 16 families are notably more complicated, ",
        "start": 1064.04,
        "duration": 2.622
    },
    {
        "text": "and I'm told that there's at least a little ambiguity in how to organize ",
        "start": 1066.662,
        "duration": 3.682
    },
    {
        "text": "them into cleanly distinct families without overlap, ",
        "start": 1070.344,
        "duration": 2.673
    },
    {
        "text": "but what everybody agrees on is that the 26 sporadic groups stand out ",
        "start": 1073.017,
        "duration": 3.53
    },
    {
        "text": "as something very different.",
        "start": 1076.547,
        "duration": 1.413
    },
    {
        "text": "The largest of these sporadic groups is known, thanks to John Conway, ",
        "start": 1078.66,
        "duration": 3.587
    },
    {
        "text": "as the monster group, and its size is the number I mentioned at the start.",
        "start": 1082.247,
        "duration": 3.793
    },
    {
        "text": "The second largest, and I promise this isn't a joke, is known as the baby monster group.",
        "start": 1086.74,
        "duration": 4.38
    },
    {
        "text": "Together with the baby monster, 19 of these sporadic groups are in a certain ",
        "start": 1091.98,
        "duration": 4.093
    },
    {
        "text": "sense children of the monster, and Robert Gries called these 20 the happy family.",
        "start": 1096.073,
        "duration": 4.307
    },
    {
        "text": "He also called the other six, which don't even fit that pattern, the pariahs.",
        "start": 1100.92,
        "duration": 4.02
    },
    {
        "text": "As if to compensate for how complicated the underlying math here is, ",
        "start": 1105.48,
        "duration": 3.213
    },
    {
        "text": "the experts really let loose on their whimsy while naming things.",
        "start": 1108.693,
        "duration": 3.027
    },
    {
        "text": "Let me emphasize, having a group which is big is not that big a deal, ",
        "start": 1112.6,
        "duration": 3.783
    },
    {
        "text": "but the idea that one of the fundamental building blocks for one of the most ",
        "start": 1116.383,
        "duration": 4.162
    },
    {
        "text": "fundamental ideas in math comes in a collection that just abruptly stops around ",
        "start": 1120.545,
        "duration": 4.324
    },
    {
        "text": "8x10 to the 53.",
        "start": 1124.869,
        "duration": 0.811
    },
    {
        "text": "That's weird.",
        "start": 1126.36,
        "duration": 0.76
    },
    {
        "text": "Now, at this point, given that I introduced groups as symmetries, ",
        "start": 1128.64,
        "duration": 3.364
    },
    {
        "text": "a collection of actions, you might wonder what it is that the monster acts on.",
        "start": 1132.004,
        "duration": 3.976
    },
    {
        "text": "What object does it describe the symmetries of?",
        "start": 1136.42,
        "duration": 2.64
    },
    {
        "text": "Well, there is an answer, but it doesn't fit into two or three dimensions to draw, ",
        "start": 1139.82,
        "duration": 3.986
    },
    {
        "text": "nor does it fit into four or five.",
        "start": 1143.806,
        "duration": 1.634
    },
    {
        "text": "Instead, to see what the monster acts on, we would have to jump up to...",
        "start": 1146.2,
        "duration": 3.92
    },
    {
        "text": "Wait for it...",
        "start": 1150.12,
        "duration": 1.4
    },
    {
        "text": "196,883 dimensions.",
        "start": 1154.2,
        "duration": 1.96
    },
    {
        "text": "Just describing one of the elements of this group takes about 4 GB of data, ",
        "start": 1157.2,
        "duration": 3.946
    },
    {
        "text": "even though plenty of groups that are way bigger have a much smaller computational ",
        "start": 1161.146,
        "duration": 4.31
    },
    {
        "text": "description.",
        "start": 1165.456,
        "duration": 0.624
    },
    {
        "text": "The permutation group on 101 elements was, if you'll recall, ",
        "start": 1166.78,
        "duration": 3.189
    },
    {
        "text": "dramatically bigger, but we can describe each one of its elements with very little data, ",
        "start": 1169.969,
        "duration": 4.653
    },
    {
        "text": "for example a list of 100 numbers.",
        "start": 1174.622,
        "duration": 1.778
    },
    {
        "text": "Why the Sporadic Groups?",
        "start": 1182.44,
        "duration": 0.44
    },
    {
        "text": "No one really understands why the sporadic groups, ",
        "start": 1182.88,
        "duration": 2.594
    },
    {
        "text": "and the monster in particular, are there.",
        "start": 1185.474,
        "duration": 2.086
    },
    {
        "text": "Maybe in a few decades there will be a clearer answer, ",
        "start": 1188.22,
        "duration": 2.659
    },
    {
        "text": "maybe one of you will come up with it, but despite knowing that they are ",
        "start": 1190.879,
        "duration": 3.53
    },
    {
        "text": "deeply fundamental to math, and arguably to physics as well, ",
        "start": 1194.409,
        "duration": 2.95
    },
    {
        "text": "a lot about them remains mysterious.",
        "start": 1197.359,
        "duration": 1.741
    },
    {
        "text": "In the 1970s, mathematician John McKay was making a switch from studying ",
        "start": 1200.08,
        "duration": 4.576
    },
    {
        "text": "group theory to an adjacent field, and he noticed that a number very similar ",
        "start": 1204.656,
        "duration": 4.828
    },
    {
        "text": "to this 196,883 showed up in a completely unrelated context, or at least almost.",
        "start": 1209.484,
        "duration": 5.016
    },
    {
        "text": "A number one bigger than this was in the series expansion of a ",
        "start": 1215.02,
        "duration": 3.096
    },
    {
        "text": "fundamental function in a totally different part of math, ",
        "start": 1218.116,
        "duration": 2.852
    },
    {
        "text": "relevant to these things called modular forms and elliptic functions.",
        "start": 1220.968,
        "duration": 3.392
    },
    {
        "text": "Assuming that this was more than a coincidence seemed crazy, ",
        "start": 1225.04,
        "duration": 2.909
    },
    {
        "text": "enough that it was playfully deemed moonshine by John Conway.",
        "start": 1227.949,
        "duration": 2.911
    },
    {
        "text": "But after more numerical coincidences like this were noticed, ",
        "start": 1230.86,
        "duration": 3.109
    },
    {
        "text": "it gave rise to what became known as the monstrous moonshine conjecture.",
        "start": 1233.969,
        "duration": 3.611
    },
    {
        "text": "Whimsical names just don't stop.",
        "start": 1238.18,
        "duration": 1.46
    },
    {
        "text": "This was proved by Richard Borcherds in 1992, solidifying a connection ",
        "start": 1240.52,
        "duration": 3.81
    },
    {
        "text": "between very different parts of math that at first glance seemed crazy.",
        "start": 1244.33,
        "duration": 3.81
    },
    {
        "text": "Six years later, by the way, he won the Fields Medal, ",
        "start": 1248.92,
        "duration": 2.427
    },
    {
        "text": "in part for the significance of this proof.",
        "start": 1251.347,
        "duration": 1.933
    },
    {
        "text": "And related to this moonshine is a connection between the monster and string theory.",
        "start": 1253.98,
        "duration": 3.56
    },
    {
        "text": "Maybe it shouldn't come as a surprise that something that arises from ",
        "start": 1257.54,
        "duration": 3.357
    },
    {
        "text": "symmetry itself is relevant to physics, but in light of just how random ",
        "start": 1260.897,
        "duration": 3.453
    },
    {
        "text": "the monster seems at first glance, this connection still elicits a double take.",
        "start": 1264.35,
        "duration": 3.79
    },
    {
        "text": "To me, the monster and its absurd size is a nice reminder ",
        "start": 1269.6,
        "duration": 3.416
    },
    {
        "text": "that fundamental objects are not necessarily simple.",
        "start": 1273.016,
        "duration": 3.064
    },
    {
        "text": "The universe doesn't really care if its final answers look clean.",
        "start": 1276.56,
        "duration": 3.2
    },
    {
        "text": "They are what they are by logical necessity, with no ",
        "start": 1280.1,
        "duration": 2.457
    },
    {
        "text": "concern over how easily we'll be able to understand them.",
        "start": 1282.557,
        "duration": 2.643
    }
]