[
    {
        "text": "You guys know Henry from MinutePhysics, right?",
        "start": 2.56,
        "duration": 2.08
    },
    {
        "text": "Well, he and I just made a video on a certain quantum mechanical topic, ",
        "start": 4.96,
        "duration": 3.443
    },
    {
        "text": "Bell's inequalities.",
        "start": 8.403,
        "duration": 0.957
    },
    {
        "text": "It's a really mind-warping topic that not enough people know about, ",
        "start": 9.8,
        "duration": 3.335
    },
    {
        "text": "and even though it's a quantum thing, it's based on some surprisingly simple math, ",
        "start": 13.135,
        "duration": 4.071
    },
    {
        "text": "and you should definitely check it out.",
        "start": 17.206,
        "duration": 1.914
    },
    {
        "text": "For this video, we have in mind those viewers who ",
        "start": 19.88,
        "duration": 2.148
    },
    {
        "text": "actually want to learn some quantum mechanics more deeply.",
        "start": 22.028,
        "duration": 2.492
    },
    {
        "text": "And obviously it's a huge topic, nowhere near the scope of a single video, ",
        "start": 24.92,
        "duration": 3.998
    },
    {
        "text": "but the question we asked was what topic could we present that's not meant ",
        "start": 28.918,
        "duration": 3.998
    },
    {
        "text": "to be some eye-catching piece of quantum weirdness, ",
        "start": 32.916,
        "duration": 2.772
    },
    {
        "text": "but which actually lays down some useful foundations for anyone who wants ",
        "start": 35.688,
        "duration": 3.945
    },
    {
        "text": "to learn this field?",
        "start": 39.633,
        "duration": 1.067
    },
    {
        "text": "What topic would set the right intuitions for someone before they dove into, ",
        "start": 41.32,
        "duration": 3.887
    },
    {
        "text": "say, the Feynman lectures?",
        "start": 45.207,
        "duration": 1.313
    },
    {
        "text": "Well, a natural place to start, where quantum mechanics itself started, is light.",
        "start": 47.4,
        "duration": 4.14
    },
    {
        "text": "Specifically, if you want to learn quantum, you have to have an ",
        "start": 51.88,
        "duration": 2.7
    },
    {
        "text": "understanding of waves and how they're described mathematically.",
        "start": 54.58,
        "duration": 2.7
    },
    {
        "text": "And what we'd like to build to here is the relationship between the energy ",
        "start": 57.72,
        "duration": 3.99
    },
    {
        "text": "in a purely classical wave and the probabilities that govern quantum behavior.",
        "start": 61.71,
        "duration": 4.15
    },
    {
        "text": "In fact, we'll actually spend most of the time talking through the pre-quantum ",
        "start": 66.7,
        "duration": 3.587
    },
    {
        "text": "understanding of light, since that sets up a lot of the relevant wave mechanics.",
        "start": 70.287,
        "duration": 3.633
    },
    {
        "text": "The thing is, a lot of ideas from quantum mechanics, ",
        "start": 74.42,
        "duration": 2.522
    },
    {
        "text": "like describing states as superpositions with various amplitudes and phases, ",
        "start": 76.942,
        "duration": 3.664
    },
    {
        "text": "come up in the context of classical waves in a way that doesn't involve any of the ",
        "start": 80.606,
        "duration": 3.949
    },
    {
        "text": "quantum weirdness people might be familiar with.",
        "start": 84.555,
        "duration": 2.285
    },
    {
        "text": "This also helps to appreciate what's actually different in quantum mechanics, ",
        "start": 87.12,
        "duration": 3.514
    },
    {
        "text": "namely certain restrictions on how much energy these waves can have, ",
        "start": 90.634,
        "duration": 3.109
    },
    {
        "text": "how they behave when measured, and quantum entanglement, ",
        "start": 93.743,
        "duration": 2.569
    },
    {
        "text": "though we won't cover entanglement in this video.",
        "start": 96.312,
        "duration": 2.208
    },
    {
        "text": "So we'll start with the late 1800s understanding ",
        "start": 98.84,
        "duration": 2.899
    },
    {
        "text": "of light as waves in the electromagnetic field.",
        "start": 101.739,
        "duration": 2.781
    },
    {
        "text": "Here, let's break that down a bit.",
        "start": 105.0,
        "duration": 1.32
    },
    {
        "text": "The electric field is a vector field, and that means every point in space has ",
        "start": 106.52,
        "duration": 4.0
    },
    {
        "text": "some arrow attached to it, indicating the direction and strength of the field.",
        "start": 110.52,
        "duration": 4.0
    },
    {
        "text": "Now, the physical meaning of those arrows is that if you have some charged particle in ",
        "start": 115.2,
        "duration": 4.111
    },
    {
        "text": "space, there's going to be a force on that particle in the direction of the arrow, ",
        "start": 119.311,
        "duration": 3.922
    },
    {
        "text": "and it's proportional to the length of the arrow and the specific charge of the particle.",
        "start": 123.233,
        "duration": 4.207
    },
    {
        "text": "Likewise, the magnetic field is another vector field, ",
        "start": 128.24,
        "duration": 2.898
    },
    {
        "text": "where now the physical meaning of each arrow is that when a charged particle is ",
        "start": 131.138,
        "duration": 4.293
    },
    {
        "text": "moving through that space, there's going to be a force perpendicular to both its ",
        "start": 135.431,
        "duration": 4.348
    },
    {
        "text": "direction of motion and to the direction of the magnetic field, ",
        "start": 139.779,
        "duration": 3.435
    },
    {
        "text": "and the strength of that force is proportional to the charge of the particle, ",
        "start": 143.214,
        "duration": 4.186
    },
    {
        "text": "its velocity, and the length of the magnetic field arrow.",
        "start": 147.4,
        "duration": 3.06
    },
    {
        "text": "For example, a wire with a current of moving charges next to ",
        "start": 150.96,
        "duration": 3.182
    },
    {
        "text": "a magnet is either pushed or pulled by that magnetic field.",
        "start": 154.142,
        "duration": 3.078
    },
    {
        "text": "A kind of culmination of the 19th century physics understanding of ",
        "start": 157.7,
        "duration": 3.321
    },
    {
        "text": "how these two fields work are Maxwell's equations, ",
        "start": 161.021,
        "duration": 2.528
    },
    {
        "text": "which among other things describe how each of these fields can cause ",
        "start": 163.549,
        "duration": 3.42
    },
    {
        "text": "a change to the other.",
        "start": 166.969,
        "duration": 1.091
    },
    {
        "text": "Specifically, what Maxwell's equations tell us is that when the electric ",
        "start": 168.66,
        "duration": 4.008
    },
    {
        "text": "field arrows seem to be forming a loop around some region, ",
        "start": 172.668,
        "duration": 3.239
    },
    {
        "text": "the magnetic field will be increasing inside that region perpendicular to ",
        "start": 175.907,
        "duration": 4.063
    },
    {
        "text": "the plane of the loop, and symmetrically, such a loop in the magnetic field ",
        "start": 179.97,
        "duration": 4.173
    },
    {
        "text": "corresponds to a change in the electric field within it perpendicular to ",
        "start": 184.143,
        "duration": 4.009
    },
    {
        "text": "the plane of the loop.",
        "start": 188.152,
        "duration": 1.208
    },
    {
        "text": "Now, the specifics for how exactly these equations work is really beautiful ",
        "start": 190.06,
        "duration": 4.027
    },
    {
        "text": "and worth a full video on its own, but all you need to know for now is that ",
        "start": 194.087,
        "duration": 4.027
    },
    {
        "text": "one natural consequence of this mutual interplay in how changes to one field ",
        "start": 198.114,
        "duration": 4.08
    },
    {
        "text": "cause changes to the other in its neighboring regions is that you get these ",
        "start": 202.194,
        "duration": 4.027
    },
    {
        "text": "propagating waves where the electric field and magnetic fields are oscillating ",
        "start": 206.221,
        "duration": 4.186
    },
    {
        "text": "perpendicular to each other and perpendicular to the direction of propagation.",
        "start": 210.407,
        "duration": 4.133
    },
    {
        "text": "When you hear the term electromagnetic radiation, ",
        "start": 215.12,
        "duration": 2.716
    },
    {
        "text": "which refers to things like radio waves and visible light, ",
        "start": 217.836,
        "duration": 3.205
    },
    {
        "text": "this is what it's talking about, propagating waves in both the ",
        "start": 221.041,
        "duration": 3.423
    },
    {
        "text": "electric and magnetic fields.",
        "start": 224.464,
        "duration": 1.576
    },
    {
        "text": "Of course, it's now almost mainstream to know of light as electromagnetic radiation, ",
        "start": 227.04,
        "duration": 3.929
    },
    {
        "text": "but it's neat to think about just how surprising this was in Maxwell's time, ",
        "start": 230.969,
        "duration": 3.56
    },
    {
        "text": "that these fields that have to do with forces on charged particles and magnets not only ",
        "start": 234.529,
        "duration": 4.069
    },
    {
        "text": "have something to do with light, but that what light is is a propagating wave as these ",
        "start": 238.598,
        "duration": 4.022
    },
    {
        "text": "two fields dance with each other causing this mutual oscillation of increasing and ",
        "start": 242.62,
        "duration": 3.837
    },
    {
        "text": "decreasing field strength.",
        "start": 246.457,
        "duration": 1.203
    },
    {
        "text": "With this as a visual, let's take a moment to lay down the math used to describe waves.",
        "start": 248.24,
        "duration": 4.36
    },
    {
        "text": "It'll still be purely classical, but ideas that are core to quantum mechanics, ",
        "start": 253.16,
        "duration": 4.243
    },
    {
        "text": "like superposition, amplitudes, phases, all of these come up in this context, ",
        "start": 257.403,
        "duration": 4.189
    },
    {
        "text": "and I would argue with a clearer motivation for what they actually mean.",
        "start": 261.592,
        "duration": 3.868
    },
    {
        "text": "Take this wave and think of it as directed straight out of the screen, towards your face.",
        "start": 266.38,
        "duration": 3.9
    },
    {
        "text": "And let's go ahead and ignore the magnetic field right now, ",
        "start": 270.94,
        "duration": 2.585
    },
    {
        "text": "just looking at how the electric field oscillates.",
        "start": 273.525,
        "duration": 2.155
    },
    {
        "text": "And also, we're only going to focus on one of these vectors oscillating ",
        "start": 275.68,
        "duration": 3.825
    },
    {
        "text": "in the plane of the screen, which we'll think of as the xy plane.",
        "start": 279.505,
        "duration": 3.455
    },
    {
        "text": "If it oscillates horizontally, like this, we say that the light is horizontally polarized.",
        "start": 283.58,
        "duration": 4.74
    },
    {
        "text": "So the y component of this electric field is 0 at all times, ",
        "start": 289.08,
        "duration": 4.315
    },
    {
        "text": "and we might write the x component as something like cosine of 2 pi times ft, ",
        "start": 293.395,
        "duration": 5.518
    },
    {
        "text": "where f represents some frequency, and t is time.",
        "start": 298.913,
        "duration": 3.467
    },
    {
        "text": "So if f was 1, for example, that means it takes exactly 1 ",
        "start": 303.0,
        "duration": 3.489
    },
    {
        "text": "second for this cosine function to go through a full cycle.",
        "start": 306.489,
        "duration": 3.551
    },
    {
        "text": "For a lower frequency, that would mean it takes more ",
        "start": 312.52,
        "duration": 2.556
    },
    {
        "text": "time for the cosine to go through its full cycle.",
        "start": 315.076,
        "duration": 2.364
    },
    {
        "text": "As the value t increases, the inside of this cosine function increases more slowly.",
        "start": 318.02,
        "duration": 5.38
    },
    {
        "text": "Also we're going to include another term in here, phi, called the phase shift, ",
        "start": 324.46,
        "duration": 4.267
    },
    {
        "text": "which tells us where this vector is in its cycle at time t equals 0.",
        "start": 328.727,
        "duration": 3.673
    },
    {
        "text": "You'll see why that matters in just a moment.",
        "start": 332.92,
        "duration": 1.56
    },
    {
        "text": "By default, cosine only oscillates between negative 1 and 1, ",
        "start": 335.22,
        "duration": 3.694
    },
    {
        "text": "so let's put another term in front, a, that gives us the amplitude of this wave.",
        "start": 338.914,
        "duration": 4.846
    },
    {
        "text": "One more thing, just to make things look a little more like they often do in ",
        "start": 344.58,
        "duration": 3.458
    },
    {
        "text": "quantum mechanics, instead of writing it as a column vector, like this, ",
        "start": 348.038,
        "duration": 3.234
    },
    {
        "text": "I'm going to separate it out into two different components using these symbols ",
        "start": 351.272,
        "duration": 3.549
    },
    {
        "text": "called kets.",
        "start": 354.821,
        "duration": 0.539
    },
    {
        "text": "This ket here indicates a unit vector in the horizontal direction, ",
        "start": 355.9,
        "duration": 4.276
    },
    {
        "text": "and this ket here represents a unit vector in the vertical direction.",
        "start": 360.176,
        "duration": 4.404
    },
    {
        "text": "If the light is vertically polarized, meaning the electric field is ",
        "start": 366.94,
        "duration": 3.927
    },
    {
        "text": "wiggling purely in the up and down direction, its equation might look like this, ",
        "start": 370.867,
        "duration": 4.679
    },
    {
        "text": "where the horizontal component is now 0, and the vertical component ",
        "start": 375.546,
        "duration": 3.928
    },
    {
        "text": "is a cosine with some frequency, amplitude, and phase shift.",
        "start": 379.474,
        "duration": 3.466
    },
    {
        "text": "Now if you have two distinct waves, two ways of wiggling through ",
        "start": 383.64,
        "duration": 3.613
    },
    {
        "text": "space over time that solve Maxwell's equations, ",
        "start": 387.253,
        "duration": 2.668
    },
    {
        "text": "then adding both of these together gives another valid wave, at least in a vacuum.",
        "start": 389.921,
        "duration": 4.559
    },
    {
        "text": "That is, at each point in time, add these two vectors tip to tail to get a new vector.",
        "start": 395.16,
        "duration": 4.86
    },
    {
        "text": "Doing this at all points in space and all points in time gives a new, ",
        "start": 400.62,
        "duration": 3.638
    },
    {
        "text": "valid solution to Maxwell's equations, at least this is all true in a vacuum.",
        "start": 404.258,
        "duration": 4.002
    },
    {
        "text": "This is because Maxwell's equations in a vacuum are what's called linear equations.",
        "start": 408.76,
        "duration": 4.3
    },
    {
        "text": "They're essentially a combination of derivatives acting on the electric and magnetic ",
        "start": 413.46,
        "duration": 5.066
    },
    {
        "text": "fields to give 0, so if one field f1 satisfies this equation and another field f2 ",
        "start": 418.526,
        "duration": 4.889
    },
    {
        "text": "satisfies it, then their sum, f1 plus f2, also satisfies it, since derivatives are linear.",
        "start": 423.415,
        "duration": 5.365
    },
    {
        "text": "So the sum of two or more solutions to Maxwell's ",
        "start": 429.2,
        "duration": 2.804
    },
    {
        "text": "equations is also a solution to Maxwell's equations.",
        "start": 432.004,
        "duration": 2.976
    },
    {
        "text": "This new wave is called a superposition of the first two.",
        "start": 436.42,
        "duration": 4.12
    },
    {
        "text": "And here, superposition essentially just means sum, or in some context, weighted sum, ",
        "start": 440.74,
        "duration": 4.491
    },
    {
        "text": "since if you include some kind of amplitude and phase shift in each of these components, ",
        "start": 445.231,
        "duration": 4.649
    },
    {
        "text": "it can still be called a superposition of the two original vectors.",
        "start": 449.88,
        "duration": 3.5
    },
    {
        "text": "Now right now, the resulting superposition is a wave wiggling in the diagonal direction, ",
        "start": 454.3,
        "duration": 4.865
    },
    {
        "text": "but if the horizontal and vertical components were out of phase with each other, ",
        "start": 459.165,
        "duration": 4.427
    },
    {
        "text": "which might happen if you increase the phase shift in one of them, ",
        "start": 463.592,
        "duration": 3.663
    },
    {
        "text": "their sum might instead trace out some sort of ellipse, ",
        "start": 467.255,
        "duration": 3.061
    },
    {
        "text": "and in the case where the phases are exactly 90 degrees out of sync with each other, ",
        "start": 470.316,
        "duration": 4.646
    },
    {
        "text": "and the amplitudes are both equal, this is what we call circularly polarized light.",
        "start": 474.962,
        "duration": 4.538
    },
    {
        "text": "This by the way is why it's important to keep track not just of the amplitude in ",
        "start": 480.18,
        "duration": 4.506
    },
    {
        "text": "each direction but also of the phase, it affects the way the two waves add together.",
        "start": 484.686,
        "duration": 4.674
    },
    {
        "text": "That's also an important idea that carries over to quantum, ",
        "start": 492.66,
        "duration": 2.596
    },
    {
        "text": "and underlies some of the things that look confusing at first.",
        "start": 495.256,
        "duration": 2.684
    },
    {
        "text": "And here's another important idea, we're describing waves by adding ",
        "start": 498.72,
        "duration": 3.272
    },
    {
        "text": "together the horizontal and vertical components, ",
        "start": 501.992,
        "duration": 2.357
    },
    {
        "text": "but we could also choose to describe everything with respect to different directions.",
        "start": 504.349,
        "duration": 4.091
    },
    {
        "text": "I mean, you could describe waves as some superposition ",
        "start": 509.02,
        "duration": 2.982
    },
    {
        "text": "of the diagonal and the anti-diagonal directions.",
        "start": 512.002,
        "duration": 2.657
    },
    {
        "text": "In that case, vertically polarized light would actually be a ",
        "start": 515.2,
        "duration": 3.131
    },
    {
        "text": "superposition of these two diagonal wiggling directions, ",
        "start": 518.331,
        "duration": 2.927
    },
    {
        "text": "at least when both are in phase with each other and have the same magnitude.",
        "start": 521.258,
        "duration": 3.902
    },
    {
        "text": "The choice of which directions you write things in terms of is called a basis, ",
        "start": 526.34,
        "duration": 3.945
    },
    {
        "text": "and which basis is nicest to work with, well that typically ",
        "start": 530.285,
        "duration": 2.997
    },
    {
        "text": "depends on what you're doing with the light.",
        "start": 533.282,
        "duration": 2.198
    },
    {
        "text": "For example, if you have a polarizing filter, like that from a set ",
        "start": 535.88,
        "duration": 3.766
    },
    {
        "text": "of polarized sunglasses, the way these work is by absorbing the ",
        "start": 539.646,
        "duration": 3.598
    },
    {
        "text": "energy from electromagnetic oscillations in some particular direction.",
        "start": 543.244,
        "duration": 3.936
    },
    {
        "text": "A vertically oriented polarizer, for example, would absorb ",
        "start": 547.88,
        "duration": 3.052
    },
    {
        "text": "all of the energy from these waves along the horizontal directions, ",
        "start": 550.932,
        "duration": 3.518
    },
    {
        "text": "at least classically that's how you might think about it.",
        "start": 554.45,
        "duration": 2.95
    },
    {
        "text": "So, if you're analyzing light and it's passing through a filter like this, ",
        "start": 557.84,
        "duration": 3.658
    },
    {
        "text": "it's nice to describe it with respect to the horizontal and vertical directions.",
        "start": 561.498,
        "duration": 3.902
    },
    {
        "text": "That way, what you can say is that whatever light passes through ",
        "start": 565.86,
        "duration": 3.575
    },
    {
        "text": "the filter is just the vertical component of the original wave.",
        "start": 569.435,
        "duration": 3.465
    },
    {
        "text": "But if you had a filter oriented, say, diagonally, ",
        "start": 576.82,
        "duration": 2.657
    },
    {
        "text": "well then it would be convenient to describe things as a superposition ",
        "start": 579.477,
        "duration": 3.699
    },
    {
        "text": "of that diagonal direction and its perpendicular anti-diagonal direction.",
        "start": 583.176,
        "duration": 3.804
    },
    {
        "text": "These ideas will carry over almost word for word to the quantum case.",
        "start": 589.08,
        "duration": 4.12
    },
    {
        "text": "Quantum states, much like this wiggling direction of our wave, ",
        "start": 593.84,
        "duration": 3.117
    },
    {
        "text": "are described as a superposition of multiple base states, ",
        "start": 596.957,
        "duration": 2.871
    },
    {
        "text": "where you have many choices for what base states to use.",
        "start": 599.828,
        "duration": 2.772
    },
    {
        "text": "And just like with classical waves, the components of such a ",
        "start": 603.06,
        "duration": 2.659
    },
    {
        "text": "superposition will have both an amplitude and a phase of some kind.",
        "start": 605.719,
        "duration": 2.921
    },
    {
        "text": "And by the way, for those of you who do read more into quantum mechanics, ",
        "start": 609.32,
        "duration": 3.097
    },
    {
        "text": "you'll find that these components are actually given using a single complex number, ",
        "start": 612.417,
        "duration": 3.517
    },
    {
        "text": "rather than a cosine expression like this one.",
        "start": 615.934,
        "duration": 1.926
    },
    {
        "text": "One way to think of this is that complex numbers are just a very convenient and ",
        "start": 618.32,
        "duration": 3.61
    },
    {
        "text": "natural mathematical way to encode an amplitude and a phase with a single value.",
        "start": 621.93,
        "duration": 3.61
    },
    {
        "text": "That can make things a little confusing because it's hard to visualize a pair of ",
        "start": 626.26,
        "duration": 3.51
    },
    {
        "text": "complex numbers, which is what would describe a superposition of two base states.",
        "start": 629.77,
        "duration": 3.51
    },
    {
        "text": "But you can think about the use of complex numbers throughout ",
        "start": 633.7,
        "duration": 2.747
    },
    {
        "text": "quantum mechanics as a result of its underlying wavy nature, ",
        "start": 636.447,
        "duration": 2.704
    },
    {
        "text": "and this need to encapsulate the amplitude and the phase for each direction.",
        "start": 639.151,
        "duration": 3.369
    },
    {
        "text": "Okay, just one quick point before getting into the quantum.",
        "start": 643.9,
        "duration": 2.36
    },
    {
        "text": "Look at one of these waves, and focus just on ",
        "start": 646.76,
        "duration": 2.206
    },
    {
        "text": "the electric field portion like we were before.",
        "start": 648.966,
        "duration": 2.254
    },
    {
        "text": "Classically, we think about the energy of a wave like ",
        "start": 651.82,
        "duration": 2.661
    },
    {
        "text": "this as being proportional to the square of its amplitude.",
        "start": 654.481,
        "duration": 2.859
    },
    {
        "text": "And I want you to notice how well this lines up with the Pythagorean theorem.",
        "start": 658.18,
        "duration": 3.1
    },
    {
        "text": "If you were to describe this wave as a superposition of a horizontal ",
        "start": 661.94,
        "duration": 4.767
    },
    {
        "text": "component with amplitude Ax, and a vertical component with amplitude Ay, ",
        "start": 666.707,
        "duration": 5.043
    },
    {
        "text": "then its energy density is proportional to Ax2 plus Ay2.",
        "start": 671.75,
        "duration": 3.87
    },
    {
        "text": "And you can think of this in two different ways.",
        "start": 676.22,
        "duration": 1.84
    },
    {
        "text": "Either it's because you're adding up the energies of each component in the superposition, ",
        "start": 678.06,
        "duration": 5.072
    },
    {
        "text": "or it's just that you're figuring out the new amplitude using the ",
        "start": 683.132,
        "duration": 3.72
    },
    {
        "text": "Pythagorean theorem and taking the square.",
        "start": 686.852,
        "duration": 2.368
    },
    {
        "text": "Isn't that nice?",
        "start": 689.82,
        "duration": 0.58
    },
    {
        "text": "In the classical understanding of light, you should be able to dial this energy ",
        "start": 691.26,
        "duration": 3.62
    },
    {
        "text": "up and down continuously however you want by changing the amplitude of the wave.",
        "start": 694.88,
        "duration": 3.62
    },
    {
        "text": "But what physicists started to notice in the late 19th and early 20th ",
        "start": 698.68,
        "duration": 3.461
    },
    {
        "text": "centuries was that this energy actually seems to come in discrete amounts.",
        "start": 702.141,
        "duration": 3.659
    },
    {
        "text": "Specifically, the energy of one of these electromagnetic waves always seems to ",
        "start": 706.32,
        "duration": 3.712
    },
    {
        "text": "come as an integer multiple of a specific constant times the frequency of that wave.",
        "start": 710.032,
        "duration": 3.948
    },
    {
        "text": "We now call this constant Planck's constant, commonly denoting it with the letter h.",
        "start": 714.34,
        "duration": 4.26
    },
    {
        "text": "Physically what this means is that whenever this wave trades its ",
        "start": 719.18,
        "duration": 3.061
    },
    {
        "text": "energy with something else like an electron, the amount of energy ",
        "start": 722.241,
        "duration": 3.109
    },
    {
        "text": "it trades off is always an integer multiple of h times its frequency.",
        "start": 725.35,
        "duration": 3.25
    },
    {
        "text": "Importantly, this means there is some minimal non-zero ",
        "start": 729.34,
        "duration": 3.118
    },
    {
        "text": "energy level for waves of a given frequency, hf.",
        "start": 732.458,
        "duration": 2.722
    },
    {
        "text": "If you have an electromagnetic wave with this frequency and energy, ",
        "start": 735.5,
        "duration": 3.319
    },
    {
        "text": "you cannot make it smaller without eliminating it entirely.",
        "start": 738.819,
        "duration": 2.881
    },
    {
        "text": "That feels weird when the conception of a wave ",
        "start": 742.36,
        "duration": 2.176
    },
    {
        "text": "is a nice continuously oscillating vector field.",
        "start": 744.536,
        "duration": 2.224
    },
    {
        "text": "But that's not how the universe works as late 19th ",
        "start": 747.14,
        "duration": 2.324
    },
    {
        "text": "and early 20th century experiments started to expose.",
        "start": 749.464,
        "duration": 2.416
    },
    {
        "text": "In fact I've done a video about this called the origin of quantum mechanics.",
        "start": 752.48,
        "duration": 2.86
    },
    {
        "text": "However, it's worth noting that this phenomenon is actually ",
        "start": 756.46,
        "duration": 2.883
    },
    {
        "text": "common in waves when they're constrained in certain ways, ",
        "start": 759.343,
        "duration": 2.788
    },
    {
        "text": "like in pipes or instrument strings, and it's called harmonics.",
        "start": 762.131,
        "duration": 3.029
    },
    {
        "text": "What's weird is that electromagnetic waves do this in free space, ",
        "start": 765.68,
        "duration": 3.366
    },
    {
        "text": "even when they're not constrained.",
        "start": 769.046,
        "duration": 1.734
    },
    {
        "text": "And what do we call an electromagnetic wave with this minimal possible energy?",
        "start": 771.58,
        "duration": 3.44
    },
    {
        "text": "A photon.",
        "start": 775.52,
        "duration": 0.58
    },
    {
        "text": "But like I said, the math used to describe classical ",
        "start": 776.86,
        "duration": 2.998
    },
    {
        "text": "electromagnetic waves carries over to describing a photon.",
        "start": 779.858,
        "duration": 3.282
    },
    {
        "text": "It might have, say, a 45 degree diagonal polarization, ",
        "start": 783.7,
        "duration": 2.933
    },
    {
        "text": "which can be described as a superposition of a purely horizontal state ",
        "start": 786.633,
        "duration": 3.787
    },
    {
        "text": "and a purely vertical state, where each one of these components has some ",
        "start": 790.42,
        "duration": 3.893
    },
    {
        "text": "amplitude and phase.",
        "start": 794.313,
        "duration": 1.067
    },
    {
        "text": "And with a different choice in basis, that same state might ",
        "start": 796.22,
        "duration": 2.689
    },
    {
        "text": "be described as a superposition of two other directions.",
        "start": 798.909,
        "duration": 2.511
    },
    {
        "text": "All of this is stuff you'd see if you started reading more into quantum mechanics.",
        "start": 802.04,
        "duration": 3.76
    },
    {
        "text": "But this superposition has a different interpretation than before, and it has to.",
        "start": 806.32,
        "duration": 5.08
    },
    {
        "text": "Let's say you were thinking of this diagonally polarized photon kind of classically, ",
        "start": 811.88,
        "duration": 4.015
    },
    {
        "text": "and you said it has an amplitude of one unit for some appropriate unit system.",
        "start": 815.895,
        "duration": 3.685
    },
    {
        "text": "That would make the hypothetical amplitudes of its horizontal ",
        "start": 820.12,
        "duration": 3.251
    },
    {
        "text": "and vertical components each the square root of one half.",
        "start": 823.371,
        "duration": 2.989
    },
    {
        "text": "And like Henry said, the energy of a photon is ",
        "start": 827.22,
        "duration": 2.427
    },
    {
        "text": "this special constant h times its frequency.",
        "start": 829.647,
        "duration": 2.273
    },
    {
        "text": "And because in a classical setting energy is proportional to the square of the ",
        "start": 832.6,
        "duration": 4.043
    },
    {
        "text": "amplitude of this wave, it's tempting to think of half of the energy as being ",
        "start": 836.643,
        "duration": 3.993
    },
    {
        "text": "in the horizontal component, and half of it as being in the vertical component.",
        "start": 840.636,
        "duration": 4.044
    },
    {
        "text": "But waves of this frequency cannot have half the energy of a photon.",
        "start": 845.18,
        "duration": 3.9
    },
    {
        "text": "I mean, the whole novelty of quantum here is that energy comes in these discrete, ",
        "start": 849.82,
        "duration": 4.238
    },
    {
        "text": "indivisible chunks.",
        "start": 854.058,
        "duration": 0.982
    },
    {
        "text": "So these components, with an imagined amplitude of one over the square root of two, ",
        "start": 855.62,
        "duration": 4.415
    },
    {
        "text": "could not exist in isolation.",
        "start": 860.035,
        "duration": 1.525
    },
    {
        "text": "And you might wonder what exactly they mean.",
        "start": 862.22,
        "duration": 2.22
    },
    {
        "text": "Well, let's get experimental about it.",
        "start": 865.42,
        "duration": 2.06
    },
    {
        "text": "If you were to take a vertically oriented polarizing filter and shoot this ",
        "start": 867.88,
        "duration": 4.265
    },
    {
        "text": "diagonally polarized photon right at it, what do you think would happen?",
        "start": 872.145,
        "duration": 4.095
    },
    {
        "text": "Classically, the way you'd interpret this superposition is that ",
        "start": 877.8,
        "duration": 3.252
    },
    {
        "text": "the half of its energy in the horizontal direction would be absorbed.",
        "start": 881.052,
        "duration": 3.508
    },
    {
        "text": "But because energy comes in these discrete photon packets, ",
        "start": 885.1,
        "duration": 2.997
    },
    {
        "text": "it either has to pass through with all of its energy or get absorbed entirely.",
        "start": 888.097,
        "duration": 3.963
    },
    {
        "text": "And if you actually did this experiment, about half the time the photon ",
        "start": 892.54,
        "duration": 3.744
    },
    {
        "text": "goes through entirely, and about half the time it gets absorbed entirely.",
        "start": 896.284,
        "duration": 3.796
    },
    {
        "text": "And it appears to be random whether a given photon passes through or not.",
        "start": 900.08,
        "duration": 4.66
    },
    {
        "text": "If it does pass through, forcing it to make a decision like this actually ",
        "start": 905.76,
        "duration": 4.087
    },
    {
        "text": "changes it so that its polarization is oriented along the filter's direction.",
        "start": 909.847,
        "duration": 4.253
    },
    {
        "text": "This is analogous to the classic Schrodinger's cat setup.",
        "start": 914.94,
        "duration": 2.52
    },
    {
        "text": "You have something that's in a superposition of two states, ",
        "start": 917.74,
        "duration": 3.343
    },
    {
        "text": "but once you make a measurement of that superposition, ",
        "start": 921.083,
        "duration": 3.065
    },
    {
        "text": "forcing it to interact with an observer in a way where each of those two ",
        "start": 924.148,
        "duration": 4.068
    },
    {
        "text": "states would behave differently, from the perspective of that observer, ",
        "start": 928.216,
        "duration": 4.012
    },
    {
        "text": "this superposition collapses to be entirely in one state or entirely in another, ",
        "start": 932.228,
        "duration": 4.514
    },
    {
        "text": "dead or alive, horizontal or vertical.",
        "start": 936.742,
        "duration": 2.118
    },
    {
        "text": "One pretty neat way to see this in action, which Henry and I talk about in the ",
        "start": 940.18,
        "duration": 3.963
    },
    {
        "text": "other video, is to take several polarized sunglasses, ",
        "start": 944.143,
        "duration": 2.708
    },
    {
        "text": "or some other form of polarizing filters, and start by holding two of them between ",
        "start": 946.851,
        "duration": 4.164
    },
    {
        "text": "you and some light source.",
        "start": 951.015,
        "duration": 1.305
    },
    {
        "text": "If you rotate them to be 90 degrees off from each other, ",
        "start": 952.82,
        "duration": 3.085
    },
    {
        "text": "the light source is blacked out completely, or at least with perfect filters it would be, ",
        "start": 955.905,
        "duration": 4.873
    },
    {
        "text": "because all of the photons passing through that first one are polarized vertically, ",
        "start": 960.778,
        "duration": 4.547
    },
    {
        "text": "so they actually have a 0% chance of passing a filter oriented horizontally.",
        "start": 965.325,
        "duration": 4.115
    },
    {
        "text": "But if you insert a third filter oriented at a 45 degree angle between the two, ",
        "start": 970.28,
        "duration": 5.337
    },
    {
        "text": "it actually lets more light through.",
        "start": 975.617,
        "duration": 2.403
    },
    {
        "text": "What's going on here is that 50% of the photons passing that vertical filter ",
        "start": 978.64,
        "duration": 4.513
    },
    {
        "text": "will also pass through the diagonal filter, and once they do, ",
        "start": 983.153,
        "duration": 3.634
    },
    {
        "text": "they're going to be changed to have a purely diagonal polarization, ",
        "start": 986.787,
        "duration": 3.985
    },
    {
        "text": "and once they're in that state, they have a 50-50 chance of passing through the ",
        "start": 990.772,
        "duration": 4.689
    },
    {
        "text": "filter oriented at 90 degrees.",
        "start": 995.461,
        "duration": 1.759
    },
    {
        "text": "So even though 0% of the photons passing through the first ",
        "start": 997.68,
        "duration": 3.406
    },
    {
        "text": "would pass through that last if nothing was in between, ",
        "start": 1001.086,
        "duration": 3.232
    },
    {
        "text": "by introducing another filter, 25% of them now pass through all three.",
        "start": 1004.318,
        "duration": 4.042
    },
    {
        "text": "Now that's something you could not explain unless that ",
        "start": 1009.06,
        "duration": 2.854
    },
    {
        "text": "middle filter forces the photons to change their states.",
        "start": 1011.914,
        "duration": 2.906
    },
    {
        "text": "And that experiment, by the way, becomes all the weirder when you ",
        "start": 1015.7,
        "duration": 3.571
    },
    {
        "text": "dig into the specific probabilities for angles between 0 and 45 degrees, ",
        "start": 1019.271,
        "duration": 3.95
    },
    {
        "text": "and that's actually what we talk about in the other video.",
        "start": 1023.221,
        "duration": 3.138
    },
    {
        "text": "For example, one specific value we focus on there is the probability that a photon whose ",
        "start": 1026.98,
        "duration": 6.119
    },
    {
        "text": "polarization is 22.5 degrees off the direction of a filter will pass through that filter.",
        "start": 1033.099,
        "duration": 6.121
    },
    {
        "text": "Again, it's helpful to think of this wave as having an amplitude of 1, ",
        "start": 1040.0,
        "duration": 4.514
    },
    {
        "text": "and then you'd think of the horizontal component as having an amplitude ",
        "start": 1044.514,
        "duration": 4.578
    },
    {
        "text": "sin of 22.5 degrees, which is around 0.38, and the vertical component ",
        "start": 1049.092,
        "duration": 4.451
    },
    {
        "text": "would have an amplitude cos of 22.5 degrees, which is around 0.92.",
        "start": 1053.543,
        "duration": 4.197
    },
    {
        "text": "Classically, you might think of its horizontal component as ",
        "start": 1061.22,
        "duration": 3.83
    },
    {
        "text": "having energy proportional to 0.38 squared, which is around 0.15.",
        "start": 1065.05,
        "duration": 4.15
    },
    {
        "text": "Likewise, you might think of the vertical component as having an energy proportional to 0.",
        "start": 1069.82,
        "duration": 3.96
    },
    {
        "text": "92 squared, which comes out to be around 0.85.",
        "start": 1073.78,
        "duration": 3.62
    },
    {
        "text": "And like we said before, classically, this would mean if you pass it through ",
        "start": 1078.14,
        "duration": 4.23
    },
    {
        "text": "a vertical filter, 15% of its energy is absorbed in the horizontal direction.",
        "start": 1082.37,
        "duration": 4.23
    },
    {
        "text": "But because the energy of light comes in these discrete quanta that cannot be subdivided, ",
        "start": 1087.26,
        "duration": 5.562
    },
    {
        "text": "instead what you observe is that 85% of the time the photon passes through entirely, ",
        "start": 1092.822,
        "duration": 5.253
    },
    {
        "text": "and 15% of the time it gets completely blocked.",
        "start": 1098.075,
        "duration": 2.905
    },
    {
        "text": "Now I want to emphasize that the wave equations don't change.",
        "start": 1105.84,
        "duration": 2.92
    },
    {
        "text": "The photon is still described as a superposition of two oscillating components, ",
        "start": 1109.04,
        "duration": 4.183
    },
    {
        "text": "each with some phase and amplitude, and these are often encoded using a single complex ",
        "start": 1113.223,
        "duration": 4.55
    },
    {
        "text": "number.",
        "start": 1117.773,
        "duration": 0.367
    },
    {
        "text": "The difference is that classically the squares of the amplitudes of each component tells ",
        "start": 1118.6,
        "duration": 5.012
    },
    {
        "text": "you the amount of that wave's energy in each direction, ",
        "start": 1123.612,
        "duration": 3.154
    },
    {
        "text": "but with quantized light at this minimal non-zero energy level, ",
        "start": 1126.766,
        "duration": 3.605
    },
    {
        "text": "the squares of those amplitudes tell you the probabilities that a given photon is going ",
        "start": 1130.371,
        "duration": 4.956
    },
    {
        "text": "to be found to have all of its energy in one direction or not.",
        "start": 1135.327,
        "duration": 3.493
    },
    {
        "text": "Also, these components could still have some kind of phase difference.",
        "start": 1138.82,
        "duration": 3.44
    },
    {
        "text": "Just like with classical waves, photons can be circularly polarized, ",
        "start": 1142.68,
        "duration": 3.809
    },
    {
        "text": "and there exist polarizing filters that only let through photons ",
        "start": 1146.489,
        "duration": 3.588
    },
    {
        "text": "that are polarized circularly, say in the clockwise direction.",
        "start": 1150.077,
        "duration": 3.423
    },
    {
        "text": "Or rather, they let through all photons probabilistically, ",
        "start": 1154.12,
        "duration": 3.245
    },
    {
        "text": "where the probabilities are determined by describing each one of those ",
        "start": 1157.365,
        "duration": 3.907
    },
    {
        "text": "photons as a superposition of the clockwise and counterclockwise states, ",
        "start": 1161.272,
        "duration": 4.016
    },
    {
        "text": "and then the square of the amplitude of the clockwise component gives you ",
        "start": 1165.288,
        "duration": 4.071
    },
    {
        "text": "the desired probability.",
        "start": 1169.359,
        "duration": 1.321
    },
    {
        "text": "Photons are, of course, just one quantum phenomenon, ",
        "start": 1172.06,
        "duration": 2.537
    },
    {
        "text": "one where we initially understood it as a wave thanks to Maxwell's equations, ",
        "start": 1174.597,
        "duration": 3.735
    },
    {
        "text": "and then as individual particles or quanta, hence the name quantum mechanics.",
        "start": 1178.332,
        "duration": 3.688
    },
    {
        "text": "But as many of you well know, there's a flip side to this where many ",
        "start": 1182.96,
        "duration": 2.971
    },
    {
        "text": "things that were understood to come in discrete little packets, ",
        "start": 1185.931,
        "duration": 2.757
    },
    {
        "text": "like electrons, were discovered to be governed by similar, wavy quantum mechanics.",
        "start": 1188.688,
        "duration": 3.532
    },
    {
        "text": "In cases way more general than this one-photon polarization example, ",
        "start": 1192.84,
        "duration": 3.446
    },
    {
        "text": "quantum mechanical states are described as some superposition of multiple base states, ",
        "start": 1196.286,
        "duration": 4.346
    },
    {
        "text": "and the superposition depends on what basis you choose.",
        "start": 1200.632,
        "duration": 2.748
    },
    {
        "text": "Each component in this superposition is given with an amplitude and a phase, ",
        "start": 1203.92,
        "duration": 3.817
    },
    {
        "text": "often encoded as a single complex number, and the need for this ",
        "start": 1207.737,
        "duration": 3.174
    },
    {
        "text": "phase arises from the wave nature of these objects.",
        "start": 1210.911,
        "duration": 2.529
    },
    {
        "text": "As with the photon example, the choice of how to measure these objects can determine ",
        "start": 1214.02,
        "duration": 3.756
    },
    {
        "text": "a set of base states, where the probability of measuring a particle to be in one of ",
        "start": 1217.776,
        "duration": 3.712
    },
    {
        "text": "these base states is proportional to the squares of the amplitudes of these numbers.",
        "start": 1221.488,
        "duration": 3.712
    },
    {
        "text": "It's funny to think, though, that if the wavy nature of electrons and other ",
        "start": 1225.8,
        "duration": 3.557
    },
    {
        "text": "particles was discovered first, we might instead refer to the whole subject as ",
        "start": 1229.357,
        "duration": 3.699
    },
    {
        "text": "harmonic mechanics, or something like that, since the weirdness there is not ",
        "start": 1233.056,
        "duration": 3.604
    },
    {
        "text": "that waves come in discrete units, but that particles are governed by wave equations.",
        "start": 1236.66,
        "duration": 3.98
    },
    {
        "text": "This video was supported in part by Brilliant, ",
        "start": 1242.62,
        "duration": 2.285
    },
    {
        "text": "and as viewers of this channel know, what I like about Brilliant ",
        "start": 1244.905,
        "duration": 3.16
    },
    {
        "text": "is that they're a great complement to passively watching educational videos.",
        "start": 1248.065,
        "duration": 3.695
    },
    {
        "text": "All of you here want to learn more math, or physics, ",
        "start": 1252.38,
        "duration": 2.783
    },
    {
        "text": "or the math that prepares you for physics, and the only way to ",
        "start": 1255.163,
        "duration": 3.309
    },
    {
        "text": "actually learn this stuff is to actively grapple with puzzles and problem solving.",
        "start": 1258.472,
        "duration": 4.308
    },
    {
        "text": "Brilliant offers many well-curated sequences of problems ",
        "start": 1263.5,
        "duration": 2.824
    },
    {
        "text": "that help you to master all sorts of technical subjects.",
        "start": 1266.324,
        "duration": 2.776
    },
    {
        "text": "You all like physics, clearly, so I think you would enjoy their ",
        "start": 1269.64,
        "duration": 3.022
    },
    {
        "text": "courses on classical mechanics and gravitational physics, ",
        "start": 1272.662,
        "duration": 2.74
    },
    {
        "text": "and honestly group theory would give you a really good foundation.",
        "start": 1275.402,
        "duration": 3.118
    },
    {
        "text": "But there are many other great courses too, especially in math.",
        "start": 1278.98,
        "duration": 3.0
    },
    {
        "text": "If you go to brilliant.org slash 3b1b, that one lets them know that you came from here, ",
        "start": 1282.84,
        "duration": 5.356
    },
    {
        "text": "and also the first 200 people that go to that link are going to get ",
        "start": 1288.196,
        "duration": 4.14
    },
    {
        "text": "20% off the annual Brilliant Premium subscription.",
        "start": 1292.336,
        "duration": 3.044
    },
    {
        "text": "That's the subscription I've been using, and it's actually ",
        "start": 1296.08,
        "duration": 2.36
    },
    {
        "text": "really fun to have a bank of these puzzles and problems.",
        "start": 1298.44,
        "duration": 2.24
    },
    {
        "text": "But of course, for those of you who want some more passive viewing, ",
        "start": 1301.66,
        "duration": 2.901
    },
    {
        "text": "don't forget that Henry and I just put out a video on Bell's inequalities over on ",
        "start": 1304.561,
        "duration": 3.499
    },
    {
        "text": "minute physics.",
        "start": 1308.06,
        "duration": 0.64
    },
    {
        "text": "If for some reason you haven't been following minute physics these days, ",
        "start": 1309.48,
        "duration": 2.862
    },
    {
        "text": "and I don't know why you wouldn't have been, the videos there have been really top notch, ",
        "start": 1312.342,
        "duration": 3.53
    },
    {
        "text": "so definitely take a moment to poke around the rest of his channel.",
        "start": 1315.872,
        "duration": 2.628
    }
]