[
    {
        "text": "Do you guys know about the Putnam?",
        "start": 3.56,
        "duration": 1.76
    },
    {
        "text": "It's a math competition for undergraduate students.",
        "start": 5.56,
        "duration": 2.6
    },
    {
        "text": "It's a six-hour long test that just has 12 questions ",
        "start": 8.72,
        "duration": 2.483
    },
    {
        "text": "broken up into two different three-hour sessions.",
        "start": 11.203,
        "duration": 2.297
    },
    {
        "text": "And each one of those questions is scored 1 to 10, ",
        "start": 14.06,
        "duration": 2.636
    },
    {
        "text": "so the highest possible score would be 120.",
        "start": 16.696,
        "duration": 2.224
    },
    {
        "text": "And yet, despite the fact that the only students taking this thing each year are those ",
        "start": 19.66,
        "duration": 4.4
    },
    {
        "text": "who clearly are already pretty interested in math, the median score is around 1 or 2.",
        "start": 24.06,
        "duration": 4.3
    },
    {
        "text": "So it's a hard test.",
        "start": 28.96,
        "duration": 1.78
    },
    {
        "text": "And on each one of those sections of six questions, ",
        "start": 31.4,
        "duration": 2.565
    },
    {
        "text": "the problems tend to get harder as you go from 1 to 6, ",
        "start": 33.965,
        "duration": 2.714
    },
    {
        "text": "although of course difficulty is in the eye of the beholder.",
        "start": 36.679,
        "duration": 2.961
    },
    {
        "text": "But the thing about those fives and sixes is that even though they're ",
        "start": 40.06,
        "duration": 3.723
    },
    {
        "text": "positioned as the hardest problems on a famously hard test, ",
        "start": 43.783,
        "duration": 3.192
    },
    {
        "text": "quite often these are the ones with the most elegant solutions available, ",
        "start": 46.975,
        "duration": 3.936
    },
    {
        "text": "some subtle shift in perspective that transforms it from very challenging to doable.",
        "start": 50.911,
        "duration": 4.469
    },
    {
        "text": "Here I'm going to share with you one problem that came up ",
        "start": 56.08,
        "duration": 2.36
    },
    {
        "text": "as the sixth question on one of these tests a while back.",
        "start": 58.44,
        "duration": 2.32
    },
    {
        "text": "And those of you who follow the channel know that rather than just jumping ",
        "start": 61.3,
        "duration": 3.26
    },
    {
        "text": "straight to the solution, which in this case would be surprisingly short, ",
        "start": 64.56,
        "duration": 3.216
    },
    {
        "text": "when possible I like to take the time to walk you through how you might ",
        "start": 67.776,
        "duration": 3.13
    },
    {
        "text": "have stumbled across the solution yourself, where the insight comes from.",
        "start": 70.906,
        "duration": 3.174
    },
    {
        "text": "That is, make a video more about the problem-solving ",
        "start": 74.5,
        "duration": 2.675
    },
    {
        "text": "process than about the problem used to exemplify it.",
        "start": 77.175,
        "duration": 2.625
    },
    {
        "text": "So anyway, here's the question.",
        "start": 80.44,
        "duration": 1.02
    },
    {
        "text": "If you choose four random points on a sphere, and consider the ",
        "start": 81.76,
        "duration": 3.588
    },
    {
        "text": "tetrahedron with these points as its vertices, ",
        "start": 85.348,
        "duration": 2.677
    },
    {
        "text": "what is the probability that the center of the sphere is inside that tetrahedron?",
        "start": 88.025,
        "duration": 4.615
    },
    {
        "text": "Go ahead, take a moment and kind of digest this question.",
        "start": 93.56,
        "duration": 2.08
    },
    {
        "text": "You might start thinking about which of these tetrahedra contain the sphere's center, ",
        "start": 97.48,
        "duration": 4.638
    },
    {
        "text": "which ones don't, how you might systematically distinguish the two, ",
        "start": 102.118,
        "duration": 3.668
    },
    {
        "text": "and how do you approach a problem like this?",
        "start": 105.786,
        "duration": 2.374
    },
    {
        "text": "Where do you even start?",
        "start": 108.54,
        "duration": 0.96
    },
    {
        "text": "Well, it's usually a good idea to think about simpler cases, ",
        "start": 111.02,
        "duration": 3.302
    },
    {
        "text": "so let's knock things down to two dimensions, where you'll choose three random ",
        "start": 114.322,
        "duration": 4.277
    },
    {
        "text": "points on a circle, and it's always helpful to name things so let's call these guys P1, ",
        "start": 118.599,
        "duration": 4.765
    },
    {
        "text": "P2, and P3.",
        "start": 123.364,
        "duration": 0.596
    },
    {
        "text": "The question is, what's the probability that the triangle ",
        "start": 124.46,
        "duration": 2.995
    },
    {
        "text": "formed by these points contains the center of the circle?",
        "start": 127.455,
        "duration": 2.945
    },
    {
        "text": "I think you'll agree it's way easier to visualize now, but it's still a hard question.",
        "start": 134.46,
        "duration": 4.22
    },
    {
        "text": "So again, you ask, is there a way to simplify what's going on, ",
        "start": 138.96,
        "duration": 3.061
    },
    {
        "text": "get ourselves to some kind of foothold that we can build up from?",
        "start": 142.021,
        "duration": 3.159
    },
    {
        "text": "Well, maybe you imagine fixing P1 and P2 in place, and only letting that third point vary.",
        "start": 145.98,
        "duration": 4.82
    },
    {
        "text": "And when you do this, and play around with it in your mind, ",
        "start": 151.42,
        "duration": 3.002
    },
    {
        "text": "you might notice that there's a special region, a certain arc, ",
        "start": 154.422,
        "duration": 3.154
    },
    {
        "text": "where when P3 is in that arc, the triangle contains the center, otherwise not.",
        "start": 157.576,
        "duration": 3.904
    },
    {
        "text": "Specifically, if you draw lines from P1 and P2 through the center, ",
        "start": 162.54,
        "duration": 3.798
    },
    {
        "text": "these lines divide up the circle into four different arcs, ",
        "start": 166.338,
        "duration": 3.345
    },
    {
        "text": "and if P3 happens to be in the one on the opposite side as P1 and P2, ",
        "start": 169.683,
        "duration": 3.969
    },
    {
        "text": "the triangle has the center.",
        "start": 173.652,
        "duration": 1.588
    },
    {
        "text": "If it's in any of the other arcs though, no luck.",
        "start": 175.66,
        "duration": 2.52
    },
    {
        "text": "We're assuming here that all of the points of the circle are equally likely.",
        "start": 181.04,
        "duration": 3.14
    },
    {
        "text": "So what is the probability that P3 lands in that arc?",
        "start": 184.56,
        "duration": 3.14
    },
    {
        "text": "It's the length of that arc divided by the full circumference of the circle, ",
        "start": 188.78,
        "duration": 3.927
    },
    {
        "text": "the proportion of the circle that this arc makes up.",
        "start": 192.707,
        "duration": 2.653
    },
    {
        "text": "So what is that proportion?",
        "start": 195.84,
        "duration": 1.02
    },
    {
        "text": "Obviously that depends on where you put the first two points.",
        "start": 197.42,
        "duration": 2.4
    },
    {
        "text": "I mean, if they're 90 degrees apart from each other, ",
        "start": 200.32,
        "duration": 2.354
    },
    {
        "text": "then the relevant arc is one quarter of the circle.",
        "start": 202.674,
        "duration": 2.266
    },
    {
        "text": "But if those two points were farther apart, that proportion would be something closer ",
        "start": 205.22,
        "duration": 3.857
    },
    {
        "text": "to a half, and if they were really close together, that proportion gets closer to zero.",
        "start": 209.077,
        "duration": 3.903
    },
    {
        "text": "So think about this for a moment.",
        "start": 214.04,
        "duration": 1.36
    },
    {
        "text": "P1 and P2 are chosen randomly, with every point on the circle being equally likely.",
        "start": 215.9,
        "duration": 4.0
    },
    {
        "text": "So what is the average size of this relevant arc?",
        "start": 220.7,
        "duration": 2.94
    },
    {
        "text": "Maybe you imagine fixing P1 in place, and just ",
        "start": 226.18,
        "duration": 2.386
    },
    {
        "text": "considering all the places that P2 might be.",
        "start": 228.566,
        "duration": 2.234
    },
    {
        "text": "All of the possible angles between these two lines, ",
        "start": 231.56,
        "duration": 3.003
    },
    {
        "text": "every angle from 0 degrees up to 180 degrees, is equally likely.",
        "start": 234.563,
        "duration": 3.697
    },
    {
        "text": "So every proportion between 0 and 0.5 is equally likely, ",
        "start": 238.82,
        "duration": 4.021
    },
    {
        "text": "and that means that the average proportion is 0.25.",
        "start": 242.841,
        "duration": 3.599
    },
    {
        "text": "So, if the average size of this arc is a quarter of the full circle, ",
        "start": 248.14,
        "duration": 3.875
    },
    {
        "text": "the average probability that the third point lands in it is a quarter, ",
        "start": 252.015,
        "duration": 3.988
    },
    {
        "text": "and that means that the overall probability that our triangle contains the ",
        "start": 256.003,
        "duration": 4.213
    },
    {
        "text": "center is a quarter.",
        "start": 260.216,
        "duration": 1.123
    },
    {
        "text": "But can we extend this into the three-dimensional case?",
        "start": 266.52,
        "duration": 2.62
    },
    {
        "text": "If you imagine three out of those four points just being fixed in place, ",
        "start": 269.8,
        "duration": 3.853
    },
    {
        "text": "which points of the sphere can the fourth one be on so that the ",
        "start": 273.653,
        "duration": 3.379
    },
    {
        "text": "tetrahedron that they form contain the center of the sphere?",
        "start": 277.032,
        "duration": 3.168
    },
    {
        "text": "Just like before, let's go ahead and draw some lines from each ",
        "start": 281.7,
        "duration": 2.682
    },
    {
        "text": "of those fixed three points through the center of the sphere.",
        "start": 284.382,
        "duration": 2.598
    },
    {
        "text": "It's also helpful if we draw some planes that are determined by any pair of these lines.",
        "start": 287.5,
        "duration": 4.68
    },
    {
        "text": "What these planes do, you might notice, is divide the sphere into ",
        "start": 293.3,
        "duration": 3.424
    },
    {
        "text": "eight different sections, each of which is a sort of spherical triangle.",
        "start": 296.724,
        "duration": 3.736
    },
    {
        "text": "And our tetrahedron is only going to contain the center of the sphere if the ",
        "start": 301.24,
        "duration": 4.465
    },
    {
        "text": "fourth point is in the spherical triangle on the opposite side as the first three.",
        "start": 305.705,
        "duration": 4.755
    },
    {
        "text": "Now, unlike the 2D case, it's pretty difficult to think about the ",
        "start": 311.42,
        "duration": 3.426
    },
    {
        "text": "average size of this section, as we let the initial three points vary.",
        "start": 314.846,
        "duration": 3.634
    },
    {
        "text": "Those of you with some multivariable calculus under your belt might think, ",
        "start": 321.22,
        "duration": 3.013
    },
    {
        "text": "let's just try a surface integral.",
        "start": 324.233,
        "duration": 1.367
    },
    {
        "text": "And by all means, pull out some paper and give it a try.",
        "start": 326.08,
        "duration": 2.12
    },
    {
        "text": "But it's not easy.",
        "start": 328.5,
        "duration": 1.12
    },
    {
        "text": "And of course it should be difficult.",
        "start": 330.06,
        "duration": 1.04
    },
    {
        "text": "I mean, this is the sixth problem on a Putnam, what do you expect?",
        "start": 331.3,
        "duration": 2.7
    },
    {
        "text": "And what do you even do with that?",
        "start": 335.44,
        "duration": 3.08
    },
    {
        "text": "Well, one thing you can do is back up to the two-dimensional case and ",
        "start": 339.06,
        "duration": 3.282
    },
    {
        "text": "contemplate if there is a different way to think about the same answer we got.",
        "start": 342.342,
        "duration": 3.658
    },
    {
        "text": "That answer, one-fourth, looks suspiciously clean, ",
        "start": 346.82,
        "duration": 2.824
    },
    {
        "text": "and raises the question of what that four represents.",
        "start": 349.644,
        "duration": 2.936
    },
    {
        "text": "One of the main reasons I wanted to make a video about this particular problem is that ",
        "start": 353.72,
        "duration": 3.657
    },
    {
        "text": "what's about to happen carries with it a broader lesson for mathematical problem solving.",
        "start": 357.377,
        "duration": 3.743
    },
    {
        "text": "Think about those two lines we drew for p1 and p2 through the origin.",
        "start": 361.8,
        "duration": 3.56
    },
    {
        "text": "They made the problem a lot easier to think about.",
        "start": 365.92,
        "duration": 1.98
    },
    {
        "text": "And in general, whenever you've added something to the problem ",
        "start": 368.28,
        "duration": 3.321
    },
    {
        "text": "setup that makes it conceptually easier, see if you can reframe ",
        "start": 371.601,
        "duration": 3.375
    },
    {
        "text": "the entire question in terms of those things you just added.",
        "start": 374.976,
        "duration": 3.164
    },
    {
        "text": "In this case, rather than thinking about choosing three points randomly, ",
        "start": 378.82,
        "duration": 4.207
    },
    {
        "text": "start by saying, choose two random lines that pass through the circle's center.",
        "start": 383.027,
        "duration": 4.553
    },
    {
        "text": "For each line, there's two possible points it could correspond to, ",
        "start": 388.46,
        "duration": 3.202
    },
    {
        "text": "so just flip a coin for each one to choose which of the endpoints is going to be p1, ",
        "start": 391.662,
        "duration": 4.062
    },
    {
        "text": "and likewise for the other, which endpoint is going to be p2.",
        "start": 395.724,
        "duration": 2.916
    },
    {
        "text": "Choosing a random line and flipping a coin like this is the same thing as choosing ",
        "start": 399.34,
        "duration": 4.004
    },
    {
        "text": "a random point on the circle, it just feels a little bit convoluted at first.",
        "start": 403.344,
        "duration": 3.716
    },
    {
        "text": "But the reason for thinking about the random process this ",
        "start": 407.56,
        "duration": 2.504
    },
    {
        "text": "way is that things are actually about to become easier.",
        "start": 410.064,
        "duration": 2.376
    },
    {
        "text": "We'll still think about that third point, p3, as just being a random point on the circle, ",
        "start": 413.46,
        "duration": 4.827
    },
    {
        "text": "but imagine that it was chosen before you do the two coin flips.",
        "start": 418.287,
        "duration": 3.433
    },
    {
        "text": "Because you see, once the two lines and the third point are set in stone, ",
        "start": 422.56,
        "duration": 3.944
    },
    {
        "text": "there's only four possibilities for where P1 and P2 might end up, ",
        "start": 426.504,
        "duration": 3.517
    },
    {
        "text": "based on those coin flips, each one being equally likely.",
        "start": 430.021,
        "duration": 3.039
    },
    {
        "text": "But one and only one of those four outcomes leaves p1 and p2 on the opposite ",
        "start": 433.68,
        "duration": 4.901
    },
    {
        "text": "side of the circle as p3, with the triangle they form containing the center.",
        "start": 438.581,
        "duration": 4.839
    },
    {
        "text": "So no matter where those two lines end up, and where that p3 ends up, ",
        "start": 443.92,
        "duration": 3.697
    },
    {
        "text": "it's always a 1 fourth chance that the coin flips leave us with a triangle containing ",
        "start": 447.617,
        "duration": 4.542
    },
    {
        "text": "the center.",
        "start": 452.159,
        "duration": 0.581
    },
    {
        "text": "Now that's very subtle.",
        "start": 455.3,
        "duration": 1.16
    },
    {
        "text": "Just by reframing how we think about the random process for choosing points, ",
        "start": 457.04,
        "duration": 3.721
    },
    {
        "text": "the answer 1 quarter popped out in a very different way from how it did before.",
        "start": 460.761,
        "duration": 3.819
    },
    {
        "text": "And importantly, this style of argument generalizes seamlessly up into three dimensions.",
        "start": 465.42,
        "duration": 5.14
    },
    {
        "text": "Again, instead of starting off by picking four random points, ",
        "start": 471.64,
        "duration": 3.533
    },
    {
        "text": "imagine choosing three random lines through the center of the sphere, ",
        "start": 475.173,
        "duration": 3.989
    },
    {
        "text": "and then some random point for p4.",
        "start": 479.162,
        "duration": 1.938
    },
    {
        "text": "That first line passes through the sphere at two points, ",
        "start": 483.02,
        "duration": 2.777
    },
    {
        "text": "so flip a coin to decide which of those two points is going to be p1.",
        "start": 485.797,
        "duration": 3.363
    },
    {
        "text": "Likewise, for each of the other lines, flip a coin to decide where p2 and p3 end up.",
        "start": 489.66,
        "duration": 5.0
    },
    {
        "text": "There's eight equally likely outcomes of those coin flips, ",
        "start": 495.14,
        "duration": 3.802
    },
    {
        "text": "but one and only one of them is going to place p1, p2, ",
        "start": 498.942,
        "duration": 3.544
    },
    {
        "text": "and p3 on the opposite side of the center as p4.",
        "start": 502.486,
        "duration": 3.094
    },
    {
        "text": "So one and only one of these eight equally likely ",
        "start": 506.46,
        "duration": 2.943
    },
    {
        "text": "outcomes gives us a tetrahedron that contains the center.",
        "start": 509.403,
        "duration": 3.357
    },
    {
        "text": "Again, it's kind of subtle how that pops out to us, but isn't that elegant?",
        "start": 515.14,
        "duration": 3.2
    },
    {
        "text": "This is a valid solution to the problem, but admittedly ",
        "start": 520.5,
        "duration": 3.005
    },
    {
        "text": "the way I've stated it so far rests on some visual intuition.",
        "start": 523.505,
        "duration": 3.275
    },
    {
        "text": "If you're curious about how you might write it up in a way that doesn't ",
        "start": 527.4,
        "duration": 2.852
    },
    {
        "text": "rely on visual intuition, I've left a link in the description to one ",
        "start": 530.252,
        "duration": 2.733
    },
    {
        "text": "such write-up in the language of linear algebra, if you're curious.",
        "start": 532.985,
        "duration": 2.655
    },
    {
        "text": "And this is pretty common in math, where having the key insight and ",
        "start": 536.3,
        "duration": 3.431
    },
    {
        "text": "understanding is one thing, but having the relevant background to articulate ",
        "start": 539.731,
        "duration": 3.887
    },
    {
        "text": "that understanding more formally is almost a separate muscle entirely, ",
        "start": 543.618,
        "duration": 3.583
    },
    {
        "text": "one that undergraduate math students kind of spend most of their time building up.",
        "start": 547.201,
        "duration": 4.139
    },
    {
        "text": "But the main takeaway here is not the solution itself, ",
        "start": 552.16,
        "duration": 2.701
    },
    {
        "text": "but how you might find that key insight if it was put in front of you and you ",
        "start": 554.861,
        "duration": 3.832
    },
    {
        "text": "were just left to solve it.",
        "start": 558.693,
        "duration": 1.327
    },
    {
        "text": "Namely, just keep asking simpler versions of the ",
        "start": 560.3,
        "duration": 2.22
    },
    {
        "text": "question until you can get some kind of foothold.",
        "start": 562.52,
        "duration": 2.22
    },
    {
        "text": "And then when you do, if there's any kind of added construct that proves to be useful, ",
        "start": 565.44,
        "duration": 4.546
    },
    {
        "text": "see if you can reframe the whole question around that new construct.",
        "start": 569.986,
        "duration": 3.554
    },
    {
        "text": "To close things off here, I've got another probability puzzle, ",
        "start": 575.6,
        "duration": 2.864
    },
    {
        "text": "one that comes from this video sponsor, brilliant.org.",
        "start": 578.464,
        "duration": 2.456
    },
    {
        "text": "Suppose you have eight students sitting in a circle taking the Putnam.",
        "start": 581.46,
        "duration": 2.94
    },
    {
        "text": "It's a hard test, so each student tries to cheat off of his neighbor, ",
        "start": 584.86,
        "duration": 3.709
    },
    {
        "text": "choosing randomly which neighbor to cheat from.",
        "start": 588.569,
        "duration": 2.491
    },
    {
        "text": "Now circle all of the students that don't have somebody cheating off of their test.",
        "start": 591.72,
        "duration": 4.36
    },
    {
        "text": "What is the expected number of such circled students?",
        "start": 596.64,
        "duration": 3.34
    },
    {
        "text": "It's an interesting question, right?",
        "start": 600.98,
        "duration": 1.78
    },
    {
        "text": "Brilliant.org is a site where you can practice your problem ",
        "start": 603.48,
        "duration": 2.4
    },
    {
        "text": "solving abilities with questions like this and many, many more.",
        "start": 605.88,
        "duration": 2.52
    },
    {
        "text": "And that really is the best way to learn.",
        "start": 608.8,
        "duration": 1.6
    },
    {
        "text": "You're going to find countless interesting questions curated in a pretty ",
        "start": 610.98,
        "duration": 3.29
    },
    {
        "text": "thoughtful way so that you really do come away better at problem solving.",
        "start": 614.27,
        "duration": 3.29
    },
    {
        "text": "If you want more probability, they have a really good course on probability, ",
        "start": 618.0,
        "duration": 3.139
    },
    {
        "text": "but they've got all sorts of other math and science as well, ",
        "start": 621.139,
        "duration": 2.487
    },
    {
        "text": "so you're almost certainly going to find something that interests you.",
        "start": 623.626,
        "duration": 2.854
    },
    {
        "text": "Me?",
        "start": 627.02,
        "duration": 0.2
    },
    {
        "text": "I've been a fan for a while, and if you go to brilliant.org slash 3b1b, ",
        "start": 627.42,
        "duration": 4.18
    },
    {
        "text": "it lets them know that you came from here, and the first 256 of you to visit that ",
        "start": 631.6,
        "duration": 4.761
    },
    {
        "text": "link can get 20% off their premium membership, which is the one I use, ",
        "start": 636.361,
        "duration": 4.123
    },
    {
        "text": "if you want to upgrade.",
        "start": 640.484,
        "duration": 1.336
    },
    {
        "text": "Also if you're just itching to see a solution to this puzzle, ",
        "start": 642.8,
        "duration": 2.636
    },
    {
        "text": "which by the way uses a certain tactic in probability that's useful in a lot of ",
        "start": 645.436,
        "duration": 3.401
    },
    {
        "text": "other circumstances, I also left a link in the description that just jumps you ",
        "start": 648.837,
        "duration": 3.359
    },
    {
        "text": "straight to the solution.",
        "start": 652.196,
        "duration": 1.064
    }
]