[
    {
        "text": "Today I have a small series of puzzles for you, and if you even remotely like math,",
        "start": 0.0,
        "duration": 4.416
    },
    {
        "text": "I can essentially guarantee that the solution to each one will delight you.",
        "start": 4.416,
        "duration": 3.944
    },
    {
        "text": "At the end, you and I will circle them all together into a",
        "start": 8.74,
        "duration": 2.631
    },
    {
        "text": "broader theme about higher dimensions, both in the sense of why we care,",
        "start": 11.371,
        "duration": 3.256
    },
    {
        "text": "and also why it's a little bit sad to think about them.",
        "start": 14.627,
        "duration": 2.453
    },
    {
        "text": "But for the first half of this lesson or so, nothing",
        "start": 17.38,
        "duration": 2.489
    },
    {
        "text": "that we do is going to touch four or more dimensions.",
        "start": 19.869,
        "duration": 2.491
    },
    {
        "text": "This will start simply as a set of pure geometry",
        "start": 22.74,
        "duration": 2.61
    },
    {
        "text": "puzzles with delightful and surprising solutions.",
        "start": 25.35,
        "duration": 2.61
    },
    {
        "text": "For the first puzzle here, I want you to consider this rhombus shape,",
        "start": 32.36,
        "duration": 3.825
    },
    {
        "text": "where the internal angles are 60 degrees and 120 degrees.",
        "start": 36.185,
        "duration": 3.115
    },
    {
        "text": "If you take a lot of copies of this shape, you can tile the plane with it.",
        "start": 39.8,
        "duration": 3.66
    },
    {
        "text": "And that's not unique to this rhombus, it could have different internal angles,",
        "start": 43.94,
        "duration": 3.493
    },
    {
        "text": "but what's nice about this one is that there are a lot of distinct ways,",
        "start": 47.433,
        "duration": 3.188
    },
    {
        "text": "with a kind of pseudo-hexagonal pattern, that you could also tile the plane.",
        "start": 50.621,
        "duration": 3.319
    },
    {
        "text": "I've seen this pattern all the time out in the wild on floors or on furniture,",
        "start": 54.44,
        "duration": 3.469
    },
    {
        "text": "and each time it reminds me of the puzzle I'm about to show you.",
        "start": 57.909,
        "duration": 2.811
    },
    {
        "text": "If you take one of these tilings, and you ever notice that three of those",
        "start": 61.2,
        "duration": 3.828
    },
    {
        "text": "rhombus shapes make a little hexagon like this,",
        "start": 65.028,
        "duration": 2.483
    },
    {
        "text": "it gives you a chance to generate a slightly different tiling by rotating",
        "start": 67.511,
        "duration": 3.828
    },
    {
        "text": "those three tiles 60 degrees.",
        "start": 71.339,
        "duration": 1.501
    },
    {
        "text": "The result is almost the same as what you had before, but just a little bit different.",
        "start": 73.16,
        "duration": 3.26
    },
    {
        "text": "And when you do that, you might notice that sometimes that",
        "start": 76.88,
        "duration": 2.385
    },
    {
        "text": "creates a new hexagon that wasn't there before,",
        "start": 79.265,
        "duration": 1.941
    },
    {
        "text": "that you could also rotate, taking a step to yet another one of these tilings.",
        "start": 81.206,
        "duration": 3.154
    },
    {
        "text": "So a natural question you might wonder is, is it possible to get from any one of these",
        "start": 85.06,
        "duration": 5.107
    },
    {
        "text": "tiling patterns to another one just by using these little hexagonal rotation steps?",
        "start": 90.167,
        "duration": 4.873
    },
    {
        "text": "With a little thinking, you can see pretty quickly that the answer has to be no,",
        "start": 97.28,
        "duration": 3.75
    },
    {
        "text": "because for example, that very first tiling I showed you,",
        "start": 101.03,
        "duration": 2.686
    },
    {
        "text": "which is like a squished rectangular grid, has no hexagons at all,",
        "start": 103.716,
        "duration": 3.102
    },
    {
        "text": "meaning you can't take one of these steps into or out of this pattern.",
        "start": 106.818,
        "duration": 3.242
    },
    {
        "text": "But what if we restrain things a little bit?",
        "start": 110.96,
        "duration": 1.6
    },
    {
        "text": "What if instead of tiling the infinite plane, I present you with a hexagon,",
        "start": 112.56,
        "duration": 3.62
    },
    {
        "text": "and all the side lengths of this hexagon are going to be some whole number,",
        "start": 116.18,
        "duration": 3.62
    },
    {
        "text": "like 4 in this case, and I have you fill that hexagon with these little tiles,",
        "start": 119.8,
        "duration": 3.763
    },
    {
        "text": "assuming each of those tiles has a side length of 1.",
        "start": 123.563,
        "duration": 2.477
    },
    {
        "text": "Now let me ask you, is it possible to get from any tiling of this finite",
        "start": 126.7,
        "duration": 3.966
    },
    {
        "text": "hexagon to any other tiling using these moves,",
        "start": 130.666,
        "duration": 2.554
    },
    {
        "text": "where every time you find a small hexagon with just three of those tiles,",
        "start": 133.22,
        "duration": 4.021
    },
    {
        "text": "you rotate it 60 degrees?",
        "start": 137.241,
        "duration": 1.359
    },
    {
        "text": "If the answer is no, you have to show two distinct patterns and",
        "start": 139.2,
        "duration": 2.867
    },
    {
        "text": "explain why you can't get between them, and the natural follow-on question would be,",
        "start": 142.067,
        "duration": 3.808
    },
    {
        "text": "how many fundamentally distinct patterns are there?",
        "start": 145.875,
        "duration": 2.285
    },
    {
        "text": "If the answer is yes, you have to explain how to get from any one to another,",
        "start": 148.48,
        "duration": 3.857
    },
    {
        "text": "and the natural follow-up question would be, which two states are the farthest apart,",
        "start": 152.337,
        "duration": 4.254
    },
    {
        "text": "in that it requires the maximum number of moves to get from one to the other?",
        "start": 156.591,
        "duration": 3.809
    },
    {
        "text": "And what is that number?",
        "start": 160.84,
        "duration": 1.06
    },
    {
        "text": "As a function of the size of the hexagon, what is the maximum possible",
        "start": 162.16,
        "duration": 3.493
    },
    {
        "text": "number of steps that it could take to get from one state to another?",
        "start": 165.653,
        "duration": 3.347
    },
    {
        "text": "That's puzzle number one, and before just giving away the answer,",
        "start": 169.9,
        "duration": 2.849
    },
    {
        "text": "let me present the second puzzle for you, and maybe you can mull it over in the",
        "start": 172.749,
        "duration": 3.453
    },
    {
        "text": "back of your mind.",
        "start": 176.202,
        "duration": 0.778
    },
    {
        "text": "The second one is called the Tarski-Planck problem, and it has to do with a circle,",
        "start": 177.58,
        "duration": 4.431
    },
    {
        "text": "say just with a radius 1, and we're going to consider strips along that circle.",
        "start": 182.011,
        "duration": 4.169
    },
    {
        "text": "And what I mean by a strip here is any region that's bound by two parallel chords,",
        "start": 186.64,
        "duration": 4.347
    },
    {
        "text": "and the quantity we'll care about is the width of that strip,",
        "start": 190.987,
        "duration": 3.248
    },
    {
        "text": "so the distance between those two chords, which I'm going to denote with the letter d.",
        "start": 194.235,
        "duration": 4.505
    },
    {
        "text": "You might drop down multiple distinct strips on this circle,",
        "start": 199.46,
        "duration": 2.556
    },
    {
        "text": "and they could be at various different angles, kind of crisscrossing with each other.",
        "start": 202.016,
        "duration": 3.564
    },
    {
        "text": "And for the question, suppose that you've dropped down enough of",
        "start": 206.28,
        "duration": 2.914
    },
    {
        "text": "these strips that they completely cover the area of the circle.",
        "start": 209.194,
        "duration": 2.826
    },
    {
        "text": "Every square inch of the circle has some strip covering it.",
        "start": 212.36,
        "duration": 2.8
    },
    {
        "text": "Then imagine adding together the widths of all of those strips,",
        "start": 215.76,
        "duration": 3.486
    },
    {
        "text": "so summing over this value d for every one of those strips.",
        "start": 219.246,
        "duration": 3.214
    },
    {
        "text": "And the question is what is the minimum possible value for this sum?",
        "start": 223.12,
        "duration": 4.38
    },
    {
        "text": "So across all of the distinct ways that you could cover the circle with",
        "start": 228.14,
        "duration": 3.353
    },
    {
        "text": "a bunch of strips, what's the smallest that you could make this sum?",
        "start": 231.493,
        "duration": 3.167
    },
    {
        "text": "For example, a very trivial way that you could cover it is to take",
        "start": 235.3,
        "duration": 3.657
    },
    {
        "text": "one really fat strip whose width is 2, the diameter of the circle.",
        "start": 238.957,
        "duration": 3.603
    },
    {
        "text": "That entire strip covers the entire circle, so the sum of all of the widths would be 2.",
        "start": 243.18,
        "duration": 4.32
    },
    {
        "text": "Very similarly, if you just subdivided this into a whole bunch of parallel strips,",
        "start": 247.92,
        "duration": 3.938
    },
    {
        "text": "the sum of the widths is going to just be the diameter of the circle,",
        "start": 251.858,
        "duration": 3.323
    },
    {
        "text": "so that is still just 2.",
        "start": 255.181,
        "duration": 1.139
    },
    {
        "text": "So really the question here is can you do better than 2, and by how much?",
        "start": 257.12,
        "duration": 4.219
    },
    {
        "text": "Okay, so that is puzzle number 2.",
        "start": 264.02,
        "duration": 1.82
    },
    {
        "text": "Before telling you 3, 4, and 5 though, let's circle back to talk about that first one,",
        "start": 266.38,
        "duration": 4.064
    },
    {
        "text": "where we are tiling the hexagon.",
        "start": 270.444,
        "duration": 1.496
    },
    {
        "text": "On the face of it, this is very tricky to think about,",
        "start": 272.7,
        "duration": 2.874
    },
    {
        "text": "but there is a trick if you kind of squint your eyes,",
        "start": 275.574,
        "duration": 2.823
    },
    {
        "text": "and if I suggestively color all of these tiles based on their orientation,",
        "start": 278.397,
        "duration": 3.92
    },
    {
        "text": "where instead of thinking of this as a tiling in two dimensions,",
        "start": 282.317,
        "duration": 3.397
    },
    {
        "text": "you can think of it as a kind of projection of a stack of cubes.",
        "start": 285.714,
        "duration": 3.346
    },
    {
        "text": "It's not too hard to see that any stack of cubes inside an n by n by",
        "start": 290.2,
        "duration": 3.373
    },
    {
        "text": "n frame like this necessarily gives you one of these rhombus tiling patterns,",
        "start": 293.573,
        "duration": 3.814
    },
    {
        "text": "but the curious viewers might enjoy taking a moment to pause and",
        "start": 297.387,
        "duration": 3.179
    },
    {
        "text": "ponder and convince themselves it goes the other way around.",
        "start": 300.566,
        "duration": 2.934
    },
    {
        "text": "Any tiling of rhombuses necessarily has a corresponding stack of cubes.",
        "start": 303.88,
        "duration": 4.4
    },
    {
        "text": "If you do that, take a moment to think about the significance of this fundamental",
        "start": 309.1,
        "duration": 4.376
    },
    {
        "text": "move in the puzzle, where you identify a hexagon and rotate that hexagon 60 degrees.",
        "start": 313.476,
        "duration": 4.484
    },
    {
        "text": "If you think of that little hexagon as the projection of a little cube,",
        "start": 318.54,
        "duration": 4.331
    },
    {
        "text": "notice how if I kind of grab that cube and remove it from the diagram,",
        "start": 322.871,
        "duration": 4.271
    },
    {
        "text": "what's left behind, this indent of that cube, involves those same three rhombuses",
        "start": 327.142,
        "duration": 4.933
    },
    {
        "text": "except rotated 60 degrees.",
        "start": 332.075,
        "duration": 1.565
    },
    {
        "text": "This move of rotating hexagons when you find them is really the same thing",
        "start": 334.54,
        "duration": 4.05
    },
    {
        "text": "as adding or removing cubes, and that makes this way easier to think about.",
        "start": 338.59,
        "duration": 4.05
    },
    {
        "text": "For example, it becomes very clear that you can get from any pattern to any other",
        "start": 343.0,
        "duration": 3.961
    },
    {
        "text": "pattern, because you could start by saying take all of the cubes in this diagram",
        "start": 346.961,
        "duration": 3.914
    },
    {
        "text": "and remove them so that you get to a kind of neutral position that looks empty,",
        "start": 350.875,
        "duration": 3.865
    },
    {
        "text": "and then add back whatever cubes you need to to get to whatever other pattern you desire.",
        "start": 354.74,
        "duration": 4.3
    },
    {
        "text": "It also makes it easy to think about the more quantitative follow-on question,",
        "start": 359.78,
        "duration": 3.675
    },
    {
        "text": "which is what is the maximum number of steps that it might",
        "start": 363.455,
        "duration": 2.745
    },
    {
        "text": "take to get from one configuration to another.",
        "start": 366.2,
        "duration": 2.14
    },
    {
        "text": "Realizing that each move corresponds to adding or removing a cube,",
        "start": 369.54,
        "duration": 3.675
    },
    {
        "text": "the biggest number of steps is to go from the empty configuration",
        "start": 373.215,
        "duration": 3.62
    },
    {
        "text": "to the full configuration, and that requires n cubed different steps.",
        "start": 376.835,
        "duration": 3.785
    },
    {
        "text": "What I like about this is that we have this purely two-dimensional question,",
        "start": 381.76,
        "duration": 3.793
    },
    {
        "text": "and a very nice insight came from thinking as three-dimensional creatures,",
        "start": 385.553,
        "duration": 3.695
    },
    {
        "text": "but the fact that the numerical answer to this question has that little cube in",
        "start": 389.248,
        "duration": 3.942
    },
    {
        "text": "it is an indication that the three-dimensionality really is baked into the puzzle itself,",
        "start": 393.19,
        "duration": 4.434
    },
    {
        "text": "it's not coming from some bias that we have as three-dimensional creatures.",
        "start": 397.624,
        "duration": 3.696
    },
    {
        "text": "With this idea of stepping into a higher dimension in mind,",
        "start": 402.08,
        "duration": 2.919
    },
    {
        "text": "now take another look at that second puzzle that we have,",
        "start": 404.999,
        "duration": 2.822
    },
    {
        "text": "covering the unit disk with a bunch of strips.",
        "start": 407.821,
        "duration": 2.239
    },
    {
        "text": "If you do pause and take a moment trying to think about this puzzle,",
        "start": 412.4,
        "duration": 3.617
    },
    {
        "text": "and you explore alternate strategies to the parallel strips,",
        "start": 416.017,
        "duration": 3.198
    },
    {
        "text": "what you might find is that it's very hard to find anything that gets even close to 2,",
        "start": 419.215,
        "duration": 4.561
    },
    {
        "text": "much less lower than it, so you might suspect that the parallel strips",
        "start": 423.776,
        "duration": 3.722
    },
    {
        "text": "are the best that you can do, that 2 is the minimum possible value for the sum.",
        "start": 427.498,
        "duration": 4.142
    },
    {
        "text": "But how would you prove something like that?",
        "start": 432.24,
        "duration": 2.16
    },
    {
        "text": "When you're in this vast space of all possible coverings,",
        "start": 434.4,
        "duration": 3.03
    },
    {
        "text": "how could you prove that there's not some extra clever strategy that you're just missing?",
        "start": 437.43,
        "duration": 4.65
    },
    {
        "text": "This main constraint that the strips have to cover the circle,",
        "start": 442.76,
        "duration": 3.222
    },
    {
        "text": "means that the area of all of those strips, if you add them together,",
        "start": 445.982,
        "duration": 3.639
    },
    {
        "text": "has to be at least the area of the circle, which is pi.",
        "start": 449.621,
        "duration": 2.859
    },
    {
        "text": "So that's something to work with, but it's a little bit awkward,",
        "start": 453.2,
        "duration": 3.264
    },
    {
        "text": "because you can't directly relate the area of the strip to its width without knowing",
        "start": 456.464,
        "duration": 4.269
    },
    {
        "text": "where on the circle it sits.",
        "start": 460.733,
        "duration": 1.407
    },
    {
        "text": "A strip with a given width would have a bigger area",
        "start": 462.14,
        "duration": 2.481
    },
    {
        "text": "near the center than if it was close to the edge.",
        "start": 464.621,
        "duration": 2.339
    },
    {
        "text": "What would be really helpful is if the area of that strip was simply",
        "start": 467.6,
        "duration": 3.589
    },
    {
        "text": "proportional to its width, because in that case you could directly",
        "start": 471.189,
        "duration": 3.485
    },
    {
        "text": "relate the sum of all of the areas to the sum of all of the widths.",
        "start": 474.674,
        "duration": 3.486
    },
    {
        "text": "And while this is not true in two dimensions, the magic is that it becomes",
        "start": 478.22,
        "duration": 4.213
    },
    {
        "text": "true if you project everything up onto a hemisphere sitting above the circle.",
        "start": 482.433,
        "duration": 4.327
    },
    {
        "text": "This is not at all obvious, but if you look at the width of this strip",
        "start": 487.4,
        "duration": 4.266
    },
    {
        "text": "on this three-dimensional hemisphere, which we'll call d,",
        "start": 491.666,
        "duration": 3.486
    },
    {
        "text": "the area of that strip up in three dimensions like this happens to be pi times d.",
        "start": 495.152,
        "duration": 4.868
    },
    {
        "text": "Importantly, it doesn't matter where the strip is,",
        "start": 500.56,
        "duration": 2.482
    },
    {
        "text": "it could be going over the center or closer to the edge,",
        "start": 503.042,
        "duration": 2.774
    },
    {
        "text": "the area only depends on the width.",
        "start": 505.816,
        "duration": 1.704
    },
    {
        "text": "This might feel like a fact drawn completely from out of the blue,",
        "start": 508.26,
        "duration": 3.35
    },
    {
        "text": "but regular channel viewers will have at least some chance to recognize this,",
        "start": 511.61,
        "duration": 3.9
    },
    {
        "text": "because it's related to a really nice proof for the surface area of a sphere.",
        "start": 515.51,
        "duration": 3.85
    },
    {
        "text": "This was a proof due to Archimedes, we covered it in a different video.",
        "start": 519.82,
        "duration": 2.96
    },
    {
        "text": "The big idea there is to consider a cylinder with the same radius as that sphere,",
        "start": 523.26,
        "duration": 4.486
    },
    {
        "text": "sort of hugging tightly around the sphere, and then to analyze how if",
        "start": 527.746,
        "duration": 3.83
    },
    {
        "text": "you look at a little patch of area on the sphere,",
        "start": 531.576,
        "duration": 2.736
    },
    {
        "text": "and you project it outward onto this cylinder, the area actually won't change.",
        "start": 534.312,
        "duration": 4.268
    },
    {
        "text": "The high-level idea is that along lines of latitude,",
        "start": 538.58,
        "duration": 2.736
    },
    {
        "text": "that little patch of area gets stretched out, but along lines of longitude,",
        "start": 541.316,
        "duration": 3.924
    },
    {
        "text": "it actually gets squished down because of the angle that it sits at,",
        "start": 545.24,
        "duration": 3.563
    },
    {
        "text": "and those two effects happen to cancel out precisely.",
        "start": 548.803,
        "duration": 2.737
    },
    {
        "text": "And then once you know that projecting out onto this cylinder preserves areas,",
        "start": 552.12,
        "duration": 3.982
    },
    {
        "text": "analyzing those areas becomes a lot simpler.",
        "start": 556.102,
        "duration": 2.218
    },
    {
        "text": "So looking back at our little strip, let me go ahead and draw the rest of the sphere,",
        "start": 559.06,
        "duration": 3.759
    },
    {
        "text": "sort of doubling the area of that strip, and then reorienting it",
        "start": 562.819,
        "duration": 2.841
    },
    {
        "text": "to match the animations I was just showing.",
        "start": 565.66,
        "duration": 1.88
    },
    {
        "text": "If you know that projecting this out onto the cylinder preserves the area,",
        "start": 567.92,
        "duration": 3.783
    },
    {
        "text": "then it becomes very clear that it doesn't matter where on the sphere that strip is.",
        "start": 571.703,
        "duration": 4.237
    },
    {
        "text": "Whether it's close to the pole or close to the equator,",
        "start": 576.38,
        "duration": 3.212
    },
    {
        "text": "the area of that projection onto the cylinder is the circumference times the thickness,",
        "start": 579.592,
        "duration": 5.048
    },
    {
        "text": "2 pi r times the width.",
        "start": 584.64,
        "duration": 1.32
    },
    {
        "text": "So wrapping it all up, the way this is relevant to the original puzzle is you say,",
        "start": 586.54,
        "duration": 4.009
    },
    {
        "text": "consider any covering of the circle with a bunch of strips,",
        "start": 590.549,
        "duration": 2.899
    },
    {
        "text": "which you can project upwards to be a covering of the hemisphere with all of these",
        "start": 593.448,
        "duration": 4.01
    },
    {
        "text": "projected strips.",
        "start": 597.458,
        "duration": 0.822
    },
    {
        "text": "The sum of all of those areas looks like adding up pi times d for each one,",
        "start": 598.68,
        "duration": 4.243
    },
    {
        "text": "and you can factor out that pi, but you also know that the sum of those",
        "start": 602.923,
        "duration": 4.021
    },
    {
        "text": "areas has to be at least the area of the hemisphere, which will be 2 times pi.",
        "start": 606.944,
        "duration": 4.356
    },
    {
        "text": "Therefore, the sum of the widths can never be below 2, and once again,",
        "start": 611.9,
        "duration": 3.764
    },
    {
        "text": "we've taken this problem which is very tricky to analyze directly,",
        "start": 615.664,
        "duration": 3.553
    },
    {
        "text": "but leveraged intuitions glean from living lives as three-dimensional creatures.",
        "start": 619.217,
        "duration": 4.243
    },
    {
        "text": "This next example has a little bit of a story behind it.",
        "start": 625.0,
        "duration": 2.7
    },
    {
        "text": "So I was at the International Math Olympiad earlier this year,",
        "start": 627.92,
        "duration": 2.934
    },
    {
        "text": "I was giving some lectures to the students participating in the contest,",
        "start": 630.854,
        "duration": 3.4
    },
    {
        "text": "and one of those lectures was essentially the video I'm giving you now,",
        "start": 634.254,
        "duration": 3.354
    },
    {
        "text": "kind of going through these examples of puzzles where you're in one dimension",
        "start": 637.608,
        "duration": 3.634
    },
    {
        "text": "but you have to step up.",
        "start": 641.242,
        "duration": 1.118
    },
    {
        "text": "And in the middle, I asked the students in the audience for more examples like this.",
        "start": 642.78,
        "duration": 3.78
    },
    {
        "text": "And I was reasonably confident that at least one of them would mention the",
        "start": 647.0,
        "duration": 3.593
    },
    {
        "text": "example I'm about to show you, because there's a really nice Numberphile video",
        "start": 650.593,
        "duration": 3.785
    },
    {
        "text": "about this one, it's by Tadashi Tokeda, who is always great, but as you'll see,",
        "start": 654.378,
        "duration": 3.832
    },
    {
        "text": "there was actually a little bit of a wrinkle that I wasn't anticipating here.",
        "start": 658.21,
        "duration": 3.69
    },
    {
        "text": "The setup for this problem is that we have three different circles,",
        "start": 662.54,
        "duration": 3.757
    },
    {
        "text": "just in two-dimensional space, and what we're going to do is draw the external tangents",
        "start": 666.297,
        "duration": 4.862
    },
    {
        "text": "to each pair of them.",
        "start": 671.159,
        "duration": 1.161
    },
    {
        "text": "So for example, here on the green and the red circle,",
        "start": 672.74,
        "duration": 2.075
    },
    {
        "text": "we've got these external tangents, and the thing we care about is where they intersect.",
        "start": 674.815,
        "duration": 3.345
    },
    {
        "text": "Similarly, I'll take the intersections of the external tangents",
        "start": 678.84,
        "duration": 3.891
    },
    {
        "text": "for that blue and red one and the external tangents on the green and the blue one.",
        "start": 682.731,
        "duration": 3.709
    },
    {
        "text": "And if I take a moment to just play around with the positions of these circles and",
        "start": 686.74,
        "duration": 3.926
    },
    {
        "text": "invite you to notice those three different points of intersection,",
        "start": 690.666,
        "duration": 3.169
    },
    {
        "text": "anything special about it, you might be able to guess what the relevant theorem or",
        "start": 693.835,
        "duration": 3.926
    },
    {
        "text": "the puzzle here is.",
        "start": 697.761,
        "duration": 0.899
    },
    {
        "text": "Basically, no matter where I position them,",
        "start": 699.5,
        "duration": 2.742
    },
    {
        "text": "all three of those points seem to fit on a given line.",
        "start": 702.242,
        "duration": 2.858
    },
    {
        "text": "The notion of external tangents doesn't really",
        "start": 705.68,
        "duration": 1.935
    },
    {
        "text": "make sense when one circle is inside the other",
        "start": 707.615,
        "duration": 1.978
    },
    {
        "text": "so let's assume that that doesn't happen,",
        "start": 709.593,
        "duration": 2.179
    },
    {
        "text": "though we can revisit that a little later.",
        "start": 711.772,
        "duration": 1.868
    },
    {
        "text": "And another assumption you might want to make is that no two circles have the same size,",
        "start": 713.98,
        "duration": 3.989
    },
    {
        "text": "because if two of them did have the same size,",
        "start": 717.969,
        "duration": 2.106
    },
    {
        "text": "those external tangents are parallel, they don't intersect.",
        "start": 720.075,
        "duration": 2.645
    },
    {
        "text": "You could make this sensible with the notion of projective geometry,",
        "start": 723.24,
        "duration": 3.095
    },
    {
        "text": "which takes seriously the idea of points at infinity, but for our purposes,",
        "start": 726.335,
        "duration": 3.41
    },
    {
        "text": "think of three circles that don't intersect and don't have the same size.",
        "start": 729.745,
        "duration": 3.275
    },
    {
        "text": "The claim, the theorem, the thing you need to prove is that those three",
        "start": 733.4,
        "duration": 3.6
    },
    {
        "text": "intersection points of the external tangents always fall on the same line.",
        "start": 737.0,
        "duration": 3.7
    },
    {
        "text": "At this point, you know the theme, we're going to take a step up into the third dimension.",
        "start": 741.16,
        "duration": 4.6
    },
    {
        "text": "Namely, imagine that each one of these circles is the equator of some sphere.",
        "start": 746.8,
        "duration": 3.86
    },
    {
        "text": "Now around any given pair of those spheres, like this green",
        "start": 751.32,
        "duration": 2.722
    },
    {
        "text": "one and the blue one for example, there are a whole bunch of",
        "start": 754.042,
        "duration": 2.768
    },
    {
        "text": "different external tangents that all intersect at the same point.",
        "start": 756.81,
        "duration": 2.95
    },
    {
        "text": "You essentially just rotate the two that we had about the axis between these two.",
        "start": 760.04,
        "duration": 4.02
    },
    {
        "text": "And then similarly for each other pair of spheres, like that blue one and the red one,",
        "start": 764.68,
        "duration": 4.255
    },
    {
        "text": "there's this cone of external tangents all intersecting at that point,",
        "start": 768.935,
        "duration": 3.474
    },
    {
        "text": "and between the red and the green one, another cone of external tangents.",
        "start": 772.409,
        "duration": 3.571
    },
    {
        "text": "You might ask, why on earth would this be helpful?",
        "start": 776.48,
        "duration": 2.0
    },
    {
        "text": "And the key is to think about a plane that's kind",
        "start": 779.12,
        "duration": 2.677
    },
    {
        "text": "of resting on top of all three of those balls.",
        "start": 781.797,
        "duration": 2.463
    },
    {
        "text": "I claim that this plane goes through the three different points that we care about.",
        "start": 785.3,
        "duration": 3.42
    },
    {
        "text": "And the reason basically is if you draw this line between the tangency point of the",
        "start": 789.3,
        "duration": 4.21
    },
    {
        "text": "plane on the green sphere, let's say, and the tangency point on the blue sphere,",
        "start": 793.51,
        "duration": 4.059
    },
    {
        "text": "that's one of those external tangents that goes through this little intersection here.",
        "start": 797.569,
        "duration": 4.311
    },
    {
        "text": "And then similarly, if you draw the line on the tangency point",
        "start": 802.38,
        "duration": 2.909
    },
    {
        "text": "of the sphere for the red and the green, it's one of those",
        "start": 805.289,
        "duration": 2.724
    },
    {
        "text": "external tangents that goes to the other one, and likewise over here.",
        "start": 808.013,
        "duration": 3.187
    },
    {
        "text": "We have another line on that plane that passes through the point,",
        "start": 811.3,
        "duration": 2.667
    },
    {
        "text": "so in particular the plane itself has to go through all three of these points.",
        "start": 813.967,
        "duration": 3.153
    },
    {
        "text": "But those three points also live on a different shared plane,",
        "start": 817.86,
        "duration": 3.151
    },
    {
        "text": "namely the plane of the original problem where the three circles lived.",
        "start": 821.011,
        "duration": 3.609
    },
    {
        "text": "So they have to live somewhere on the intersection between these two planes,",
        "start": 824.96,
        "duration": 4.146
    },
    {
        "text": "and any two planes in 3D space that aren't parallel to each other intersect along a line.",
        "start": 829.106,
        "duration": 4.794
    },
    {
        "text": "Therefore, the three points that we care about have to always sit on a line.",
        "start": 834.72,
        "duration": 2.9
    },
    {
        "text": "This is more or less the content of that Numberphile video,",
        "start": 838.3,
        "duration": 2.968
    },
    {
        "text": "and leave it to one of those clever IMO students to point out how it's",
        "start": 841.268,
        "duration": 3.513
    },
    {
        "text": "actually not quite a valid argument, in the sense that it's not fully general.",
        "start": 844.781,
        "duration": 3.859
    },
    {
        "text": "One of the students raised her hand and pointed out that if you have",
        "start": 849.08,
        "duration": 3.136
    },
    {
        "text": "a setup where one of the spheres is smaller than the other two,",
        "start": 852.216,
        "duration": 2.91
    },
    {
        "text": "and you place it somewhere in the middle here, then if you try to play this game,",
        "start": 855.126,
        "duration": 3.728
    },
    {
        "text": "there is no way for that plane to rest on top of all three of them.",
        "start": 858.854,
        "duration": 3.046
    },
    {
        "text": "You might imagine kind of rotating it around those two big ones.",
        "start": 862.34,
        "duration": 2.94
    },
    {
        "text": "So in other words, the argument does work for certain positions of those three circles,",
        "start": 867.04,
        "duration": 4.13
    },
    {
        "text": "but it doesn't work for all of them.",
        "start": 871.17,
        "duration": 1.69
    },
    {
        "text": "And then after that talk, the deputy leader for the Slovakian team",
        "start": 874.36,
        "duration": 3.309
    },
    {
        "text": "mentioned to me that there is actually a way that you can save this",
        "start": 877.669,
        "duration": 3.359
    },
    {
        "text": "proof and preserve the overall lesson of taking a step into the third dimension.",
        "start": 881.028,
        "duration": 3.952
    },
    {
        "text": "The key is that instead of using spheres, we should really be using cones.",
        "start": 885.5,
        "duration": 3.72
    },
    {
        "text": "So now we have these three different cones, each of which has a base at one of",
        "start": 890.68,
        "duration": 3.348
    },
    {
        "text": "the circles, and the only thing that we need is that the angles at the top of",
        "start": 894.028,
        "duration": 3.306
    },
    {
        "text": "each one of them are the same, so that they're three different similar shapes.",
        "start": 897.334,
        "duration": 3.306
    },
    {
        "text": "Now consider the line passing through the tip of two different ones of those cones.",
        "start": 901.28,
        "duration": 4.06
    },
    {
        "text": "I claim that that line also passes through the intersection point",
        "start": 906.0,
        "duration": 3.574
    },
    {
        "text": "between the external tangents of the circles that we care about.",
        "start": 909.574,
        "duration": 3.466
    },
    {
        "text": "The reason is that this point is what's called,",
        "start": 913.56,
        "duration": 2.233
    },
    {
        "text": "the center of similarity for those two shapes.",
        "start": 915.793,
        "duration": 2.187
    },
    {
        "text": "What I mean by that is that if you scale the big version of this shape about that point,",
        "start": 918.46,
        "duration": 4.099
    },
    {
        "text": "then at some point along the way, it coincides with the smaller version of that shape.",
        "start": 922.559,
        "duration": 3.961
    },
    {
        "text": "From this perspective, you can see how the line through the tips",
        "start": 926.86,
        "duration": 2.465
    },
    {
        "text": "of those cones has to pass through that center of similarity.",
        "start": 929.325,
        "duration": 2.315
    },
    {
        "text": "If we look from above, you can see how the external",
        "start": 932.2,
        "duration": 2.468
    },
    {
        "text": "tangents also pass through that center.",
        "start": 934.668,
        "duration": 1.852
    },
    {
        "text": "Essentially the diagram that consists of this little circle with those external",
        "start": 937.12,
        "duration": 4.096
    },
    {
        "text": "tangents intersecting at that point is a scaled-down version of the diagram",
        "start": 941.216,
        "duration": 3.891
    },
    {
        "text": "consisting of this big circle and those external tangents intersecting at that point.",
        "start": 945.107,
        "duration": 4.353
    },
    {
        "text": "And then similarly, if you look at the lines passing through the tips of any other",
        "start": 950.46,
        "duration": 4.11
    },
    {
        "text": "pair of cones, those lines will correspond to another one of those intersection points.",
        "start": 954.57,
        "duration": 4.31
    },
    {
        "text": "Now we can talk about the plane that passes through the tips of all of these three cones.",
        "start": 959.54,
        "duration": 4.5
    },
    {
        "text": "And there's no more worry about generality, because any three points in space,",
        "start": 964.78,
        "duration": 3.636
    },
    {
        "text": "no matter where they are, have some plane that passes through them.",
        "start": 968.416,
        "duration": 3.084
    },
    {
        "text": "For example, if we move that smaller circle into the problem position from earlier,",
        "start": 972.0,
        "duration": 3.925
    },
    {
        "text": "there's no issue.",
        "start": 975.925,
        "duration": 0.795
    },
    {
        "text": "The three different tips of the cones uniquely determine a plane.",
        "start": 976.96,
        "duration": 2.6
    },
    {
        "text": "That plane intersects with the xy plane, at least assuming the",
        "start": 980.02,
        "duration": 3.203
    },
    {
        "text": "three cones don't all have the same size, and the line of",
        "start": 983.223,
        "duration": 2.949
    },
    {
        "text": "intersection is exactly the line that we're trying to prove exists.",
        "start": 986.172,
        "duration": 3.408
    },
    {
        "text": "If any of you know the origin for this fixed version of the argument, let me know.",
        "start": 990.2,
        "duration": 3.66
    },
    {
        "text": "That leader of the Slovakian team mentioned that he had heard",
        "start": 994.18,
        "duration": 2.551
    },
    {
        "text": "it from someone else but couldn't quite remember from where.",
        "start": 996.731,
        "duration": 2.469
    },
    {
        "text": "There's another benefit you get by shifting the focus to the center of similarity",
        "start": 1000.24,
        "duration": 3.847
    },
    {
        "text": "rather than describing these points as the intersection of external tangents.",
        "start": 1004.087,
        "duration": 3.613
    },
    {
        "text": "In this framing, it's perfectly sensible for one circle to sit inside the other.",
        "start": 1007.96,
        "duration": 3.78
    },
    {
        "text": "Even if you can't draw external tangents, there's still some point such that",
        "start": 1012.26,
        "duration": 4.12
    },
    {
        "text": "if you scale one circle about that point, it will coincide with the other.",
        "start": 1016.38,
        "duration": 3.96
    },
    {
        "text": "This actually made it way easier to program.",
        "start": 1020.78,
        "duration": 1.72
    },
    {
        "text": "Notice how wherever I put these circles, we always",
        "start": 1022.76,
        "duration": 2.191
    },
    {
        "text": "get these three points that fall on a line.",
        "start": 1024.951,
        "duration": 1.849
    },
    {
        "text": "In fact, these don't even need to be circles.",
        "start": 1027.319,
        "duration": 1.701
    },
    {
        "text": "They could be any three similar shapes as long as they're all in the same orientation.",
        "start": 1029.3,
        "duration": 4.059
    },
    {
        "text": "And you can say those three centers of similarity always must fall on a line.",
        "start": 1033.88,
        "duration": 4.459
    },
    {
        "text": "And you can use essentially that same argument using cones to show this,",
        "start": 1038.8,
        "duration": 3.441
    },
    {
        "text": "except instead of cones, you would have some kind of pyramid shape.",
        "start": 1042.241,
        "duration": 3.159
    },
    {
        "text": "At this point, having logged three wonderful examples of two-dimensional",
        "start": 1046.579,
        "duration": 3.491
    },
    {
        "text": "puzzles that somehow leverage a three-dimensional insight,",
        "start": 1050.07,
        "duration": 2.821
    },
    {
        "text": "a natural question you might ask is whether there's a three-dimensional",
        "start": 1052.891,
        "duration": 3.442
    },
    {
        "text": "puzzle that somehow involves stepping up into four dimensions to answer it.",
        "start": 1056.333,
        "duration": 3.587
    },
    {
        "text": "The last two puzzles I want to bring up offer attempts at an answer to that.",
        "start": 1060.34,
        "duration": 3.58
    },
    {
        "text": "For this next one, imagine that you have four different points in",
        "start": 1064.42,
        "duration": 3.431
    },
    {
        "text": "three-dimensional space and they form the vertices of a tetrahedron,",
        "start": 1067.851,
        "duration": 3.589
    },
    {
        "text": "basically the shapes such that those four different points are its corners.",
        "start": 1071.44,
        "duration": 3.9
    },
    {
        "text": "In principle, if you know the coordinates of those points,",
        "start": 1076.02,
        "duration": 2.305
    },
    {
        "text": "you know everything you need to about this shape.",
        "start": 1078.325,
        "duration": 1.915
    },
    {
        "text": "But the challenge I present to you is to write an explicit formula for the volume",
        "start": 1080.66,
        "duration": 4.288
    },
    {
        "text": "of this tetrahedron in terms of the coordinates of those four different points.",
        "start": 1084.948,
        "duration": 4.132
    },
    {
        "text": "And this time, I'm actually not going to show you the full answer to this puzzle.",
        "start": 1089.9,
        "duration": 3.06
    },
    {
        "text": "I will give you a major spoiler, which is that one elegant way to view it involves",
        "start": 1093.62,
        "duration": 4.229
    },
    {
        "text": "thinking about the determinant of a certain 4x4 matrix,",
        "start": 1097.849,
        "duration": 2.853
    },
    {
        "text": "and I'll also suggest that it would be very helpful to try thinking about the analogous",
        "start": 1100.702,
        "duration": 4.484
    },
    {
        "text": "puzzle one dimension lower, where you're finding the area of a triangle given the",
        "start": 1105.186,
        "duration": 4.178
    },
    {
        "text": "coordinates of its corners.",
        "start": 1109.364,
        "duration": 1.376
    },
    {
        "text": "The main reason I don't want to give the full answer right away is that solving",
        "start": 1111.54,
        "duration": 4.406
    },
    {
        "text": "this puzzle and its analogs in various different dimensions actually offers a",
        "start": 1115.946,
        "duration": 4.297
    },
    {
        "text": "really nice explanation for why the formula for the determinant is what it is.",
        "start": 1120.243,
        "duration": 4.297
    },
    {
        "text": "And as such, I think that distilling that into its own little video",
        "start": 1124.54,
        "duration": 3.224
    },
    {
        "text": "should make a really nice addition to the linear algebra series.",
        "start": 1127.764,
        "duration": 3.036
    },
    {
        "text": "So skipping now to the very last example, rather than beginning with",
        "start": 1131.84,
        "duration": 3.406
    },
    {
        "text": "a puzzle and seeking an insight, what we're going to do is start with",
        "start": 1135.246,
        "duration": 3.456
    },
    {
        "text": "the insight and see if we can try to construct the puzzle around it.",
        "start": 1138.702,
        "duration": 3.358
    },
    {
        "text": "Looking back at the first puzzle that we did, you might have the idea that",
        "start": 1142.52,
        "duration": 4.049
    },
    {
        "text": "it would be fun to try finding an equivalent of this but one dimension higher.",
        "start": 1146.569,
        "duration": 4.211
    },
    {
        "text": "What is the three-dimensional tiling pattern where a four-dimensional creature could",
        "start": 1150.78,
        "duration": 4.823
    },
    {
        "text": "stare at it, squint their eyes, and somehow see it as a stack of four-dimensional",
        "start": 1155.603,
        "duration": 4.652
    },
    {
        "text": "hypercubes?",
        "start": 1160.255,
        "duration": 0.625
    },
    {
        "text": "And instead of asking about rotating these hexagons whenever we find them,",
        "start": 1161.72,
        "duration": 4.439
    },
    {
        "text": "what is the equivalent move that we could understand as 3D creatures,",
        "start": 1166.159,
        "duration": 4.143
    },
    {
        "text": "but which the 4D creature could somehow think about as adding or removing hypercubes",
        "start": 1170.302,
        "duration": 5.031
    },
    {
        "text": "from that stack?",
        "start": 1175.333,
        "duration": 0.947
    },
    {
        "text": "This is certainly a very mind-bending exercise,",
        "start": 1176.96,
        "duration": 2.667
    },
    {
        "text": "and the puzzle that we'll ultimately construct is maybe a little contrived,",
        "start": 1179.627,
        "duration": 4.225
    },
    {
        "text": "but I found it super fun to think through, and it definitely gave me a new intuition",
        "start": 1183.852,
        "duration": 4.724
    },
    {
        "text": "for a certain 3D shape that I had not had before.",
        "start": 1188.576,
        "duration": 2.724
    },
    {
        "text": "To start off, it helps to put some numbers to the way they were thinking about a cube,",
        "start": 1192.1,
        "duration": 4.444
    },
    {
        "text": "where one natural choice is to put it in 3D space such that one vertex sits",
        "start": 1196.544,
        "duration": 3.883
    },
    {
        "text": "at the origin, coordinates 0, 0, 0, and then all of the other vertices are",
        "start": 1200.427,
        "duration": 3.832
    },
    {
        "text": "kind of every combination of 0s and 1s that you can come up with.",
        "start": 1204.259,
        "duration": 3.321
    },
    {
        "text": "And notice how I'm drawing an edge between two different",
        "start": 1208.0,
        "duration": 2.976
    },
    {
        "text": "vertices whenever they only differ in one coordinate, for example,",
        "start": 1210.976,
        "duration": 3.498
    },
    {
        "text": "differing only in the x-direction or only in the y-direction.",
        "start": 1214.474,
        "duration": 3.186
    },
    {
        "text": "For a four-dimensional cube, you could do the same thing in principle.",
        "start": 1218.36,
        "duration": 3.0
    },
    {
        "text": "Your coordinates are lists of four numbers, and all of the vertices of",
        "start": 1221.8,
        "duration": 3.854
    },
    {
        "text": "the cube are going to be every possible combination that involves 0s and 1s.",
        "start": 1225.654,
        "duration": 4.126
    },
    {
        "text": "What I'm showing right now is just the three-dimensional base of that hypercube.",
        "start": 1230.26,
        "duration": 3.78
    },
    {
        "text": "It's analogous to the base square on our cube, where the z-coordinate is all 0.",
        "start": 1234.04,
        "duration": 4.54
    },
    {
        "text": "Notice how here that last coordinate is 0 for all of them.",
        "start": 1239.02,
        "duration": 2.66
    },
    {
        "text": "Even if we struggle to visualize it, in principle the rest of the hypercube",
        "start": 1242.14,
        "duration": 3.856
    },
    {
        "text": "comes from increasing that last coordinate by one unit,",
        "start": 1245.996,
        "duration": 2.841
    },
    {
        "text": "stepping in some direction that we can't quite imagine,",
        "start": 1248.837,
        "duration": 2.841
    },
    {
        "text": "which gives us this other 3D cube, which is the analogue of the top face",
        "start": 1251.678,
        "duration": 3.704
    },
    {
        "text": "that we might have looked at earlier.",
        "start": 1255.382,
        "duration": 1.878
    },
    {
        "text": "And again, the rule with the edges is to connect any pair",
        "start": 1257.72,
        "duration": 2.743
    },
    {
        "text": "of vertices that differ only in one of those coordinates.",
        "start": 1260.463,
        "duration": 2.697
    },
    {
        "text": "The tiling puzzle we did involved looking at these cubes from a very specific direction,",
        "start": 1264.62,
        "duration": 4.557
    },
    {
        "text": "where we were kind of staring down this diagonal direction,",
        "start": 1269.177,
        "duration": 3.072
    },
    {
        "text": "and the way it projects onto our eye looks like a hexagon.",
        "start": 1272.249,
        "duration": 2.971
    },
    {
        "text": "One way to think about this that lends itself to actually coding it up for a higher",
        "start": 1276.02,
        "duration": 4.584
    },
    {
        "text": "dimension is to consider the vector with coordinates 1, 1,",
        "start": 1280.604,
        "duration": 3.221
    },
    {
        "text": "1 sitting in that diagonal direction, and projecting everything onto the plane",
        "start": 1283.825,
        "duration": 4.312
    },
    {
        "text": "perpendicular to that vector.",
        "start": 1288.137,
        "duration": 1.583
    },
    {
        "text": "You can write an explicit formula for this that basically takes any",
        "start": 1289.72,
        "duration": 4.21
    },
    {
        "text": "point and kind of subtracts off its component along that direction.",
        "start": 1293.93,
        "duration": 4.15
    },
    {
        "text": "More generally, if you had a whole stack of cubes and you project them",
        "start": 1299.26,
        "duration": 3.838
    },
    {
        "text": "all down on this direction, it creates for you this hexagonal grid.",
        "start": 1303.098,
        "duration": 3.622
    },
    {
        "text": "With the 4D cube, even though again we struggle to really think about what it looks like,",
        "start": 1309.14,
        "duration": 4.472
    },
    {
        "text": "we can at least have the computer play the same game,",
        "start": 1313.612,
        "duration": 2.683
    },
    {
        "text": "where I'll consider the 4-dimensional vector 1, 1, 1, 1,",
        "start": 1316.295,
        "duration": 2.832
    },
    {
        "text": "and project everything onto the space perpendicular to that vector,",
        "start": 1319.127,
        "duration": 3.379
    },
    {
        "text": "which will be a 3-dimensional subspace of 4 dimensions.",
        "start": 1322.506,
        "duration": 2.734
    },
    {
        "text": "When I do that for this wire frame of the 4-dimensional cube, here's what it looks like.",
        "start": 1325.72,
        "duration": 4.32
    },
    {
        "text": "It's this very beautiful and symmetric shape, and if instead of the wire frame",
        "start": 1330.28,
        "duration": 4.061
    },
    {
        "text": "I make it solid, this has a special name, it's called a rhombic dodecahedron.",
        "start": 1334.341,
        "duration": 3.959
    },
    {
        "text": "There's a really nice video with Matt Parker and Adam Savage featuring a",
        "start": 1338.86,
        "duration": 3.904
    },
    {
        "text": "rhombic dodecahedron, where they construct this beautiful lightbox that",
        "start": 1342.764,
        "duration": 3.85
    },
    {
        "text": "features the fact that you can tessellate 3-dimensional space using this shape.",
        "start": 1346.614,
        "duration": 4.226
    },
    {
        "text": "That's really not obvious, at least to me, when I just look at it,",
        "start": 1351.42,
        "duration": 3.264
    },
    {
        "text": "but if you know that this is a natural projection of a hypercube,",
        "start": 1354.684,
        "duration": 3.215
    },
    {
        "text": "that actually tells you that it must tessellate 3D space,",
        "start": 1357.899,
        "duration": 2.826
    },
    {
        "text": "because you could project down a stack of those hypercubes.",
        "start": 1360.725,
        "duration": 2.875
    },
    {
        "text": "In our puzzle, we weren't just looking at the wire frames for these cubes,",
        "start": 1365.16,
        "duration": 3.584
    },
    {
        "text": "they had actual square faces, and when we stare down one of these corners,",
        "start": 1368.744,
        "duration": 3.584
    },
    {
        "text": "we only really see three of those faces.",
        "start": 1372.328,
        "duration": 1.912
    },
    {
        "text": "When there is a cube, it's the three faces pointed out,",
        "start": 1374.88,
        "duration": 2.751
    },
    {
        "text": "and when there was no cube in that position, we had the kind of indent,",
        "start": 1377.631,
        "duration": 3.537
    },
    {
        "text": "which is like the three faces of the cube on the inside.",
        "start": 1381.168,
        "duration": 2.752
    },
    {
        "text": "Projecting those three faces down is what gives",
        "start": 1384.56,
        "duration": 2.518
    },
    {
        "text": "us those three rhombuses that form a hexagon.",
        "start": 1387.078,
        "duration": 2.362
    },
    {
        "text": "To think through the analog of this one dimension up,",
        "start": 1389.96,
        "duration": 2.432
    },
    {
        "text": "again it helps to put some numbers to things.",
        "start": 1392.392,
        "duration": 2.028
    },
    {
        "text": "Let me draw these three different basis vectors that span the cube,",
        "start": 1395.0,
        "duration": 3.409
    },
    {
        "text": "the unit vectors in the x direction, the y direction, and the z direction.",
        "start": 1398.409,
        "duration": 3.711
    },
    {
        "text": "Notice how each one of these inner faces corresponds to a pair of those basis vectors.",
        "start": 1402.9,
        "duration": 5.24
    },
    {
        "text": "The analogous game that we can play one dimension up is to take the four different",
        "start": 1408.94,
        "duration": 4.824
    },
    {
        "text": "basis vectors up there and project them down to 3D, again along this diagonal direction.",
        "start": 1413.764,
        "duration": 5.116
    },
    {
        "text": "This is analogous to projecting those three basis vectors",
        "start": 1419.64,
        "duration": 3.195
    },
    {
        "text": "into the hexagon so that they all sit 120 degrees apart.",
        "start": 1422.835,
        "duration": 3.085
    },
    {
        "text": "And now, instead of talking about the square faces of the cube getting",
        "start": 1426.3,
        "duration": 4.016
    },
    {
        "text": "projected as rhombuses, we think about the cubical cells of that hypercube.",
        "start": 1430.316,
        "duration": 4.244
    },
    {
        "text": "Each one in this case corresponds to a way that you",
        "start": 1435.18,
        "duration": 2.382
    },
    {
        "text": "could choose three out of those four basis vectors.",
        "start": 1437.562,
        "duration": 2.338
    },
    {
        "text": "Each of them is this kind of squished cube shape,",
        "start": 1441.7,
        "duration": 2.446
    },
    {
        "text": "and the four of them together fit very nicely to create this rhombic dodecahedron.",
        "start": 1444.146,
        "duration": 4.014
    },
    {
        "text": "Now, in our original puzzle, the game was whenever you see this",
        "start": 1450.9,
        "duration": 3.507
    },
    {
        "text": "hexagon built out of the three rhombuses, you rotate it 60 degrees.",
        "start": 1454.407,
        "duration": 3.673
    },
    {
        "text": "But we're going to have to change how we think about that move.",
        "start": 1458.08,
        "duration": 2.94
    },
    {
        "text": "Notice how when I go from the inner faces of the cube to the outer faces,",
        "start": 1461.68,
        "duration": 3.633
    },
    {
        "text": "I can slide each one of them in a direction perpendicular to that face.",
        "start": 1465.313,
        "duration": 3.487
    },
    {
        "text": "Down on the projection, what that looks like is",
        "start": 1470.18,
        "duration": 2.208
    },
    {
        "text": "sliding each one of these rhombuses through the origin.",
        "start": 1472.388,
        "duration": 2.532
    },
    {
        "text": "We can play the same game with the projections of those cubes in four dimensions,",
        "start": 1476.84,
        "duration": 4.388
    },
    {
        "text": "where if you take each one of these four and let it slide through the origin,",
        "start": 1481.228,
        "duration": 4.174
    },
    {
        "text": "it gives you a distinct way to tile that rhombic dodecahedron.",
        "start": 1485.402,
        "duration": 3.318
    },
    {
        "text": "So with all of that as setup, here is the absurd puzzle that you could",
        "start": 1491.4,
        "duration": 4.013
    },
    {
        "text": "present to someone next time you find yourself at a nerdy cocktail party.",
        "start": 1495.413,
        "duration": 4.127
    },
    {
        "text": "First you describe this squished cube shape here.",
        "start": 1499.84,
        "duration": 2.52
    },
    {
        "text": "It involves taking six of those rhombuses that we",
        "start": 1502.64,
        "duration": 2.646
    },
    {
        "text": "had earlier and forming a polyhedron out of them.",
        "start": 1505.286,
        "duration": 2.594
    },
    {
        "text": "You say, imagine this has a side length of one,",
        "start": 1508.4,
        "duration": 2.997
    },
    {
        "text": "and you're going to use many copies of this shape to tile a big rhombic dodecahedron",
        "start": 1511.397,
        "duration": 5.309
    },
    {
        "text": "with some kind of integer side length.",
        "start": 1516.706,
        "duration": 2.374
    },
    {
        "text": "The game is that every time inside this big tiling you find a small 1x1x1 rhombic",
        "start": 1519.6,
        "duration": 4.726
    },
    {
        "text": "dodecahedron, you make this move where each piece can slide through the middle.",
        "start": 1524.326,
        "duration": 4.554
    },
    {
        "text": "And then for the puzzle, you ask what is the maximum number",
        "start": 1529.24,
        "duration": 3.068
    },
    {
        "text": "of moves that it might take to get from one tiling to another.",
        "start": 1532.308,
        "duration": 3.172
    },
    {
        "text": "This is absurdly confusing to think about, but if you somehow know that this is",
        "start": 1536.34,
        "duration": 4.611
    },
    {
        "text": "all a projection of a stack of hypercubes, it can lead you to conclude the answer",
        "start": 1540.951,
        "duration": 4.727
    },
    {
        "text": "has to be the size of that big rhombic dodecahedron, let's call it n to the power 4.",
        "start": 1545.678,
        "duration": 4.842
    },
    {
        "text": "Zooming out a bit, all of these puzzles are really just for fun.",
        "start": 1552.14,
        "duration": 3.64
    },
    {
        "text": "Aside from sharing them with nerdy friends at parties,",
        "start": 1556.14,
        "duration": 2.357
    },
    {
        "text": "there's not really a lot of direct utility.",
        "start": 1558.497,
        "duration": 1.843
    },
    {
        "text": "But they illustrate a much broader phenomenon in math,",
        "start": 1561.02,
        "duration": 2.939
    },
    {
        "text": "where constructs in some higher dimension can be bizarrely relevant to solving problems",
        "start": 1563.959,
        "duration": 4.702
    },
    {
        "text": "more easily, either in a lower number of dimensions,",
        "start": 1568.661,
        "duration": 2.832
    },
    {
        "text": "or even solving problems that don't seem geometric at first.",
        "start": 1571.493,
        "duration": 3.207
    },
    {
        "text": "For example, there's an extension of the complex numbers that naturally",
        "start": 1575.14,
        "duration": 3.464
    },
    {
        "text": "live up in four dimensions, they're called the quaternions,",
        "start": 1578.604,
        "duration": 2.886
    },
    {
        "text": "and they offer a really elegant way to encode and to work with three dimensions.",
        "start": 1581.49,
        "duration": 3.85
    },
    {
        "text": "You don't have to understand four dimensions to work with them,",
        "start": 1586.2,
        "duration": 3.124
    },
    {
        "text": "in the description I'll give you some links to some really nice videos to show",
        "start": 1589.324,
        "duration": 3.856
    },
    {
        "text": "practically working with quaternions, but they are doing something very special",
        "start": 1593.18,
        "duration": 3.905
    },
    {
        "text": "up in four dimensions, rotating a hypersphere in a way that's not just rigid motion,",
        "start": 1597.085,
        "duration": 4.149
    },
    {
        "text": "but a kind of extra rigidity unlike anything we know in two or three dimensions.",
        "start": 1601.234,
        "duration": 3.906
    },
    {
        "text": "If you're curious, I made a whole video and then a sequence of interactive",
        "start": 1605.74,
        "duration": 3.836
    },
    {
        "text": "videos a while back trying to understand what exactly that 4D motion is.",
        "start": 1609.576,
        "duration": 3.684
    },
    {
        "text": "Another example, if you step up into 24 dimensions,",
        "start": 1614.22,
        "duration": 2.994
    },
    {
        "text": "is how there's this unusually elegant way to pack spheres together,",
        "start": 1617.214,
        "duration": 3.915
    },
    {
        "text": "and that weird high dimensional sphere packing is very closely tied",
        "start": 1621.129,
        "duration": 3.916
    },
    {
        "text": "to a type of error correction code that was actually used on the Voyager spacecrafts.",
        "start": 1625.045,
        "duration": 4.895
    },
    {
        "text": "If you scale up your dimensions even further, something funny starts",
        "start": 1629.94,
        "duration": 3.522
    },
    {
        "text": "to happen with the statistics of random vectors,",
        "start": 1633.462,
        "duration": 2.502
    },
    {
        "text": "where a pair of random vectors will have a very high chance of being nearly perpendicular.",
        "start": 1635.964,
        "duration": 4.596
    },
    {
        "text": "In the series on neural networks, I mentioned how this fact could be relevant",
        "start": 1641.04,
        "duration": 3.746
    },
    {
        "text": "to explaining why large language models perform so much better at scale,",
        "start": 1644.786,
        "duration": 3.507
    },
    {
        "text": "and this is a fact that's also very relevant to a number of compression algorithms.",
        "start": 1648.293,
        "duration": 3.987
    },
    {
        "text": "But the reason that these puzzles I've laid out make me feel a little sad thinking about",
        "start": 1652.98,
        "duration": 4.231
    },
    {
        "text": "four dimensional geometry is that there's a difference between analysis and intuition.",
        "start": 1657.211,
        "duration": 4.089
    },
    {
        "text": "You and I can stare at this tiling of rhombuses,",
        "start": 1661.76,
        "duration": 2.69
    },
    {
        "text": "squint our eyes, and somehow think of it as a stack of cubes.",
        "start": 1664.45,
        "duration": 3.35
    },
    {
        "text": "If you've ever pondered spheres and their surface area,",
        "start": 1668.32,
        "duration": 2.829
    },
    {
        "text": "you have at least a chance for making this creative leap when you're faced with that",
        "start": 1671.149,
        "duration": 4.294
    },
    {
        "text": "puzzle about strips on a circle.",
        "start": 1675.443,
        "duration": 1.617
    },
    {
        "text": "In trying to prove that three points sit on a line,",
        "start": 1677.64,
        "duration": 2.936
    },
    {
        "text": "you and I can think about a line as an intersection of two planes in 3D space.",
        "start": 1680.576,
        "duration": 4.404
    },
    {
        "text": "That's not some opaque consequence of linear algebra,",
        "start": 1685.22,
        "duration": 2.754
    },
    {
        "text": "it's something we can really picture in our mind's eye.",
        "start": 1687.974,
        "duration": 2.806
    },
    {
        "text": "All of the examples I know of that use even higher dimensions to",
        "start": 1691.6,
        "duration": 3.694
    },
    {
        "text": "solve problems don't really involve intuition in quite the same way.",
        "start": 1695.294,
        "duration": 3.866
    },
    {
        "text": "There might be an analogy with lower dimensions, and analogies can be kind of dangerous,",
        "start": 1699.54,
        "duration": 4.672
    },
    {
        "text": "but the line of reasoning ultimately has to be purely analysis.",
        "start": 1704.212,
        "duration": 3.308
    },
    {
        "text": "To be clear, that's not a bad thing.",
        "start": 1708.48,
        "duration": 1.56
    },
    {
        "text": "Ultimately all of the rigor in any argument you make has to come from analysis.",
        "start": 1710.38,
        "duration": 3.76
    },
    {
        "text": "But analysis without intuition is daunting.",
        "start": 1714.8,
        "duration": 3.2
    },
    {
        "text": "The space of all possible logical moves you can make in the",
        "start": 1718.72,
        "duration": 3.441
    },
    {
        "text": "pursuit of a proof is often too vast to explore in a reasonable time.",
        "start": 1722.161,
        "duration": 3.959
    },
    {
        "text": "Intuition is what offers the guiding lights telling you which paths are worth trying.",
        "start": 1726.66,
        "duration": 4.52
    },
    {
        "text": "What I'm jealous of, and a little bit sad about,",
        "start": 1732.14,
        "duration": 2.669
    },
    {
        "text": "is the thought that there might be problems in three dimensions where somehow squinting",
        "start": 1734.809,
        "duration": 4.795
    },
    {
        "text": "your eyes as a four-dimensional creature or even higher would offer some guiding light",
        "start": 1739.604,
        "duration": 4.74
    },
    {
        "text": "that, to you and me, is inaccessible.",
        "start": 1744.344,
        "duration": 2.016
    },
    {
        "text": "Quick note for those of you supporting on Patreon,",
        "start": 1749.48,
        "duration": 2.38
    },
    {
        "text": "or for those of you who have thought about maybe joining to support the channel,",
        "start": 1751.86,
        "duration": 3.779
    },
    {
        "text": "I made a quick bonus supplement video to this one showing two more puzzles that have",
        "start": 1755.639,
        "duration": 3.967
    },
    {
        "text": "the same vibe where there's a question in two dimensions but the answer somehow",
        "start": 1759.606,
        "duration": 3.734
    },
    {
        "text": "involves three-dimensional thinking.",
        "start": 1763.34,
        "duration": 1.68
    },
    {
        "text": "It's quick and casual, but I think you'll like the problems, so see the links below.",
        "start": 1765.3,
        "duration": 3.12
    }
]