[
    {
        "text": "Suppose you love math, and you had to choose just one proof to show someone to explain ",
        "start": 3.88,
        "duration": 4.585
    },
    {
        "text": "why it is that math is beautiful, something that can be appreciated by anyone from a wide ",
        "start": 8.465,
        "duration": 4.744
    },
    {
        "text": "range of backgrounds while still capturing the spirit of progress and cleverness in math.",
        "start": 13.209,
        "duration": 4.691
    },
    {
        "text": "What would you choose?",
        "start": 18.3,
        "duration": 0.82
    },
    {
        "text": "After I put out a video on Feynman's Lost Lecture about why planets orbit in ellipses, ",
        "start": 20.06,
        "duration": 4.424
    },
    {
        "text": "published as a guest video over on MinutePhysics, ",
        "start": 24.484,
        "duration": 2.543
    },
    {
        "text": "someone on Reddit asked about why the definition of an ellipse given in that video, ",
        "start": 27.027,
        "duration": 4.272
    },
    {
        "text": "the classic two thumbtacks and a piece of string construction, ",
        "start": 31.299,
        "duration": 3.203
    },
    {
        "text": "is the same as the definition involving slicing a cone.",
        "start": 34.502,
        "duration": 2.798
    },
    {
        "text": "Well, my friend, you've asked about one of my all-time favorite proofs, ",
        "start": 38.12,
        "duration": 3.419
    },
    {
        "text": "a lovely bit of 3D geometry which, despite requiring almost no background, ",
        "start": 41.539,
        "duration": 3.561
    },
    {
        "text": "still captures the spirit of mathematical inventiveness.",
        "start": 45.1,
        "duration": 2.66
    },
    {
        "text": "For context and to make sure we're all on the same page, ",
        "start": 48.8,
        "duration": 2.637
    },
    {
        "text": "there are at least three main ways you could define an ellipse geometrically.",
        "start": 51.437,
        "duration": 3.563
    },
    {
        "text": "One is to say you take a circle and stretch it out in one dimension.",
        "start": 55.0,
        "duration": 4.22
    },
    {
        "text": "For example, maybe you consider all of the points as xy coordinates, ",
        "start": 59.9,
        "duration": 3.652
    },
    {
        "text": "and you multiply just the x coordinate by some special factor for all the points.",
        "start": 63.552,
        "duration": 4.288
    },
    {
        "text": "Another is the classic two thumbtacks and a piece of string construction, ",
        "start": 68.86,
        "duration": 4.028
    },
    {
        "text": "where you loop a string around two thumbtacks stuck into a piece of paper, ",
        "start": 72.888,
        "duration": 4.084
    },
    {
        "text": "pull it taut with a pencil, and trace around, keeping the string taut the whole time.",
        "start": 76.972,
        "duration": 4.628
    },
    {
        "text": "What you're drawing by doing this is the set of all points so that the sum of ",
        "start": 82.16,
        "duration": 4.709
    },
    {
        "text": "the distances from each pencil point to the two thumbtack points stays constant.",
        "start": 86.869,
        "duration": 4.831
    },
    {
        "text": "Those two thumbtack points are each called a focus of the ellipse, ",
        "start": 92.82,
        "duration": 3.205
    },
    {
        "text": "and what we're saying here is that this constant focal sum ",
        "start": 96.025,
        "duration": 2.823
    },
    {
        "text": "property can be used to define what an ellipse even is.",
        "start": 98.848,
        "duration": 2.632
    },
    {
        "text": "And yet another way to define an ellipse is to slice a cone with a plane at an angle, ",
        "start": 102.18,
        "duration": 4.443
    },
    {
        "text": "an angle that's smaller than the slope of the cone itself.",
        "start": 106.623,
        "duration": 2.997
    },
    {
        "text": "The curve of points where this plane and the cone intersect forms an ellipse, ",
        "start": 110.24,
        "duration": 4.407
    },
    {
        "text": "which is why you'll often hear ellipses referred to as a conic section.",
        "start": 114.647,
        "duration": 4.013
    },
    {
        "text": "Of course, an ellipse is not just one curve, it's a family of curves, ",
        "start": 119.88,
        "duration": 3.393
    },
    {
        "text": "ranging from a perfect circle up to something that's infinitely stretched.",
        "start": 123.273,
        "duration": 3.587
    },
    {
        "text": "The specific shape of an ellipse is typically quantified with a number called ",
        "start": 127.48,
        "duration": 4.102
    },
    {
        "text": "its eccentricity, which I sometimes just read in my head as squishification.",
        "start": 131.582,
        "duration": 3.998
    },
    {
        "text": "A circle has eccentricity 0, and the more squished the ellipse is, ",
        "start": 136.14,
        "duration": 4.008
    },
    {
        "text": "the closer its eccentricity is to the number 1.",
        "start": 140.148,
        "duration": 2.812
    },
    {
        "text": "For example, Earth's orbit has an eccentricity 0.0167, very low squishification, ",
        "start": 143.92,
        "duration": 5.994
    },
    {
        "text": "meaning it's really close to just being a circle, ",
        "start": 149.914,
        "duration": 3.701
    },
    {
        "text": "while Halley's comet has an orbit with eccentricity 0.9671, very high squishification.",
        "start": 153.615,
        "duration": 6.365
    },
    {
        "text": "In the thumbtack definition of an ellipse, based on the constant ",
        "start": 160.44,
        "duration": 3.689
    },
    {
        "text": "sum of the distances from each point to the two foci, ",
        "start": 164.129,
        "duration": 3.064
    },
    {
        "text": "this eccentricity is determined by how far apart the two thumbtacks are.",
        "start": 167.193,
        "duration": 4.087
    },
    {
        "text": "Specifically, it's the distance between the foci ",
        "start": 171.58,
        "duration": 3.115
    },
    {
        "text": "divided by the length of the longest axis of the ellipse.",
        "start": 174.695,
        "duration": 3.625
    },
    {
        "text": "For slicing a cone, the eccentricity is determined ",
        "start": 180.42,
        "duration": 2.82
    },
    {
        "text": "by the slope of the plane you used for the slicing.",
        "start": 183.24,
        "duration": 2.82
    },
    {
        "text": "And you might justifiably ask, especially if you're a certain reddit user, ",
        "start": 187.16,
        "duration": 3.575
    },
    {
        "text": "why on Earth should these three definitions have anything to do with each other?",
        "start": 190.735,
        "duration": 3.815
    },
    {
        "text": "I mean, sure, it kind of makes sense that each should produce some vaguely ",
        "start": 195.03,
        "duration": 4.23
    },
    {
        "text": "oval-looking stretched out loop, but why should the family of curves produced ",
        "start": 199.26,
        "duration": 4.401
    },
    {
        "text": "by these three totally different methods be precisely the same shapes?",
        "start": 203.661,
        "duration": 3.949
    },
    {
        "text": "In particular, when I was younger I remember feeling really ",
        "start": 208.39,
        "duration": 3.146
    },
    {
        "text": "surprised that slicing a cone would produce such a symmetric shape.",
        "start": 211.536,
        "duration": 3.514
    },
    {
        "text": "You might think that the part of the intersection farther down ",
        "start": 215.55,
        "duration": 3.376
    },
    {
        "text": "would kind of bulge out and produce a more lopsided egg shape.",
        "start": 218.926,
        "duration": 3.324
    },
    {
        "text": "But nope, the intersection curve is an ellipse, ",
        "start": 223.03,
        "duration": 2.493
    },
    {
        "text": "the same evidently symmetric curve you'd get by just stretching a circle or ",
        "start": 225.523,
        "duration": 3.948
    },
    {
        "text": "tracing around two thumbtacks.",
        "start": 229.471,
        "duration": 1.559
    },
    {
        "text": "But of course, math is all about proofs, so how do you give an airtight ",
        "start": 232.05,
        "duration": 3.85
    },
    {
        "text": "demonstration that these three families of curves are actually the same?",
        "start": 235.9,
        "duration": 3.85
    },
    {
        "text": "For example, let's focus our attention on just one of these equivalences, ",
        "start": 240.69,
        "duration": 3.856
    },
    {
        "text": "namely that slicing a cone will give us a curve that could also be drawn using the ",
        "start": 244.546,
        "duration": 4.325
    },
    {
        "text": "thumbtack construction.",
        "start": 248.871,
        "duration": 1.199
    },
    {
        "text": "What you need to show here is that there exist two thumbtack points somewhere inside that ",
        "start": 250.93,
        "duration": 5.513
    },
    {
        "text": "slicing plane such that the sum of the distances from any point of the intersection curve ",
        "start": 256.443,
        "duration": 5.514
    },
    {
        "text": "to those two points remains constant, no matter where you are on that intersection curve.",
        "start": 261.957,
        "duration": 5.453
    },
    {
        "text": "I first saw the trick to showing why this is true in Paul Lockhart's ",
        "start": 268.17,
        "duration": 3.401
    },
    {
        "text": "magnificent book Measurement, which I would highly recommend to anyone ",
        "start": 271.571,
        "duration": 3.5
    },
    {
        "text": "young or old who needs a reminder of the fact that math is a form of art.",
        "start": 275.071,
        "duration": 3.599
    },
    {
        "text": "The stroke of genius comes in the very first step, ",
        "start": 279.55,
        "duration": 3.038
    },
    {
        "text": "which is to introduce two spheres into this picture, ",
        "start": 282.588,
        "duration": 3.157
    },
    {
        "text": "one above the plane and one below it, each one of them sized just right ",
        "start": 285.745,
        "duration": 4.29
    },
    {
        "text": "so as to be tangent to the cone along a circle of points, ",
        "start": 290.035,
        "duration": 3.455
    },
    {
        "text": "and tangent to the plane at just a single point.",
        "start": 293.49,
        "duration": 2.86
    },
    {
        "text": "Why you would think to do this, of all things, ",
        "start": 299.09,
        "duration": 2.388
    },
    {
        "text": "is a tricky question to answer, and one that we'll turn back to.",
        "start": 301.478,
        "duration": 3.252
    },
    {
        "text": "For right now, let's just say that you have a particularly playful mind ",
        "start": 305.03,
        "duration": 3.294
    },
    {
        "text": "that loves engaging with how different geometric objects all fit together.",
        "start": 308.324,
        "duration": 3.386
    },
    {
        "text": "But once these spheres are sitting here, I actually ",
        "start": 312.43,
        "duration": 2.58
    },
    {
        "text": "bet that you could prove the target result yourself.",
        "start": 315.01,
        "duration": 2.58
    },
    {
        "text": "Here, I'll help you step through it, but at any point if you feel inspired, ",
        "start": 318.51,
        "duration": 3.855
    },
    {
        "text": "please do pause and try to carry on without me.",
        "start": 322.365,
        "duration": 2.385
    },
    {
        "text": "First off, these spheres have introduced two special points inside the curve, ",
        "start": 324.75,
        "duration": 4.428
    },
    {
        "text": "the points where they're tangent to the plane.",
        "start": 329.178,
        "duration": 2.612
    },
    {
        "text": "So a reasonable guess might be that these two tangency points are the focus points.",
        "start": 332.69,
        "duration": 4.58
    },
    {
        "text": "That means that you're going to want to draw lines from these foci to some ",
        "start": 338.05,
        "duration": 4.602
    },
    {
        "text": "point along the ellipse, and ultimately the goal is to understand what ",
        "start": 342.652,
        "duration": 4.358
    },
    {
        "text": "the sum of the distances of those two lines is, ",
        "start": 347.01,
        "duration": 2.945
    },
    {
        "text": "or at the very least to understand why that sum doesn't depend on where ",
        "start": 349.955,
        "duration": 4.419
    },
    {
        "text": "you are along the ellipse.",
        "start": 354.374,
        "duration": 1.596
    },
    {
        "text": "Keep in mind, what makes these lines special is that each one does not simply touch ",
        "start": 358.51,
        "duration": 4.234
    },
    {
        "text": "one of the spheres, it's actually tangent to that sphere at the point where it touches.",
        "start": 362.744,
        "duration": 4.386
    },
    {
        "text": "And in general, for any math problem, you want to ",
        "start": 368.01,
        "duration": 2.701
    },
    {
        "text": "use the defining features of all the objects involved.",
        "start": 370.711,
        "duration": 2.919
    },
    {
        "text": "Another example here is what even defines the spheres.",
        "start": 374.35,
        "duration": 2.98
    },
    {
        "text": "It's not just the fact that they're tangent to the plane, ",
        "start": 377.93,
        "duration": 3.045
    },
    {
        "text": "but that they're also tangent to the cone, each one at some circle of tangency points.",
        "start": 380.975,
        "duration": 4.515
    },
    {
        "text": "So you're going to need to use those two circles of tangency points in some way.",
        "start": 386.09,
        "duration": 4.38
    },
    {
        "text": "But how exactly?",
        "start": 391.01,
        "duration": 1.44
    },
    {
        "text": "One thing you might do is just draw a line straight from ",
        "start": 393.55,
        "duration": 3.43
    },
    {
        "text": "the top circle down to the bottom one along the cone.",
        "start": 396.98,
        "duration": 3.19
    },
    {
        "text": "And there's something about doing this that feels vaguely reminiscent ",
        "start": 401.05,
        "duration": 3.327
    },
    {
        "text": "of the constant sum thumbtack property, and hence promising.",
        "start": 404.377,
        "duration": 2.853
    },
    {
        "text": "You see, it passes through the ellipse, and so by snipping that line ",
        "start": 407.23,
        "duration": 3.951
    },
    {
        "text": "at the point where it crosses the ellipse, you can think of it as the ",
        "start": 411.181,
        "duration": 4.008
    },
    {
        "text": "sum of two line segments, each one hitting the same point on the ellipse.",
        "start": 415.189,
        "duration": 4.181
    },
    {
        "text": "And you can do this through various different points of the ellipse, ",
        "start": 419.91,
        "duration": 3.439
    },
    {
        "text": "depending on where you are around the cone, always getting two line segments with a ",
        "start": 423.349,
        "duration": 4.186
    },
    {
        "text": "constant sum, namely whatever the straight line distance from the top circle to the ",
        "start": 427.535,
        "duration": 4.187
    },
    {
        "text": "bottom circle is.",
        "start": 431.722,
        "duration": 0.848
    },
    {
        "text": "So you see what I mean about it being vaguely analogous to the thumbtack property, ",
        "start": 433.09,
        "duration": 4.537
    },
    {
        "text": "in that every point of the ellipse gives us two distances whose sum is a constant.",
        "start": 437.627,
        "duration": 4.483
    },
    {
        "text": "Granted, these lengths are not to the focal points, ",
        "start": 443.03,
        "duration": 2.316
    },
    {
        "text": "they're to the big and the little circle, but maybe that leads you to making ",
        "start": 445.346,
        "duration": 3.43
    },
    {
        "text": "the following conjecture.",
        "start": 448.776,
        "duration": 1.114
    },
    {
        "text": "The distance from a given point on this ellipse, this intersection curve, ",
        "start": 450.63,
        "duration": 4.47
    },
    {
        "text": "straight down to the big circle is, you conjecture, ",
        "start": 455.1,
        "duration": 3.142
    },
    {
        "text": "equal to the distance to the point where that big sphere is tangent to the plane, ",
        "start": 458.242,
        "duration": 4.955
    },
    {
        "text": "our first proposed focus point.",
        "start": 463.197,
        "duration": 1.873
    },
    {
        "text": "Likewise, perhaps the distance from that point on the ellipse to ",
        "start": 465.57,
        "duration": 3.373
    },
    {
        "text": "the small circle is equal to the distance from that point to the ",
        "start": 468.943,
        "duration": 3.374
    },
    {
        "text": "second proposed focus point, where the small sphere touches the plane.",
        "start": 472.317,
        "duration": 3.633
    },
    {
        "text": "So is that true?",
        "start": 477.289,
        "duration": 1.601
    },
    {
        "text": "Well, yes!",
        "start": 479.73,
        "duration": 0.82
    },
    {
        "text": "Here, let's give a name to that point we have on the ellipse, q.",
        "start": 481.09,
        "duration": 2.92
    },
    {
        "text": "The key is that the line from q to the first proposed focus is tangent to the big sphere, ",
        "start": 484.79,
        "duration": 5.077
    },
    {
        "text": "and the line from q straight down along the cone is also tangent to the big sphere.",
        "start": 489.867,
        "duration": 4.683
    },
    {
        "text": "Here, let's look at a different picture for some clarity.",
        "start": 496.29,
        "duration": 2.06
    },
    {
        "text": "If you have multiple lines drawn from a common point to a sphere, ",
        "start": 498.89,
        "duration": 3.61
    },
    {
        "text": "all of which are tangent to that sphere, you can probably see, ",
        "start": 502.5,
        "duration": 3.446
    },
    {
        "text": "just from the symmetry of the setup, that all of these lines have to have the same length.",
        "start": 505.946,
        "duration": 4.924
    },
    {
        "text": "In fact, I encourage you to try proving this yourself, ",
        "start": 511.63,
        "duration": 2.42
    },
    {
        "text": "or to otherwise pause and ponder on the proof I've left on the screen.",
        "start": 514.05,
        "duration": 3.08
    },
    {
        "text": "But, looking back at our cone slicing setup, your conjecture would be correct.",
        "start": 518.95,
        "duration": 4.52
    },
    {
        "text": "The two lines extending from the point q on the ",
        "start": 524.01,
        "duration": 2.777
    },
    {
        "text": "ellipse tangent to the big sphere have the same length.",
        "start": 526.787,
        "duration": 3.183
    },
    {
        "text": "Similarly, the line from q to the second proposed focus point ",
        "start": 530.63,
        "duration": 3.666
    },
    {
        "text": "is tangent to the little sphere, as is the line from q straight up along the cone, ",
        "start": 534.296,
        "duration": 4.907
    },
    {
        "text": "so those two also have the same length.",
        "start": 539.203,
        "duration": 2.307
    },
    {
        "text": "And so, the sum of the distances from q to the two proposed focus ",
        "start": 542.16,
        "duration": 3.861
    },
    {
        "text": "points is the same as the straight line distance from the little ",
        "start": 546.021,
        "duration": 3.804
    },
    {
        "text": "circle down to the big circle along the cone, passing through q.",
        "start": 549.825,
        "duration": 3.745
    },
    {
        "text": "And clearly, that does not depend on which point of the ellipse you chose for q.",
        "start": 554.35,
        "duration": 3.66
    },
    {
        "text": "Bada-boom-bada-bang, slicing the cone is the same as the thumbtack construction, ",
        "start": 558.39,
        "duration": 3.987
    },
    {
        "text": "since the resulting curve has the constant focal sum property.",
        "start": 562.377,
        "duration": 3.053
    },
    {
        "text": "Now this proof was first found by Germenal, Germenal, Germenal, who cares, Dandelin, ",
        "start": 569.75,
        "duration": 6.291
    },
    {
        "text": "a guy named Dandelin in 1822, so these two spheres are sometimes called Dandelin spheres.",
        "start": 576.041,
        "duration": 6.589
    },
    {
        "text": "You can also use the same trick to show why slicing a cylinder at an angle will give you ",
        "start": 583.55,
        "duration": 4.779
    },
    {
        "text": "an ellipse, and if you're comfortable with the claim that projecting a shape from one ",
        "start": 588.329,
        "duration": 4.619
    },
    {
        "text": "plane onto another tilted plane has the effect of simply stretching out that shape, ",
        "start": 592.948,
        "duration": 4.511
    },
    {
        "text": "this also shows why the definition of an ellipse as a stretched circle is the same as the ",
        "start": 597.459,
        "duration": 4.833
    },
    {
        "text": "other two.",
        "start": 602.292,
        "duration": 0.538
    },
    {
        "text": "More homework.",
        "start": 603.41,
        "duration": 0.6
    },
    {
        "text": "So why do I think this proof is such a good representative for math itself?",
        "start": 605.71,
        "duration": 4.34
    },
    {
        "text": "That if you had to show just one thing to explain to a non-math ",
        "start": 610.49,
        "duration": 3.105
    },
    {
        "text": "enthusiast why you love the subject, why this would be a good candidate.",
        "start": 613.595,
        "duration": 3.495
    },
    {
        "text": "The obvious reason is that it's substantive and beautiful without ",
        "start": 617.79,
        "duration": 3.586
    },
    {
        "text": "requiring too much background, but more than that, ",
        "start": 621.376,
        "duration": 2.771
    },
    {
        "text": "it reflects a common feature of math that sometimes there is no single ",
        "start": 624.147,
        "duration": 3.858
    },
    {
        "text": "most fundamental way of defining something, that what matters more is ",
        "start": 628.005,
        "duration": 3.803
    },
    {
        "text": "showing equivalences.",
        "start": 631.808,
        "duration": 1.142
    },
    {
        "text": "And even more than that, the proof itself involves one key moment ",
        "start": 633.65,
        "duration": 3.655
    },
    {
        "text": "of creative construction, adding the two spheres, ",
        "start": 637.305,
        "duration": 2.77
    },
    {
        "text": "while most of it leaves room for a nice systematic and principled approach.",
        "start": 640.075,
        "duration": 4.155
    },
    {
        "text": "And this kind of creative construction is, I think, ",
        "start": 644.67,
        "duration": 2.82
    },
    {
        "text": "one of the most thought-provoking aspects of mathematical discovery, ",
        "start": 647.49,
        "duration": 3.742
    },
    {
        "text": "and you might understandably ask where such an idea comes from.",
        "start": 651.232,
        "duration": 3.418
    },
    {
        "text": "In fact, talking about this particular proof, ",
        "start": 655.01,
        "duration": 2.22
    },
    {
        "text": "here's what Paul Lockhart says in Measurement.",
        "start": 657.23,
        "duration": 2.22
    },
    {
        "text": "I agree, but I think we can say at least a little something more about this.",
        "start": 668.29,
        "duration": 8.02
    },
    {
        "text": "While it is ingenious, we can perhaps decompose how someone who ",
        "start": 676.61,
        "duration": 3.471
    },
    {
        "text": "has immersed themselves in a number of other geometry problems ",
        "start": 680.081,
        "duration": 3.417
    },
    {
        "text": "might be particularly primed to think of adding these specific spheres.",
        "start": 683.498,
        "duration": 3.852
    },
    {
        "text": "First, a common tactic in geometry is to relate one length to another, ",
        "start": 687.89,
        "duration": 4.199
    },
    {
        "text": "and in this problem, you know from the outset that being able to relate these two ",
        "start": 692.089,
        "duration": 4.849
    },
    {
        "text": "lengths to the foci to some other two lengths, especially ones that line up, ",
        "start": 696.938,
        "duration": 4.555
    },
    {
        "text": "would be a useful thing, even though at the start you don't even know where the ",
        "start": 701.493,
        "duration": 4.731
    },
    {
        "text": "focus points are.",
        "start": 706.224,
        "duration": 1.006
    },
    {
        "text": "And even if it's not clear exactly how you'd do that, ",
        "start": 708.43,
        "duration": 2.774
    },
    {
        "text": "throwing spheres into the picture isn't all that crazy.",
        "start": 711.204,
        "duration": 2.826
    },
    {
        "text": "Again, if you've built up a relationship with geometry through practice, ",
        "start": 714.03,
        "duration": 3.772
    },
    {
        "text": "you would be well acquainted with how relating one length to another happens ",
        "start": 717.802,
        "duration": 3.979
    },
    {
        "text": "all the time when the circles and spheres are in the picture, ",
        "start": 721.781,
        "duration": 3.204
    },
    {
        "text": "because it cuts straight to the defining feature of what it even means to be ",
        "start": 724.985,
        "duration": 3.979
    },
    {
        "text": "a circle or a sphere.",
        "start": 728.964,
        "duration": 1.086
    },
    {
        "text": "This is obviously a specific example, but the point I want to ",
        "start": 730.67,
        "duration": 3.509
    },
    {
        "text": "make is that you can often view glimpses of ingeniousness not as inexplicable miracles, ",
        "start": 734.179,
        "duration": 4.982
    },
    {
        "text": "but as the residue of experience.",
        "start": 739.161,
        "duration": 1.869
    },
    {
        "text": "And when you do, the idea of genius goes from being ",
        "start": 741.69,
        "duration": 2.93
    },
    {
        "text": "mesmerizing to instead being actively inspirational.",
        "start": 744.62,
        "duration": 2.93
    }
]