[
    {
        "text": "Let me share with you something I found particularly ",
        "start": 10.32,
        "duration": 2.894
    },
    {
        "text": "weird when I was a student first learning calculus.",
        "start": 13.214,
        "duration": 2.786
    },
    {
        "text": "Let's say you have a circle with radius 5 centered at the origin of the xy plane.",
        "start": 16.78,
        "duration": 4.76
    },
    {
        "text": "This is something defined with the equation x2 plus y2 equals 5 squared, ",
        "start": 22.14,
        "duration": 4.252
    },
    {
        "text": "that is, all the points on the circle are a distance 5 from the origin as ",
        "start": 26.392,
        "duration": 4.31
    },
    {
        "text": "encapsulated by the Pythagorean theorem, where the sum of the squares of ",
        "start": 30.702,
        "duration": 4.252
    },
    {
        "text": "the two legs on this triangle equals the square of the hypotenuse, 5 squared.",
        "start": 34.954,
        "duration": 4.486
    },
    {
        "text": "And suppose you want to find the slope of a tangent line to the circle, ",
        "start": 40.46,
        "duration": 4.525
    },
    {
        "text": "maybe at the point xy equals 3,4.",
        "start": 44.985,
        "duration": 2.075
    },
    {
        "text": "Now if you're savvy with geometry, you might already know that this ",
        "start": 48.14,
        "duration": 3.705
    },
    {
        "text": "tangent line is perpendicular to the radius touching it at that point.",
        "start": 51.845,
        "duration": 3.815
    },
    {
        "text": "But let's say you don't already know that, or maybe you want ",
        "start": 56.38,
        "duration": 3.099
    },
    {
        "text": "a technique that generalizes to curves other than just circles.",
        "start": 59.479,
        "duration": 3.201
    },
    {
        "text": "As with other problems about the slopes of tangent lines to curves, ",
        "start": 63.62,
        "duration": 3.768
    },
    {
        "text": "the key thought here is to zoom in close enough that the curve basically ",
        "start": 67.388,
        "duration": 4.046
    },
    {
        "text": "looks just like its own tangent line, and then ask about a tiny step along that curve.",
        "start": 71.434,
        "duration": 4.766
    },
    {
        "text": "The y component of that little step is what you might call dy, ",
        "start": 77.0,
        "duration": 4.502
    },
    {
        "text": "and the x component is dx, so the slope we want is the rise over run, dy divided by dx.",
        "start": 81.502,
        "duration": 6.218
    },
    {
        "text": "But unlike other tangent slope problems in calculus, ",
        "start": 88.48,
        "duration": 3.222
    },
    {
        "text": "this curve is not the graph of a function, so we can't just take a simple derivative, ",
        "start": 91.702,
        "duration": 5.23
    },
    {
        "text": "asking about the size of some tiny nudge to the output of a function caused by some ",
        "start": 96.932,
        "duration": 5.108
    },
    {
        "text": "tiny nudge to the input.",
        "start": 102.04,
        "duration": 1.46
    },
    {
        "text": "x is not an input, and y is not an output, they're both ",
        "start": 104.02,
        "duration": 3.971
    },
    {
        "text": "just interdependent values related by some equation.",
        "start": 107.991,
        "duration": 3.689
    },
    {
        "text": "This is what's called an implicit curve, it's just the set of all points x, ",
        "start": 112.82,
        "duration": 5.5
    },
    {
        "text": "y that satisfy some property written in terms of the two variables, x and y.",
        "start": 118.32,
        "duration": 5.5
    },
    {
        "text": "The procedure for how you actually find dy, dx for curves like ",
        "start": 124.9,
        "duration": 3.676
    },
    {
        "text": "this is the thing I found very weird as a calculus student.",
        "start": 128.576,
        "duration": 3.444
    },
    {
        "text": "You take the derivative of both sides like this, for x squared you write 2x times dx, ",
        "start": 132.66,
        "duration": 6.519
    },
    {
        "text": "and similarly y squared becomes 2y times dy, and then the derivative ",
        "start": 139.179,
        "duration": 5.23
    },
    {
        "text": "of that constant 5 squared on the right is just 0.",
        "start": 144.409,
        "duration": 3.791
    },
    {
        "text": "Now you can see why this feels a little strange, right?",
        "start": 149.52,
        "duration": 2.58
    },
    {
        "text": "What does it mean to take the derivative of an expression that has multiple ",
        "start": 152.56,
        "duration": 4.57
    },
    {
        "text": "variables in it, and why is it that we're tacking on dy and dx in this way?",
        "start": 157.13,
        "duration": 4.51
    },
    {
        "text": "But if you just blindly move forward with what you get, ",
        "start": 162.4,
        "duration": 3.745
    },
    {
        "text": "you can rearrange this equation and find an expression for dy divided by dx, ",
        "start": 166.145,
        "duration": 5.149
    },
    {
        "text": "which in this case comes out to be negative x divided by y.",
        "start": 171.294,
        "duration": 3.946
    },
    {
        "text": "So at the point with coordinates x, y equals 3, 4, ",
        "start": 176.04,
        "duration": 3.887
    },
    {
        "text": "that slope would be negative 3 divided by 4, evidently.",
        "start": 179.927,
        "duration": 4.193
    },
    {
        "text": "This strange process is called implicit differentiation.",
        "start": 185.06,
        "duration": 3.8
    },
    {
        "text": "Don't worry, I have an explanation for how you can interpret ",
        "start": 189.62,
        "duration": 3.093
    },
    {
        "text": "taking a derivative of an expression with two variables like this.",
        "start": 192.713,
        "duration": 3.347
    },
    {
        "text": "But first I want to set aside this particular problem and show how it's connected ",
        "start": 196.58,
        "duration": 4.46
    },
    {
        "text": "to a different type of calculus problem, something called a related rates problem.",
        "start": 201.04,
        "duration": 4.46
    },
    {
        "text": "Imagine a 5 meter long ladder held up against a wall where the top ",
        "start": 206.32,
        "duration": 4.133
    },
    {
        "text": "of the ladder starts 4 meters above the ground, ",
        "start": 210.453,
        "duration": 2.961
    },
    {
        "text": "which by the Pythagorean theorem means that the bottom is 3 meters away from the wall.",
        "start": 213.414,
        "duration": 5.306
    },
    {
        "text": "And let's say it's slipping down in such a way that the top ",
        "start": 219.62,
        "duration": 3.132
    },
    {
        "text": "of the ladder is dropping at a rate of 1 meter per second.",
        "start": 222.752,
        "duration": 3.028
    },
    {
        "text": "The question is, in that initial moment, what's the rate at ",
        "start": 226.76,
        "duration": 3.52
    },
    {
        "text": "which the bottom of the ladder is moving away from the wall?",
        "start": 230.28,
        "duration": 3.52
    },
    {
        "text": "It's interesting, right?",
        "start": 235.0,
        "duration": 1.2
    },
    {
        "text": "That distance from the bottom of the ladder to the wall is 100% ",
        "start": 236.48,
        "duration": 3.937
    },
    {
        "text": "determined by the distance from the top of the ladder to the floor.",
        "start": 240.417,
        "duration": 4.123
    },
    {
        "text": "So we should have enough information to figure out how the rates ",
        "start": 245.12,
        "duration": 3.612
    },
    {
        "text": "of change for each of those values actually depend on each other, ",
        "start": 248.732,
        "duration": 3.668
    },
    {
        "text": "but it might not be entirely clear how exactly you relate those two.",
        "start": 252.4,
        "duration": 3.78
    },
    {
        "text": "First things first, it's always nice to give names to the quantities that we care about, ",
        "start": 256.8,
        "duration": 4.819
    },
    {
        "text": "so let's label that distance from the top of the ladder to the ground y of t, ",
        "start": 261.619,
        "duration": 4.224
    },
    {
        "text": "written as a function of time because it's changing.",
        "start": 265.843,
        "duration": 2.817
    },
    {
        "text": "Likewise, label the distance between the bottom of the ladder and the wall x of t.",
        "start": 269.68,
        "duration": 4.22
    },
    {
        "text": "The key equation that relates these terms is the Pythagorean theorem, ",
        "start": 274.82,
        "duration": 4.727
    },
    {
        "text": "x of t squared plus y of t squared equals 5 squared.",
        "start": 279.547,
        "duration": 3.513
    },
    {
        "text": "What makes that a powerful equation to use is that it's true at all points of time.",
        "start": 283.92,
        "duration": 4.62
    },
    {
        "text": "One way that you could solve this would be to isolate x of t, ",
        "start": 290.3,
        "duration": 3.921
    },
    {
        "text": "and then figure out what y of t has to be based on that 1 m per second drop rate, ",
        "start": 294.221,
        "duration": 5.188
    },
    {
        "text": "and you could take the derivative of the resulting function dx dt, ",
        "start": 299.409,
        "duration": 4.238
    },
    {
        "text": "the rate at which x is changing with respect to time.",
        "start": 303.647,
        "duration": 3.353
    },
    {
        "text": "That's fine, it involves a couple layers of using the chain rule, ",
        "start": 307.86,
        "duration": 3.166
    },
    {
        "text": "and it'll definitely work for you, but I want to show a different way that you can think ",
        "start": 311.026,
        "duration": 4.27
    },
    {
        "text": "about the same problem.",
        "start": 315.296,
        "duration": 1.104
    },
    {
        "text": "This left hand side of the equation is a function of time, right?",
        "start": 317.32,
        "duration": 3.76
    },
    {
        "text": "It just so happens to equal a constant, meaning the value evidently doesn't change ",
        "start": 321.44,
        "duration": 4.718
    },
    {
        "text": "while time passes, but it's still written as an expression dependent on time, ",
        "start": 326.158,
        "duration": 4.434
    },
    {
        "text": "which means we can manipulate it like any other function that has t as an input.",
        "start": 330.592,
        "duration": 4.548
    },
    {
        "text": "In particular, we can take a derivative of this left hand side, ",
        "start": 336.06,
        "duration": 4.201
    },
    {
        "text": "which is a way of saying if I let a little bit of time pass, some small dt, ",
        "start": 340.261,
        "duration": 4.989
    },
    {
        "text": "which causes y to slightly decrease and x to slightly increase, ",
        "start": 345.25,
        "duration": 4.201
    },
    {
        "text": "how much does this expression change?",
        "start": 349.451,
        "duration": 2.429
    },
    {
        "text": "On the one hand, we know that the derivative should be 0, ",
        "start": 353.0,
        "duration": 3.043
    },
    {
        "text": "since the expression is a constant, and constants don't care about your tiny nudges in ",
        "start": 356.043,
        "duration": 4.565
    },
    {
        "text": "time, they just remain unchanged.",
        "start": 360.608,
        "duration": 1.732
    },
    {
        "text": "But on the other hand, what do you get when you compute this derivative?",
        "start": 363.08,
        "duration": 3.44
    },
    {
        "text": "Well, the derivative of x of t squared is 2 times x of t times the derivative of x.",
        "start": 368.02,
        "duration": 6.1
    },
    {
        "text": "That's the chain rule I talked about in the last video.",
        "start": 374.44,
        "duration": 2.54
    },
    {
        "text": "2x dx represents the size of a change to x squared caused by some change to x, ",
        "start": 377.62,
        "duration": 6.124
    },
    {
        "text": "and then we're dividing out by dt.",
        "start": 383.744,
        "duration": 2.636
    },
    {
        "text": "Likewise, the rate at which y of t squared is ",
        "start": 387.5,
        "duration": 3.326
    },
    {
        "text": "changing is 2 times y of t times the derivative of y.",
        "start": 390.826,
        "duration": 3.834
    },
    {
        "text": "Now evidently, this whole expression must be 0, ",
        "start": 395.74,
        "duration": 2.72
    },
    {
        "text": "and that's an equivalent way of saying that x squared plus y squared must not ",
        "start": 398.46,
        "duration": 4.42
    },
    {
        "text": "change while the ladder moves.",
        "start": 402.88,
        "duration": 1.7
    },
    {
        "text": "At the very start, time t equals 0, the height, y of t, ",
        "start": 405.88,
        "duration": 4.12
    },
    {
        "text": "is 4 meters, and that distance x of t is 3 meters.",
        "start": 410.0,
        "duration": 3.68
    },
    {
        "text": "And since the top of the ladder is dropping at a rate of 1 meter per second, ",
        "start": 414.48,
        "duration": 5.175
    },
    {
        "text": "that derivative, dy dt, is negative 1 meters per second.",
        "start": 419.655,
        "duration": 3.765
    },
    {
        "text": "Now, this gives us enough information to isolate the derivative, dx dt, ",
        "start": 424.46,
        "duration": 4.449
    },
    {
        "text": "and when you work it out, it comes out to be 4 thirds meters per second.",
        "start": 428.909,
        "duration": 4.451
    },
    {
        "text": "The reason I bring up this ladder problem is that I want you to compare ",
        "start": 434.38,
        "duration": 3.594
    },
    {
        "text": "it to the problem of finding the slope of a tangent line to the circle.",
        "start": 437.974,
        "duration": 3.546
    },
    {
        "text": "In both cases, we had the equation x squared plus y squared equals 5 squared, ",
        "start": 442.36,
        "duration": 4.314
    },
    {
        "text": "and in both cases we ended up taking the derivative of each side of this expression.",
        "start": 446.674,
        "duration": 4.646
    },
    {
        "text": "But for the ladder question, these expressions were functions of time, ",
        "start": 452.2,
        "duration": 4.029
    },
    {
        "text": "so taking the derivative has a clear meaning, it's the rate at which the expression ",
        "start": 456.229,
        "duration": 4.768
    },
    {
        "text": "changes as time changes.",
        "start": 460.997,
        "duration": 1.363
    },
    {
        "text": "But what makes the circle situation strange is that rather than saying that a small ",
        "start": 463.26,
        "duration": 5.24
    },
    {
        "text": "amount of time dt has passed, which causes x and y to change, ",
        "start": 468.5,
        "duration": 3.868
    },
    {
        "text": "the derivative just has these tiny nudges dx and dy just floating free, ",
        "start": 472.368,
        "duration": 4.492
    },
    {
        "text": "not tied to some other common variable, like time.",
        "start": 476.86,
        "duration": 3.12
    },
    {
        "text": "Let me show you a nice way to think about this.",
        "start": 481.14,
        "duration": 1.84
    },
    {
        "text": "Let's give this expression x squared plus y squared a name, maybe s.",
        "start": 483.24,
        "duration": 4.2
    },
    {
        "text": "s is essentially a function of two variables.",
        "start": 488.24,
        "duration": 2.82
    },
    {
        "text": "It takes every point xy on the plane and associates it with a number.",
        "start": 491.88,
        "duration": 3.78
    },
    {
        "text": "For points on the circle, that number happens to be 25.",
        "start": 496.62,
        "duration": 3.04
    },
    {
        "text": "If you stepped off the circle away from the center, that value would be bigger.",
        "start": 500.56,
        "duration": 3.84
    },
    {
        "text": "For other points xy closer to the origin, that value would be smaller. ",
        "start": 505.06,
        "duration": 4.695
    },
    {
        "text": "Now what it means to take a derivative of this expression, a derivative of s, ",
        "start": 509.755,
        "duration": 5.158
    },
    {
        "text": "is to consider a tiny change to both of these variables, some tiny change dx to x, ",
        "start": 514.913,
        "duration": 5.489
    },
    {
        "text": "and some tiny change dy to y, and not necessarily one that keeps you on the circle, ",
        "start": 520.402,
        "duration": 5.555
    },
    {
        "text": "by the way, it's just any tiny step in any direction of the xy plane.",
        "start": 525.957,
        "duration": 4.563
    },
    {
        "text": "From there you ask how much does the value of s change?",
        "start": 531.52,
        "duration": 3.5
    },
    {
        "text": "That difference, the difference in the value of s before the nudge and after the nudge, ",
        "start": 536.0,
        "duration": 5.696
    },
    {
        "text": "is what I'm writing as ds.",
        "start": 541.696,
        "duration": 1.684
    },
    {
        "text": "For example, in this picture we're starting off at a point ",
        "start": 544.48,
        "duration": 4.98
    },
    {
        "text": "where x equals 3 and where y equals 4, and let's just say that ",
        "start": 549.46,
        "duration": 5.317
    },
    {
        "text": "the step I drew has dx at negative 0.02 and dy at negative 0.01.",
        "start": 554.777,
        "duration": 5.403
    },
    {
        "text": "Then the decrease in s, the amount that x squared plus y squared changes over that step, ",
        "start": 561.12,
        "duration": 7.193
    },
    {
        "text": "would be about 2 times 3 times negative 0.02 plus 2 times 4 times negative 0.01.",
        "start": 568.313,
        "duration": 6.467
    },
    {
        "text": "That's what this derivative expression, 2x dx plus 2y dy, actually means.",
        "start": 575.6,
        "duration": 5.2
    },
    {
        "text": "It's a recipe for telling you how much the value x squared plus y squared changes as ",
        "start": 581.38,
        "duration": 5.34
    },
    {
        "text": "determined by the point xy where you start and the tiny step dx dy that you take. And",
        "start": 586.72,
        "duration": 5.34
    },
    {
        "text": "As with all things derivative, this is only an approximation, ",
        "start": 593.08,
        "duration": 3.609
    },
    {
        "text": "but it's one that gets truer and truer for smaller and smaller choices of dx and dy.",
        "start": 596.689,
        "duration": 4.891
    },
    {
        "text": "The key point here is that when you restrict yourself to steps along the circle, ",
        "start": 602.5,
        "duration": 4.61
    },
    {
        "text": "you're essentially saying you want to ensure that this value of s doesn't change.",
        "start": 607.11,
        "duration": 4.61
    },
    {
        "text": "It starts at a value of 25 and you want to keep it at a value of 25.",
        "start": 612.24,
        "duration": 4.28
    },
    {
        "text": "That is, ds should be 0.",
        "start": 617.18,
        "duration": 1.92
    },
    {
        "text": "So setting the expression 2x dx plus 2y dy equal to 0 is the condition ",
        "start": 620.2,
        "duration": 4.959
    },
    {
        "text": "under which one of these tiny steps actually stays on the circle.",
        "start": 625.159,
        "duration": 4.541
    },
    {
        "text": "Again, this is only an approximation.",
        "start": 630.62,
        "duration": 1.84
    },
    {
        "text": "Speaking more precisely, that condition is what keeps you ",
        "start": 633.04,
        "duration": 3.449
    },
    {
        "text": "on the tangent line of the circle, not the circle itself.",
        "start": 636.489,
        "duration": 3.391
    },
    {
        "text": "But for tiny enough steps, those are essentially the same thing.",
        "start": 640.58,
        "duration": 3.32
    },
    {
        "text": "Of course, there's nothing special about the expression ",
        "start": 645.18,
        "duration": 2.628
    },
    {
        "text": "x squared plus y squared equals 5 squared.",
        "start": 647.808,
        "duration": 1.972
    },
    {
        "text": "It's always nice to think through more examples, ",
        "start": 650.44,
        "duration": 3.144
    },
    {
        "text": "so let's consider this expression sin of x times y2 equals x.",
        "start": 653.584,
        "duration": 3.916
    },
    {
        "text": "This corresponds to a whole bunch of u-shaped curves on the plane.",
        "start": 658.16,
        "duration": 3.48
    },
    {
        "text": "And those curves, remember, represent all of the points xy where the ",
        "start": 662.42,
        "duration": 4.525
    },
    {
        "text": "value of sine of x times y squared happens to equal the value of x.",
        "start": 666.945,
        "duration": 4.395
    },
    {
        "text": "Now imagine taking some tiny step with components dx and dy, ",
        "start": 676.0,
        "duration": 3.616
    },
    {
        "text": "and not necessarily one that keeps you on the curve.",
        "start": 679.616,
        "duration": 3.084
    },
    {
        "text": "Taking the derivative of each side of this equation will tell ",
        "start": 683.82,
        "duration": 3.904
    },
    {
        "text": "us how much the value of that side changes during the step.",
        "start": 687.724,
        "duration": 3.716
    },
    {
        "text": "On the left side, the product rule that we talked through last ",
        "start": 692.46,
        "duration": 3.115
    },
    {
        "text": "video tells us that this should be left d right plus right d left.",
        "start": 695.575,
        "duration": 3.265
    },
    {
        "text": "That is sine of x times the change to y squared, which is 2y times dy, ",
        "start": 699.48,
        "duration": 5.554
    },
    {
        "text": "plus y squared times the change to sine of x, which is cosine of x times dx.",
        "start": 705.034,
        "duration": 5.946
    },
    {
        "text": "The right side is simply x, so the size of a change to that value is exactly dx, ",
        "start": 712.02,
        "duration": 4.984
    },
    {
        "text": "right? Now",
        "start": 717.004,
        "duration": 0.616
    },
    {
        "text": "setting these two sides equal to each other is a way of saying whatever your tiny ",
        "start": 719.16,
        "duration": 5.221
    },
    {
        "text": "step with coordinates dx and dy is, if it's going to keep us on the curve, ",
        "start": 724.381,
        "duration": 4.776
    },
    {
        "text": "the values of both the left hand side and the right hand side must change by the ",
        "start": 729.157,
        "duration": 5.158
    },
    {
        "text": "same amount.",
        "start": 734.315,
        "duration": 0.765
    },
    {
        "text": "That's the only way this top equation can remain true.",
        "start": 735.64,
        "duration": 3.22
    },
    {
        "text": "From there, depending on what problem you're trying to solve, ",
        "start": 740.22,
        "duration": 3.572
    },
    {
        "text": "you have something to work with algebraically, ",
        "start": 743.792,
        "duration": 2.708
    },
    {
        "text": "and maybe the most common goal is to try to figure out what dy divided by dx is.",
        "start": 746.5,
        "duration": 4.61
    },
    {
        "text": "As a final example here, I want to show you how you can use this ",
        "start": 753.21,
        "duration": 3.918
    },
    {
        "text": "technique of implicit differentiation to figure out new derivative formulas.",
        "start": 757.128,
        "duration": 4.582
    },
    {
        "text": "I've mentioned that the derivative of e to the x is itself, ",
        "start": 762.63,
        "duration": 3.527
    },
    {
        "text": "but what about the derivative of its inverse function, the natural log of x? ",
        "start": 766.157,
        "duration": 4.527
    },
    {
        "text": "Well the graph of the natural log of x can be thought of as an implicit curve.",
        "start": 770.684,
        "duration": 4.586
    },
    {
        "text": "It's all of the points xy on the plane where y happens to equal ln of x.",
        "start": 776.05,
        "duration": 4.78
    },
    {
        "text": "It just happens to be the case that the x's and y's of this ",
        "start": 781.55,
        "duration": 3.108
    },
    {
        "text": "equation aren't as intermingled as they were in our other examples.",
        "start": 784.658,
        "duration": 3.472
    },
    {
        "text": "The slope of this graph, dy divided by dx, should be the derivative of ln of x, right?",
        "start": 789.35,
        "duration": 6.06
    },
    {
        "text": "Well to find that, first rearrange this equation ",
        "start": 796.65,
        "duration": 3.93
    },
    {
        "text": "y equals ln of x to be e to the y equals x.",
        "start": 800.58,
        "duration": 3.45
    },
    {
        "text": "This is exactly what the natural log of x means, it's saying e to the what equals x.",
        "start": 804.65,
        "duration": 6.2
    },
    {
        "text": "Since we know the derivative of e to the y, we can take the ",
        "start": 811.87,
        "duration": 3.508
    },
    {
        "text": "derivative of both sides here, effectively asking how a tiny step ",
        "start": 815.378,
        "duration": 3.86
    },
    {
        "text": "with components dx and dy changes the value of each one of these sides.",
        "start": 819.238,
        "duration": 4.152
    },
    {
        "text": "To ensure that a step stays on the curve, the change to the left side of the equation, ",
        "start": 824.53,
        "duration": 5.608
    },
    {
        "text": "which is e to the y times dy, must equal the change to the right side, ",
        "start": 830.138,
        "duration": 4.577
    },
    {
        "text": "which in this case is just dx.",
        "start": 834.715,
        "duration": 1.935
    },
    {
        "text": "Rearranging, that means dy divided by dx, the slope of our graph, ",
        "start": 837.87,
        "duration": 5.661
    },
    {
        "text": "equals 1 divided by e to the y.",
        "start": 843.531,
        "duration": 2.659
    },
    {
        "text": "When we're on the curve, e to the y is by definition the same thing as x, ",
        "start": 846.91,
        "duration": 4.912
    },
    {
        "text": "so evidently this slope is 1 divided by x.",
        "start": 851.822,
        "duration": 2.788
    },
    {
        "text": "And of course, an expression for the slope of a graph of a function ",
        "start": 855.83,
        "duration": 4.157
    },
    {
        "text": "written in terms of x like this is the derivative of that function, ",
        "start": 859.987,
        "duration": 4.158
    },
    {
        "text": "so evidently the derivative of ln of x is 1 divided by x.",
        "start": 864.145,
        "duration": 3.485
    },
    {
        "text": "By the way, all of this is a little sneak peek into multivariable calculus, ",
        "start": 872.61,
        "duration": 4.584
    },
    {
        "text": "where you consider functions that have multiple inputs and how ",
        "start": 877.194,
        "duration": 3.8
    },
    {
        "text": "they change as you tweak those multiple inputs.",
        "start": 880.994,
        "duration": 2.836
    },
    {
        "text": "The key, as always, is to have a clear image in your head of what ",
        "start": 884.87,
        "duration": 4.069
    },
    {
        "text": "tiny nudges are at play, and how exactly they depend on each other.",
        "start": 888.939,
        "duration": 4.131
    },
    {
        "text": "Next up, I'm going to be talking about limits, ",
        "start": 894.53,
        "duration": 2.403
    },
    {
        "text": "and how they're used to formalize the idea of a derivative.",
        "start": 896.933,
        "duration": 3.017
    },
    {
        "text": "Thank you.",
        "start": 917.49,
        "duration": 5.24
    }
]