[
    {
        "text": "What is a Grobner Basis?",
        "start": 0.0,
        "duration": 1.32
    },
    {
        "text": "If that is your intent for what this Q&A episode is going to be, ",
        "start": 2.16,
        "duration": 3.413
    },
    {
        "text": "as far as technicality and deep explanation is concerned, ",
        "start": 5.573,
        "duration": 3.046
    },
    {
        "text": "you're going to be grossly disappointed.",
        "start": 8.619,
        "duration": 2.101
    },
    {
        "text": "Same goes to whoever asked about what the Fourier ",
        "start": 11.36,
        "duration": 2.215
    },
    {
        "text": "Transform has to do with quantum computing.",
        "start": 13.575,
        "duration": 1.905
    },
    {
        "text": "I can say at a high level it's because the Fourier Transform gives ",
        "start": 15.84,
        "duration": 3.284
    },
    {
        "text": "you a unitary operation, and quantum computing is very fast when ",
        "start": 19.124,
        "duration": 3.187
    },
    {
        "text": "it comes to anything that can be expressed as a unitary matrix.",
        "start": 22.311,
        "duration": 3.089
    },
    {
        "text": "But those words won't make sense if you don't already know what it means, ",
        "start": 25.76,
        "duration": 3.004
    },
    {
        "text": "and this is not at all meant to be a video that's going to go into some deep math ",
        "start": 28.764,
        "duration": 3.328
    },
    {
        "text": "explanation.",
        "start": 32.092,
        "duration": 0.488
    },
    {
        "text": "But when I do cover quantum computing, which I will at some point...",
        "start": 32.94,
        "duration": 2.82
    },
    {
        "text": "What would you do professionally if it weren't ",
        "start": 41.84,
        "duration": 1.88
    },
    {
        "text": "for YouTube slash what are you doing professionally?",
        "start": 43.72,
        "duration": 2.08
    },
    {
        "text": "So a lot of you might know I used to work for Khan Academy, ",
        "start": 46.26,
        "duration": 2.74
    },
    {
        "text": "and I think if I wasn't doing this, I would definitely seek out some other way of ",
        "start": 49.0,
        "duration": 3.746
    },
    {
        "text": "doing math outreach online.",
        "start": 52.746,
        "duration": 1.234
    },
    {
        "text": "The intent of the question is maybe more what ",
        "start": 53.98,
        "duration": 2.072
    },
    {
        "text": "would I do that has nothing to do with math outreach.",
        "start": 56.052,
        "duration": 2.388
    },
    {
        "text": "I spent a lot of time doing random software engineering things through college.",
        "start": 58.92,
        "duration": 4.7
    },
    {
        "text": "Like my summer internships were often spent at a tech company, ",
        "start": 64.3,
        "duration": 2.706
    },
    {
        "text": "rather than doing something explicitly math related.",
        "start": 67.006,
        "duration": 2.234
    },
    {
        "text": "But if I really turn on that parallel universe machine, ",
        "start": 69.74,
        "duration": 2.5
    },
    {
        "text": "I think going into data science was a very real possibility.",
        "start": 72.24,
        "duration": 2.68
    },
    {
        "text": "One of the internships that I was doing, at the end of it they asked if I wanted to, ",
        "start": 75.3,
        "duration": 4.237
    },
    {
        "text": "instead of going to college again, just stick around and maybe have a full-time job, ",
        "start": 79.537,
        "duration": 4.237
    },
    {
        "text": "and just see what unfolded there.",
        "start": 83.774,
        "duration": 1.646
    },
    {
        "text": "And I seriously considered it, you know, it's pretty compelling.",
        "start": 86.28,
        "duration": 2.2
    },
    {
        "text": "Ultimately the love for pure math won out, so ",
        "start": 89.12,
        "duration": 2.48
    },
    {
        "text": "I did go back to school as you're supposed to.",
        "start": 91.6,
        "duration": 2.48
    },
    {
        "text": "But I kind of do wonder what would have been if ",
        "start": 94.34,
        "duration": 2.035
    },
    {
        "text": "instead I went that professional data science route.",
        "start": 96.375,
        "duration": 2.205
    },
    {
        "text": "How arbitrary do you think our mathematical perspective is as humans on Earth?",
        "start": 99.9,
        "duration": 3.48
    },
    {
        "text": "If an alien civilization developed math from scratch, ",
        "start": 103.74,
        "duration": 2.326
    },
    {
        "text": "do you think we would see clearer similarities in their development of the fields?",
        "start": 106.066,
        "duration": 3.534
    },
    {
        "text": "Like number theory, trigonometry, and calculus.",
        "start": 109.62,
        "duration": 1.92
    },
    {
        "text": "So this is an interesting question because it cuts ",
        "start": 112.14,
        "duration": 2.01
    },
    {
        "text": "right to the heart of is math invented or discovered?",
        "start": 114.15,
        "duration": 2.09
    },
    {
        "text": "And I like the phrasing where you kind of imagine an ",
        "start": 116.62,
        "duration": 2.091
    },
    {
        "text": "alien civilization coming and comparing your math to theirs.",
        "start": 118.711,
        "duration": 2.369
    },
    {
        "text": "It's hard to speculate on this, right?",
        "start": 121.96,
        "duration": 1.2
    },
    {
        "text": "Like I have no idea.",
        "start": 123.26,
        "duration": 1.12
    },
    {
        "text": "Some aliens came, we have no way of knowing whether ",
        "start": 124.52,
        "duration": 2.357
    },
    {
        "text": "their math would look completely different from ours.",
        "start": 126.877,
        "duration": 2.403
    },
    {
        "text": "One thing you can be pretty sure of, and this might seem superficial, ",
        "start": 130.06,
        "duration": 3.222
    },
    {
        "text": "is that the notation would be entirely different, right?",
        "start": 133.282,
        "duration": 2.578
    },
    {
        "text": "There's a lot of arbitrary choices in how we write things down.",
        "start": 135.86,
        "duration": 2.58
    },
    {
        "text": "Newton's notation for calculus versus Leibniz notation for calculus.",
        "start": 138.44,
        "duration": 3.6
    },
    {
        "text": "You know, a lot of the really silly things we have, ",
        "start": 142.56,
        "duration": 2.04
    },
    {
        "text": "like which side of the variable the function goes on.",
        "start": 144.6,
        "duration": 2.08
    },
    {
        "text": "Writing out the letters s-i-n for sine, cosine.",
        "start": 146.92,
        "duration": 3.06
    },
    {
        "text": "I had the whole triangle of power video about notations for radicals and exponentials.",
        "start": 150.24,
        "duration": 3.82
    },
    {
        "text": "And on the one hand that might not feel substantive, ",
        "start": 154.66,
        "duration": 2.412
    },
    {
        "text": "but I think it's really interesting to contemplate other ways where the notation shapes ",
        "start": 157.072,
        "duration": 4.007
    },
    {
        "text": "the way that we think about it and shapes the axioms and theorems we even choose more ",
        "start": 161.079,
        "duration": 3.915
    },
    {
        "text": "so than we give it credit for.",
        "start": 164.994,
        "duration": 1.366
    },
    {
        "text": "So a project I'm actively working on right now is about quaternions.",
        "start": 166.36,
        "duration": 3.12
    },
    {
        "text": "And I was a little bit surprised to learn how up in the air the potential ",
        "start": 170.02,
        "duration": 3.763
    },
    {
        "text": "notations and conventions for teaching students about vectors was.",
        "start": 173.783,
        "duration": 3.357
    },
    {
        "text": "Like a lot of the actual notation and terminology we have for vectors and cross ",
        "start": 177.8,
        "duration": 4.071
    },
    {
        "text": "products dot products the way we think of them in 3D ultimately stems from quaternions.",
        "start": 181.871,
        "duration": 4.429
    },
    {
        "text": "You know, even the fact that we use i, j, and k as letters to represent the x, ",
        "start": 186.44,
        "duration": 3.718
    },
    {
        "text": "y, and z directions.",
        "start": 190.158,
        "duration": 0.942
    },
    {
        "text": "And if Hamilton had had his way, we would still teach engineering students primarily ",
        "start": 191.66,
        "duration": 4.59
    },
    {
        "text": "about quaternions and then things like the dot product and cross product would be ",
        "start": 196.25,
        "duration": 4.428
    },
    {
        "text": "viewed as subsets of what the quaternions do and what quaternion multiplication is.",
        "start": 200.678,
        "duration": 4.482
    },
    {
        "text": "And I think there's a compelling case to be made for the fact that ",
        "start": 205.58,
        "duration": 3.257
    },
    {
        "text": "we would use that if we could visualize four dimensions better.",
        "start": 208.837,
        "duration": 3.063
    },
    {
        "text": "But the reason that quaternions never really won out as the notation du ",
        "start": 211.9,
        "duration": 3.41
    },
    {
        "text": "jour is because they're confusing because no one really understood them.",
        "start": 215.31,
        "duration": 3.41
    },
    {
        "text": "There's all sorts of hilarious quotes from Lord Kelvin and the like about how quaternions ",
        "start": 218.72,
        "duration": 4.34
    },
    {
        "text": "are just needlessly confuddling when you're trying to phrase some fact about the universe.",
        "start": 223.06,
        "duration": 4.34
    },
    {
        "text": "Like Maxwell's equations were originally written much ",
        "start": 227.76,
        "duration": 2.247
    },
    {
        "text": "more quaternionically than we teach them to students now.",
        "start": 230.007,
        "duration": 2.373
    },
    {
        "text": "And arguably they're much more elegant that way, ",
        "start": 232.92,
        "duration": 2.479
    },
    {
        "text": "but it's confusing because we can't visualize it.",
        "start": 235.399,
        "duration": 2.481
    },
    {
        "text": "So I think if you had some alien civilization that came but they had a very ",
        "start": 237.9,
        "duration": 3.539
    },
    {
        "text": "good spatial conception for four dimensions, they would look at our vector ",
        "start": 241.439,
        "duration": 3.494
    },
    {
        "text": "notation and think that it was not capturing the deeper realities of math.",
        "start": 244.933,
        "duration": 3.447
    },
    {
        "text": "Arguably, who knows?",
        "start": 248.82,
        "duration": 0.96
    },
    {
        "text": "What do you think is the main thing that drives people away from math?",
        "start": 250.44,
        "duration": 2.76
    },
    {
        "text": "Always hard to answer on these kind of things, ",
        "start": 253.84,
        "duration": 2.169
    },
    {
        "text": "but I really suspect that as soon as you wrap something in a certain kind of judgment ",
        "start": 256.009,
        "duration": 3.969
    },
    {
        "text": "of there's a notion of being correct or incorrect or an implicit statement there's ",
        "start": 259.978,
        "duration": 3.831
    },
    {
        "text": "a notion of being good at math.",
        "start": 263.809,
        "duration": 1.431
    },
    {
        "text": "Some people are math people, some people aren't math people.",
        "start": 265.36,
        "duration": 2.18
    },
    {
        "text": "As soon as you get someone identifying that they're not a math person, ",
        "start": 268.08,
        "duration": 3.223
    },
    {
        "text": "first you know insinuating that that even makes sense and then insinuating ",
        "start": 271.303,
        "duration": 3.404
    },
    {
        "text": "that they fall into that, like of course you're not going to like it.",
        "start": 274.707,
        "duration": 3.133
    },
    {
        "text": "Of course your natural mind churnings aren't going to go in ",
        "start": 278.02,
        "duration": 2.472
    },
    {
        "text": "the direction of some puzzle because you'd much rather think ",
        "start": 280.492,
        "duration": 2.513
    },
    {
        "text": "about things that you're good at and that make you feel happy.",
        "start": 283.005,
        "duration": 2.555
    },
    {
        "text": "All of the latest stuff about growth mindsets and ",
        "start": 286.12,
        "duration": 2.603
    },
    {
        "text": "Carol DeWack and Joe Bowler are really behind that.",
        "start": 288.723,
        "duration": 2.657
    },
    {
        "text": "You know, the idea that if you're trying to tell a student something about how ",
        "start": 291.56,
        "duration": 3.562
    },
    {
        "text": "they're doing with math rather than framing it around, oh you must be so smart, right?",
        "start": 295.122,
        "duration": 3.878
    },
    {
        "text": "Frame it around, oh you must have worked very ",
        "start": 299.14,
        "duration": 2.108
    },
    {
        "text": "hard or you must have put a lot of time into that.",
        "start": 301.248,
        "duration": 2.292
    },
    {
        "text": "There's a lot of much less judgmental things that we have out there, like reading.",
        "start": 303.72,
        "duration": 4.74
    },
    {
        "text": "Even though there's some notions of reading comprehension tests for ",
        "start": 308.7,
        "duration": 2.786
    },
    {
        "text": "students in school and you know you're reading at an eighth grade level, ",
        "start": 311.486,
        "duration": 2.992
    },
    {
        "text": "people usually aren't like, oh I'm not a reading person, right?",
        "start": 314.478,
        "duration": 2.582
    },
    {
        "text": "Like I, those words like some people that just make sense to ",
        "start": 317.36,
        "duration": 2.747
    },
    {
        "text": "them but for me those letters I don't know how they come together.",
        "start": 320.107,
        "duration": 2.973
    },
    {
        "text": "When it comes to contest math like the AMC, I think those ",
        "start": 323.56,
        "duration": 3.204
    },
    {
        "text": "can be really good for high schoolers as a bank of problems.",
        "start": 326.764,
        "duration": 3.316
    },
    {
        "text": "I think they can be really bad for high schoolers as an insinuation of there's ",
        "start": 330.52,
        "duration": 3.59
    },
    {
        "text": "some like top-tier math folk and they can do these problems really quickly.",
        "start": 334.11,
        "duration": 3.41
    },
    {
        "text": "But if you give the same questions to the student and you say ",
        "start": 337.7,
        "duration": 3.043
    },
    {
        "text": "rather than being forced to go through all of these in 75 minutes, ",
        "start": 340.743,
        "duration": 3.289
    },
    {
        "text": "you say let's spend 30 minutes on just one of them, right?",
        "start": 344.032,
        "duration": 2.848
    },
    {
        "text": "Really delving into it.",
        "start": 346.92,
        "duration": 1.08
    },
    {
        "text": "They're really solid problems that kind of engage in the spirit ",
        "start": 348.34,
        "duration": 3.294
    },
    {
        "text": "of problem solving and you know removing that judgmental aspect, ",
        "start": 351.634,
        "duration": 3.345
    },
    {
        "text": "removing that time aspect, I think you know that can help out a lot.",
        "start": 354.979,
        "duration": 3.501
    },
    {
        "text": "A lot of people ask about certain things that I've ",
        "start": 359.0,
        "duration": 2.684
    },
    {
        "text": "made promises for but haven't necessarily delivered on.",
        "start": 361.684,
        "duration": 2.896
    },
    {
        "text": "In a recent video, you know, I did one on divergence and curl ",
        "start": 365.14,
        "duration": 3.001
    },
    {
        "text": "and I mentioned at the end an example of using complex numbers ",
        "start": 368.141,
        "duration": 3.049
    },
    {
        "text": "to model fluid flow and a certain model for flow around a wing.",
        "start": 371.19,
        "duration": 3.05
    },
    {
        "text": "And you might notice I have yet to actually put out a video on that and I've ",
        "start": 374.7,
        "duration": 3.41
    },
    {
        "text": "certainly seen a number of commenters you know hampering on me for that fact.",
        "start": 378.11,
        "duration": 3.41
    },
    {
        "text": "If there's ever a thing that I promise and then I don't make a video on it, ",
        "start": 382.14,
        "duration": 3.678
    },
    {
        "text": "it's probably because I spent a good amount of time trying to write a ",
        "start": 385.818,
        "duration": 3.388
    },
    {
        "text": "script for it that I just didn't feel was compelling for whatever reason.",
        "start": 389.206,
        "duration": 3.534
    },
    {
        "text": "And I think maybe the granddaddy here is the probability series, ",
        "start": 392.9,
        "duration": 3.428
    },
    {
        "text": "which at the moment I have five videos that I've made that are you know released ",
        "start": 396.328,
        "duration": 4.271
    },
    {
        "text": "to patrons.",
        "start": 400.599,
        "duration": 0.581
    },
    {
        "text": "I don't, I just don't feel great about them and I kind of want the stuff ",
        "start": 402.22,
        "duration": 3.74
    },
    {
        "text": "that I put out to you guys to be something I feel is you know if not original, ",
        "start": 405.96,
        "duration": 4.047
    },
    {
        "text": "something that wouldn't be out there otherwise from other creators.",
        "start": 410.007,
        "duration": 3.433
    },
    {
        "text": "And there's a lot of good probability material online.",
        "start": 413.94,
        "duration": 2.12
    },
    {
        "text": "I will probably do something to release the material that I have, ",
        "start": 416.42,
        "duration": 3.411
    },
    {
        "text": "either just as it is but on some second channel with the acknowledgement, ",
        "start": 419.831,
        "duration": 3.825
    },
    {
        "text": "hey this isn't the greatest work I think I've done, ",
        "start": 423.656,
        "duration": 2.687
    },
    {
        "text": "or trying to rework them and make them standalones.",
        "start": 426.343,
        "duration": 2.637
    },
    {
        "text": "But as far as you know essence of blank content, ",
        "start": 429.32,
        "duration": 2.247
    },
    {
        "text": "I feel much clearer about how I would want to extend the linear algebra ",
        "start": 431.567,
        "duration": 3.303
    },
    {
        "text": "series rather than spinning my wheels on certain scripts and animations ",
        "start": 434.87,
        "duration": 3.302
    },
    {
        "text": "that I ultimately don't think are going to deliver something to you guys ",
        "start": 438.172,
        "duration": 3.349
    },
    {
        "text": "that I would feel proud of.",
        "start": 441.521,
        "duration": 1.239
    },
    {
        "text": "Do you have any questions, Jabril?",
        "start": 442.76,
        "duration": 1.5
    },
    {
        "text": "I'm just reading from, reading from some Reddit ones here, but we do something live.",
        "start": 446.08,
        "duration": 4.02
    },
    {
        "text": "How much compromise if any do you have to give with like what ",
        "start": 450.32,
        "duration": 3.563
    },
    {
        "text": "you can animate versus like what your script is trying to convey?",
        "start": 453.883,
        "duration": 3.737
    },
    {
        "text": "Usually if I can't animate a thing, and it's a mathematical thing, ",
        "start": 458.04,
        "duration": 3.115
    },
    {
        "text": "it's not like a frivolous cartoonish type thing, ",
        "start": 461.155,
        "duration": 2.279
    },
    {
        "text": "I change the tool so that it can animate that thing right and then ",
        "start": 463.434,
        "duration": 3.116
    },
    {
        "text": "that might take more time.",
        "start": 466.55,
        "duration": 1.21
    },
    {
        "text": "And it's possible that subconsciously that means I resist ",
        "start": 468.14,
        "duration": 2.744
    },
    {
        "text": "topics that I know would be more difficult to animate.",
        "start": 470.884,
        "duration": 2.556
    },
    {
        "text": "I don't think that happens, I like to use that to encourage creation of new things right, ",
        "start": 474.06,
        "duration": 4.19
    },
    {
        "text": "like on the divergence curl didn't have good fluid flow stuff ",
        "start": 478.25,
        "duration": 2.887
    },
    {
        "text": "but it was fun to play around with that.",
        "start": 481.137,
        "duration": 1.863
    },
    {
        "text": "For quaternions right now I think there's a lot of 3D related things that ",
        "start": 483.94,
        "duration": 4.063
    },
    {
        "text": "I wanted to sort of upgrade because the previous way I was doing a lot ",
        "start": 488.003,
        "duration": 3.898
    },
    {
        "text": "of 3D animations was clunky and not as extensible as I wanted it to be.",
        "start": 491.901,
        "duration": 3.899
    },
    {
        "text": "So usually that is a good excuse to just improve the graphics tool.",
        "start": 496.18,
        "duration": 3.22
    },
    {
        "text": "We have somewhere a question on here, what sort of music do you listen to?",
        "start": 500.76,
        "duration": 2.98
    },
    {
        "text": "Which I mostly wanted to answer to like mention my renewed love for the Punch Brothers.",
        "start": 504.82,
        "duration": 5.6
    },
    {
        "text": "I don't know if any of you know about them, they're actually super weird, ",
        "start": 510.76,
        "duration": 4.223
    },
    {
        "text": "they're like a avant-garde bluegrass band.",
        "start": 514.983,
        "duration": 2.397
    },
    {
        "text": "It's just five geniuses who get together and put out phenomenal art, ",
        "start": 517.6,
        "duration": 3.576
    },
    {
        "text": "so can't complain about that.",
        "start": 521.176,
        "duration": 1.503
    },
    {
        "text": "How do you compare making your videos to making videos for Khan Academy?",
        "start": 523.08,
        "duration": 3.16
    },
    {
        "text": "So very different processes right, like Khan Academy you imagine ",
        "start": 526.9,
        "duration": 2.848
    },
    {
        "text": "sitting next to someone and tutoring them and just explaining it, ",
        "start": 529.748,
        "duration": 2.892
    },
    {
        "text": "you're writing everything by hand, for the most part you do it live.",
        "start": 532.64,
        "duration": 2.98
    },
    {
        "text": "On this channel I obviously script things, I put ",
        "start": 536.42,
        "duration": 2.48
    },
    {
        "text": "a lot of time into creating the visuals for it.",
        "start": 538.9,
        "duration": 2.38
    },
    {
        "text": "Sometimes in a way that makes me feel you know if at Khan ",
        "start": 541.76,
        "duration": 2.446
    },
    {
        "text": "Academy I could sit down and make like three videos in an ",
        "start": 544.206,
        "duration": 2.447
    },
    {
        "text": "afternoon and here it's taking me like three weeks to do one video.",
        "start": 546.653,
        "duration": 2.827
    },
    {
        "text": "You know, which of these actually carries more of an impact.",
        "start": 549.9,
        "duration": 2.02
    },
    {
        "text": "I think there's a proper balance for both of them and I think there's a lot of people ",
        "start": 552.66,
        "duration": 4.06
    },
    {
        "text": "out there who do the Khan style stuff to include Khan Academy but also many others.",
        "start": 556.72,
        "duration": 3.92
    },
    {
        "text": "The way I like to think about things is what wouldn't happen if I wasn't doing it?",
        "start": 561.02,
        "duration": 3.74
    },
    {
        "text": "But there is that little part of me that thinks maybe I should start some ",
        "start": 565.16,
        "duration": 3.592
    },
    {
        "text": "sort of second channel of the super cheap, just like me and a notebook ",
        "start": 568.752,
        "duration": 3.447
    },
    {
        "text": "and a pencil like scrapping through some sort of explanation super quickly.",
        "start": 572.199,
        "duration": 3.641
    },
    {
        "text": "Who makes the awesome music playing in your videos?",
        "start": 576.76,
        "duration": 2.04
    },
    {
        "text": "Vince Rubenetti.",
        "start": 579.3,
        "duration": 0.62
    },
    {
        "text": "Link in the description, link in all of the descriptions actually, ",
        "start": 580.56,
        "duration": 2.723
    },
    {
        "text": "he does really good work and just go you know download some of the music ",
        "start": 583.283,
        "duration": 2.968
    },
    {
        "text": "and leave him a little tip if you feel like it's something that you enjoy.",
        "start": 586.251,
        "duration": 3.009
    },
    {
        "text": "What is your favorite Palomino?\n188\n00:09:51,560 --> 00:09:51,200\nPalomino?",
        "start": 589.98,
        "duration": 1.22
    },
    {
        "text": "Palomino? Polymono?",
        "start": 591.56,
        "duration": 1.0
    },
    {
        "text": "This one.",
        "start": 593.62,
        "duration": 0.54
    },
    {
        "text": "I'll figure it out later and insert it on the screen.",
        "start": 594.86,
        "duration": 1.88
    },
    {
        "text": "All right folks, thanks for watching, stick around for whenever the next upload is.",
        "start": 597.48,
        "duration": 3.72
    },
    {
        "text": "It's going to be on Quaternions and I hope you like it.",
        "start": 601.34,
        "duration": 2.18
    },
    {
        "text": "This is your close-up and this is your wide. All right. ",
        "start": 605.92,
        "duration": 3.283
    },
    {
        "text": "Does that probably mean I should be looking at the wide one? ",
        "start": 609.203,
        "duration": 3.578
    },
    {
        "text": "Or do I do a dramatic like camera number two?",
        "start": 612.781,
        "duration": 2.639
    }
]