[
    {
        "text": "Hey there, welcome to 3Blue1Brown.",
        "start": 0.02,
        "duration": 1.86
    },
    {
        "text": "So, I make videos that animate math.",
        "start": 1.88,
        "duration": 2.22
    },
    {
        "text": "For a lot of them, I just try to find something kinda interesting or thought provoking,",
        "start": 4.76,
        "duration": 3.28
    },
    {
        "text": "not necessarily in the typical progression of subjects that a student would see in school.",
        "start": 8.1,
        "duration": 4.26
    },
    {
        "text": "To see what I mean there, check out some of the Recommended playlist.",
        "start": 12.76,
        "duration": 2.58
    },
    {
        "text": "Some of the channel, though, is more directly targeted at people",
        "start": 15.46,
        "duration": 2.88
    },
    {
        "text": "actually trying to learn a commonly taught subject.",
        "start": 18.34,
        "duration": 2.66
    },
    {
        "text": "For an example of what I mean there, check out the Essence of Linear Algebra series that I did.",
        "start": 21.43,
        "duration": 4.339
    },
    {
        "text": "I'll always be working on some other 'Essence of' series like this, so stay posted for more.",
        "start": 25.96,
        "duration": 4.52
    },
    {
        "text": "Now, when I say that these videos animate math, on the one hand, I mean that very directly;",
        "start": 31.3,
        "duration": 5.06
    },
    {
        "text": "things are explained with moving visuals and anthropomorphic kinda-cartoonish pi creatures,",
        "start": 36.36,
        "duration": 4.58
    },
    {
        "text": "but my hope here is that they animate math in another, more literal sense of giving life to the subject.",
        "start": 41.26,
        "duration": 5.34
    },
    {
        "text": "Math kinda gets a bad rap for being abstruse and inhuman,",
        "start": 46.98,
        "duration": 3.46
    },
    {
        "text": "and let's face it, a lot of it is symbol heavy and can be introduced in a pretty unmotivated way.",
        "start": 50.76,
        "duration": 4.74
    },
    {
        "text": "But the fact is, good math is nothing less than art.",
        "start": 55.96,
        "duration": 3.16
    },
    {
        "text": "I'm guessing a lot of you out there know that feeling",
        "start": 59.94,
        "duration": 1.76
    },
    {
        "text": "when you wrap your mind around a really clever argument",
        "start": 61.7,
        "duration": 2.52
    },
    {
        "text": "and it's got that very unique flavour of satisfaction.",
        "start": 64.46,
        "duration": 3.1
    },
    {
        "text": "And same goes for re-understanding something familiar, but in a novel or unexpected light.",
        "start": 68.04,
        "duration": 4.42
    },
    {
        "text": "Here, I'm just trying to do my part to share feelings like those with more people.",
        "start": 72.96,
        "duration": 3.86
    },
    {
        "text": "So take a look at some of the videos here,",
        "start": 77.28,
        "duration": 2.08
    },
    {
        "text": "and if you want to stay posted about new stuff,",
        "start": 79.38,
        "duration": 2.38
    },
    {
        "text": "or to just see new videos rather than this trailer whenever you come back to the page,",
        "start": 81.86,
        "duration": 3.52
    },
    {
        "text": "consider subscribing.",
        "start": 85.56,
        "duration": 1.64
    }
]