[
    {
        "text": "In the main video on cryptocurrencies, I made two references to situations where in order ",
        "start": 3.9,
        "duration": 5.43
    },
    {
        "text": "to break a given piece of security, you would have to guess a specific string of 256 bits.",
        "start": 9.33,
        "duration": 5.43
    },
    {
        "text": "One of these was in the context of digital signatures, ",
        "start": 15.44,
        "duration": 2.406
    },
    {
        "text": "and the other in the context of a cryptographic hash function.",
        "start": 17.846,
        "duration": 2.714
    },
    {
        "text": "For example, if you want to find a message whose SHA-256 hash is some specific string ",
        "start": 21.2,
        "duration": 5.959
    },
    {
        "text": "of 256 bits, you have no better method than to just guess and check random messages.",
        "start": 27.159,
        "duration": 5.821
    },
    {
        "text": "This would require, on average, 2 to the 256 guesses.",
        "start": 33.68,
        "duration": 3.92
    },
    {
        "text": "This is a number so far removed from anything we ever deal with ",
        "start": 38.38,
        "duration": 3.84
    },
    {
        "text": "that it can be hard to appreciate its size, but let's give it a try.",
        "start": 42.22,
        "duration": 4.08
    },
    {
        "text": "Two to the 256 is the same as 2 to the 32 multiplied by itself 8 times.",
        "start": 46.78,
        "duration": 5.24
    },
    {
        "text": "What's nice about that split is that 2 to the 32 is 4 billion, ",
        "start": 52.56,
        "duration": 3.537
    },
    {
        "text": "which is at least a number we can think about.",
        "start": 56.097,
        "duration": 2.583
    },
    {
        "text": "All we need to do is appreciate what multiplying 4 ",
        "start": 60.8,
        "duration": 3.733
    },
    {
        "text": "billion times itself 8 successive times really feels like.",
        "start": 64.533,
        "duration": 4.247
    },
    {
        "text": "As many of you know, the GPU on your computer can let you ",
        "start": 69.74,
        "duration": 3.004
    },
    {
        "text": "run a bunch of computations in parallel incredibly quickly.",
        "start": 72.744,
        "duration": 3.056
    },
    {
        "text": "If you were to specially program a GPU to run a cryptographic hash function over and ",
        "start": 75.8,
        "duration": 5.138
    },
    {
        "text": "over, a really good one might be able to do a little less than a billion hashes per ",
        "start": 80.938,
        "duration": 5.078
    },
    {
        "text": "second.",
        "start": 86.016,
        "duration": 0.424
    },
    {
        "text": "Let's say you just take a bunch of those and cram your computer full ",
        "start": 87.2,
        "duration": 3.689
    },
    {
        "text": "of extra GPUs so that your computer can run 4 billion hashes per second.",
        "start": 90.889,
        "duration": 3.851
    },
    {
        "text": "So the first 4 billion here is going to represent ",
        "start": 95.42,
        "duration": 2.578
    },
    {
        "text": "the number of hashes per second per computer.",
        "start": 97.998,
        "duration": 2.322
    },
    {
        "text": "Now, picture 4 billion of these GPU-packed computers.",
        "start": 101.16,
        "duration": 4.2
    },
    {
        "text": "For comparison, even though Google does not at all make their number of servers public, ",
        "start": 106.24,
        "duration": 4.563
    },
    {
        "text": "estimates have it somewhere in the single-digit millions.",
        "start": 110.803,
        "duration": 2.957
    },
    {
        "text": "In reality, most of those servers are going to be much ",
        "start": 114.6,
        "duration": 2.822
    },
    {
        "text": "less powerful than our imagined GPU-packed machine.",
        "start": 117.422,
        "duration": 2.618
    },
    {
        "text": "But let's say that Google replaced all of its millions of servers with a machine like ",
        "start": 120.58,
        "duration": 4.848
    },
    {
        "text": "this, then 4 billion machines would mean about 1,000 copies of this souped-up Google.",
        "start": 125.428,
        "duration": 4.792
    },
    {
        "text": "Let's call that 1 kilo-Google worth of computing power.",
        "start": 130.8,
        "duration": 2.56
    },
    {
        "text": "There's about 7.3 billion people on Earth.",
        "start": 134.94,
        "duration": 2.56
    },
    {
        "text": "So next, imagine giving a little over half of every ",
        "start": 138.06,
        "duration": 3.109
    },
    {
        "text": "individual on Earth their own personal kilo-Google.",
        "start": 141.169,
        "duration": 3.051
    },
    {
        "text": "Now, imagine 4 billion copies of this Earth.",
        "start": 145.46,
        "duration": 3.36
    },
    {
        "text": "For comparison, the Milky Way has somewhere between 100 and 400 billion stars.",
        "start": 149.9,
        "duration": 4.92
    },
    {
        "text": "We don't really know, but the estimates tend to be in that range.",
        "start": 155.28,
        "duration": 2.26
    },
    {
        "text": "This would be akin to a full 1% of every star in the galaxy having a copy ",
        "start": 158.4,
        "duration": 4.726
    },
    {
        "text": "of Earth where half the people on Earth have their own personal kilo-Google.",
        "start": 163.126,
        "duration": 4.854
    },
    {
        "text": "Next, try to imagine 4 billion copies of the Milky Way.",
        "start": 169.14,
        "duration": 4.54
    },
    {
        "text": "And we're going to call this your giga-galactic supercomputer, ",
        "start": 173.68,
        "duration": 4.188
    },
    {
        "text": "running about 2 to the 160 guesses every second.",
        "start": 177.868,
        "duration": 3.192
    },
    {
        "text": "Now, 4 billion seconds, that's about 126.8 years.",
        "start": 183.2,
        "duration": 3.94
    },
    {
        "text": "Four billion of those, well that's 507 billion years, ",
        "start": 187.8,
        "duration": 3.24
    },
    {
        "text": "which is about 37 times the age of the universe.",
        "start": 191.04,
        "duration": 2.88
    },
    {
        "text": "So even if you were to have your GPU-packed kilo-Google-per-person multiplanetary ",
        "start": 194.96,
        "duration": 5.174
    },
    {
        "text": "giga-galactic computer guessing numbers for 37 times the age of the universe, ",
        "start": 200.134,
        "duration": 4.923
    },
    {
        "text": "it would still only have a 1 in 4 billion chance of finding the correct guess.",
        "start": 205.057,
        "duration": 4.923
    },
    {
        "text": "By the way, the state of Bitcoin hashing these days is that all of the miners put ",
        "start": 212.28,
        "duration": 4.899
    },
    {
        "text": "together guess and check at a rate of about 5 billion billion hashes per second.",
        "start": 217.179,
        "duration": 4.781
    },
    {
        "text": "That corresponds to one third of what I just described as a kilo-Google.",
        "start": 222.6,
        "duration": 3.36
    },
    {
        "text": "This is not because there are billions of GPU-packed machines out there, ",
        "start": 226.52,
        "duration": 4.262
    },
    {
        "text": "but because miners actually use something that's about 1000 times better than a GPU, ",
        "start": 230.782,
        "duration": 4.963
    },
    {
        "text": "application-specific integrated circuits.",
        "start": 235.745,
        "duration": 2.395
    },
    {
        "text": "These are pieces of hardware specifically designed for Bitcoin mining, ",
        "start": 238.92,
        "duration": 4.36
    },
    {
        "text": "for running a bunch of SHA-256 hashes, and nothing else.",
        "start": 243.28,
        "duration": 3.44
    },
    {
        "text": "Turns out, there's a lot of efficiency gains to be had when you throw out the need ",
        "start": 247.5,
        "duration": 4.204
    },
    {
        "text": "for general computation and design your integrated circuits for one and only one task.",
        "start": 251.704,
        "duration": 4.356
    },
    {
        "text": "Also, on the topic of large powers of two that I personally find it hard to ",
        "start": 257.94,
        "duration": 4.056
    },
    {
        "text": "get my mind around, this channel recently surpassed 2 to the 18th subscribers.",
        "start": 261.996,
        "duration": 4.164
    },
    {
        "text": "And to engage a little more with some sub-portion of those 2 to the 18 people, ",
        "start": 266.94,
        "duration": 3.957
    },
    {
        "text": "I'm going to do a Q&A session.",
        "start": 270.897,
        "duration": 1.503
    },
    {
        "text": "I've left a link in the description to a Reddit thread where you can ",
        "start": 273.0,
        "duration": 2.976
    },
    {
        "text": "post questions and upvote the ones you want to hear answers to. ",
        "start": 275.976,
        "duration": 2.761
    },
    {
        "text": "And probably in the next video or on Twitter or something like that ",
        "start": 278.737,
        "duration": 2.933
    },
    {
        "text": "I'll announce the format in which I'd like to give answers. See you then!",
        "start": 281.67,
        "duration": 3.15
    }
]