[
    {
        "text": "Usually, I don't think notation and math matters that much.",
        "start": 3.899,
        "duration": 2.921
    },
    {
        "text": "Don't get me wrong, I enjoy a bad notation rant as much as the next guy, ",
        "start": 7.3,
        "duration": 3.063
    },
    {
        "text": "and there are clearly a few simple changes to our conventions ",
        "start": 10.363,
        "duration": 2.602
    },
    {
        "text": "that could speed up learning for math students everywhere.",
        "start": 12.965,
        "duration": 2.435
    },
    {
        "text": "But at the end of the day, notation, good or bad, is just not the point of math.",
        "start": 15.86,
        "duration": 4.3
    },
    {
        "text": "Even the most carefully designed symbols and syntax will fail to capture the underlying ",
        "start": 20.68,
        "duration": 4.287
    },
    {
        "text": "visual that constitutes understanding, so I figure it's better to just spend time ",
        "start": 24.967,
        "duration": 3.994
    },
    {
        "text": "focusing on that underlying essence and let the symbols just be what they are in peace.",
        "start": 28.961,
        "duration": 4.239
    },
    {
        "text": "But that said, when unintuitive notation actively stalls the gears of learning, ",
        "start": 34.24,
        "duration": 4.138
    },
    {
        "text": "my disposition on the matter hardens up a little bit.",
        "start": 38.378,
        "duration": 2.742
    },
    {
        "text": "In particular, I'm thinking of one threesome of syntax which, ",
        "start": 41.48,
        "duration": 3.162
    },
    {
        "text": "when you stop and think about it, is an egregious source of friction in math ",
        "start": 44.642,
        "duration": 3.926
    },
    {
        "text": "education everywhere.",
        "start": 48.568,
        "duration": 1.072
    },
    {
        "text": "If you take the fact that 2 multiplied by itself 3 times equals 8, ",
        "start": 50.64,
        "duration": 3.462
    },
    {
        "text": "for example, we have three separate ways to explain that relationship.",
        "start": 54.102,
        "duration": 3.618
    },
    {
        "text": "2 cubed equals 8, with a superscript.",
        "start": 58.4,
        "duration": 2.3
    },
    {
        "text": "The cube root of 8 is 2, with a squaggly radical symbol.",
        "start": 61.48,
        "duration": 2.92
    },
    {
        "text": "And the log base 2 of 8 equals 3, which we write using the word log itself.",
        "start": 65.08,
        "duration": 4.32
    },
    {
        "text": "What the hell do these three ways of writing the same fact have to do with each other?",
        "start": 70.06,
        "duration": 3.26
    },
    {
        "text": "Making up syntax for a concept is fine, but don't do it in three ",
        "start": 73.82,
        "duration": 2.953
    },
    {
        "text": "completely different ways for the same concept and force students ",
        "start": 76.773,
        "duration": 3.0
    },
    {
        "text": "to learn every rule about that concept three separate times.",
        "start": 79.773,
        "duration": 2.727
    },
    {
        "text": "It's like it's a different language.",
        "start": 82.86,
        "duration": 1.16
    },
    {
        "text": "This way of writing things isn't just counterintuitive, ",
        "start": 84.66,
        "duration": 2.598
    },
    {
        "text": "it's counter-mathematical, since rather than making seemingly different ",
        "start": 87.258,
        "duration": 3.341
    },
    {
        "text": "facts look the same, which is what math should do, ",
        "start": 90.599,
        "duration": 2.367
    },
    {
        "text": "it takes three facts which should obviously be the same and makes them ",
        "start": 92.966,
        "duration": 3.294
    },
    {
        "text": "look artificially different.",
        "start": 96.26,
        "duration": 1.3
    },
    {
        "text": "Just think about how confusing logarithms were the first time you learned about them.",
        "start": 98.2,
        "duration": 3.34
    },
    {
        "text": "This is, of course, a known issue, and the internet has no shortage of ",
        "start": 103.46,
        "duration": 3.32
    },
    {
        "text": "people raising the same concern with suggestions for a better notation.",
        "start": 106.78,
        "duration": 3.32
    },
    {
        "text": "But recently, I stumbled across a math exchange post with a suggestion so lovely, ",
        "start": 110.1,
        "duration": 5.346
    },
    {
        "text": "so symmetrical, so utterly reasonable, that I just have to share it.",
        "start": 115.446,
        "duration": 4.434
    },
    {
        "text": "For a relationship like 2 cubed equals 8, take a triangle and write 2 in the lower left, ",
        "start": 120.46,
        "duration": 5.659
    },
    {
        "text": "3 on the top, and 8 on the lower right.",
        "start": 126.119,
        "duration": 2.481
    },
    {
        "text": "To express the operation 2 cubed, remove that bottom right corner.",
        "start": 129.4,
        "duration": 3.68
    },
    {
        "text": "The symbol as a whole represents the value that should go in the missing corner.",
        "start": 133.64,
        "duration": 3.66
    },
    {
        "text": "To express log base 2 of 8, which is asking the question 2 to the what equals 8, ",
        "start": 138.92,
        "duration": 5.111
    },
    {
        "text": "remove the top number.",
        "start": 144.031,
        "duration": 1.389
    },
    {
        "text": "The symbol as a whole represents the value that should go in the missing corner.",
        "start": 146.06,
        "duration": 3.02
    },
    {
        "text": "To express the cube root of 8, which is saying what number to the third power equals 8, ",
        "start": 151.48,
        "duration": 4.385
    },
    {
        "text": "remove the bottom left corner.",
        "start": 155.865,
        "duration": 1.495
    },
    {
        "text": "The symbol as a whole represents the value that should go in the missing corner.",
        "start": 158.0,
        "duration": 3.02
    },
    {
        "text": "In other words, all three operations are completely symmetrically represented.",
        "start": 161.8,
        "duration": 3.94
    },
    {
        "text": "This triangle deserves a name, and a friend of mine at Khan ",
        "start": 166.28,
        "duration": 2.776
    },
    {
        "text": "Academy decided that we should call it the triangle of power.",
        "start": 169.056,
        "duration": 2.824
    },
    {
        "text": "The definition alone is mildly pleasing, but where it gets fun is ",
        "start": 173.04,
        "duration": 3.173
    },
    {
        "text": "when you see how much smoother all of the different operations become.",
        "start": 176.213,
        "duration": 3.367
    },
    {
        "text": "In our current notation, there are 6 different ",
        "start": 180.7,
        "duration": 2.33
    },
    {
        "text": "ways to express the various inverse operations.",
        "start": 183.03,
        "duration": 2.33
    },
    {
        "text": "Most of these are memorized as separate entities, some are rarely even talked about, ",
        "start": 185.88,
        "duration": 4.254
    },
    {
        "text": "and there's no discernible pattern even though all of them describe the same basic idea.",
        "start": 190.134,
        "duration": 4.406
    },
    {
        "text": "But students still have to spend 6 times the effort to memorize each one, ",
        "start": 195.06,
        "duration": 3.535
    },
    {
        "text": "are 6 times more likely to make a mistake, and have 6 separate opportunities to decide ",
        "start": 198.595,
        "duration": 4.157
    },
    {
        "text": "math is dumb and boring and conducive to failure and why don't I just go study art ",
        "start": 202.752,
        "duration": 3.965
    },
    {
        "text": "instead?",
        "start": 206.717,
        "duration": 0.383
    },
    {
        "text": "With the triangle of power, all these operations follow the same pattern.",
        "start": 208.06,
        "duration": 3.56
    },
    {
        "text": "Our brains are really good at picking up on patterns like this, ",
        "start": 214.16,
        "duration": 2.964
    },
    {
        "text": "and you can much more easily imagine a smooth mental image associated with the property.",
        "start": 217.124,
        "duration": 4.076
    },
    {
        "text": "There's even kind of an aesthetic pleasure to this, and who knows, ",
        "start": 223.34,
        "duration": 3.075
    },
    {
        "text": "maybe more of the artistically inclined students would look favorably upon ",
        "start": 226.415,
        "duration": 3.443
    },
    {
        "text": "math long enough to see just how valuable their intuitions really are in the science.",
        "start": 229.858,
        "duration": 3.902
    },
    {
        "text": "Let's take another property, like the idea that a ",
        "start": 234.92,
        "duration": 3.0
    },
    {
        "text": "to the x times a to the y equals a to the x plus y.",
        "start": 237.92,
        "duration": 3.06
    },
    {
        "text": "The corresponding fact for logarithms is that ",
        "start": 241.9,
        "duration": 3.066
    },
    {
        "text": "log of x times y equals log of x plus log of y.",
        "start": 244.966,
        "duration": 3.134
    },
    {
        "text": "When you write this with the triangle of power, ",
        "start": 249.239,
        "duration": 2.071
    },
    {
        "text": "it's a little easier to see that both of these expressions are really ",
        "start": 251.31,
        "duration": 3.02
    },
    {
        "text": "saying the same thing.",
        "start": 254.33,
        "duration": 0.95
    },
    {
        "text": "Remember, the symbol as a whole represents the number at the missing corner, ",
        "start": 256.079,
        "duration": 3.413
    },
    {
        "text": "so the top expression is saying that when you multiply two numbers that belong on the ",
        "start": 259.492,
        "duration": 3.811
    },
    {
        "text": "bottom right of the triangle, it corresponds with adding the numbers that belong to ",
        "start": 263.303,
        "duration": 3.722
    },
    {
        "text": "the top.",
        "start": 267.025,
        "duration": 0.355
    },
    {
        "text": "But that's also what the lower expression is saying, ",
        "start": 267.86,
        "duration": 2.218
    },
    {
        "text": "when you multiply the numbers at the bottom right, ",
        "start": 270.078,
        "duration": 2.134
    },
    {
        "text": "it corresponds with adding numbers that belong to the top.",
        "start": 272.212,
        "duration": 2.428
    },
    {
        "text": "To help students with this, you could draw inside of the triangle, ",
        "start": 276.84,
        "duration": 3.22
    },
    {
        "text": "saying that when the lower left is constant, the numbers at the top like to add, ",
        "start": 280.06,
        "duration": 3.893
    },
    {
        "text": "while the bottom right numbers like to multiply.",
        "start": 283.953,
        "duration": 2.307
    },
    {
        "text": "What about when a different corner stays constant, like the top?",
        "start": 287.62,
        "duration": 2.58
    },
    {
        "text": "Well in this case, you'd write a multiplication sign in both the bottom corners, ",
        "start": 293.26,
        "duration": 4.177
    },
    {
        "text": "because with exponents and radicals, multiplication turns into multiplication.",
        "start": 297.437,
        "duration": 4.023
    },
    {
        "text": "The natural question that a student might ask from here is if ",
        "start": 305.9,
        "duration": 3.012
    },
    {
        "text": "there's an analogous rule for when the lower right stays constant.",
        "start": 308.912,
        "duration": 3.208
    },
    {
        "text": "There is!",
        "start": 318.76,
        "duration": 0.8
    },
    {
        "text": "You have to introduce a new operation, which for the sake of this video, ",
        "start": 320.08,
        "duration": 4.826
    },
    {
        "text": "I'll call O+, where A O plus B equals one over one over A plus one over B.",
        "start": 324.906,
        "duration": 4.894
    },
    {
        "text": "This is not actually a ridiculous thing to introduce, ",
        "start": 330.42,
        "duration": 2.445
    },
    {
        "text": "since it comes up in physics all the time, like when you're computing parallel resistance.",
        "start": 332.865,
        "duration": 4.075
    },
    {
        "text": "With that symbol, you could say that when the lower right number stays constant, ",
        "start": 337.72,
        "duration": 3.942
    },
    {
        "text": "the top numbers like to get O-plussed together, ",
        "start": 341.662,
        "duration": 2.336
    },
    {
        "text": "and the bottom left numbers like to get multiplied.",
        "start": 343.998,
        "duration": 2.482
    },
    {
        "text": "This is actually a really nice connection between logarithms and roots, ",
        "start": 353.36,
        "duration": 3.392
    },
    {
        "text": "and it never gets discussed, probably because the notation isn't really conducive to ",
        "start": 356.752,
        "duration": 4.005
    },
    {
        "text": "asking the question.",
        "start": 360.757,
        "duration": 0.943
    },
    {
        "text": "I could go on and on here, showing a lot of other properties, but honestly, ",
        "start": 363.3,
        "duration": 3.953
    },
    {
        "text": "I think the best case I can make here is to encourage you to explore it for yourself, ",
        "start": 367.253,
        "duration": 4.473
    },
    {
        "text": "and notice that just about everything involving exponents, logs, ",
        "start": 371.726,
        "duration": 3.381
    },
    {
        "text": "or radicals becomes nicer when you use the triangle of power.",
        "start": 375.107,
        "duration": 3.173
    },
    {
        "text": "By the way, I hope that it goes without saying that in this perfect world, ",
        "start": 379.46,
        "duration": 3.707
    },
    {
        "text": "students wouldn't learn these operations purely from the symbols.",
        "start": 383.167,
        "duration": 3.213
    },
    {
        "text": "They should still ask why it's true, and why it doesn't follow a different pattern.",
        "start": 386.68,
        "duration": 3.64
    },
    {
        "text": "But the point is that when the notation actually reflects the math, ",
        "start": 390.32,
        "duration": 3.664
    },
    {
        "text": "the questions that students are most naturally asking tend to be ",
        "start": 393.984,
        "duration": 3.502
    },
    {
        "text": "the ones that cut right into the essence of what's going on.",
        "start": 397.486,
        "duration": 3.234
    },
    {
        "text": "The asymmetries in the notation correspond with actual ",
        "start": 401.38,
        "duration": 3.179
    },
    {
        "text": "asymmetries in the numerical relationship a to the b equals c itself, ",
        "start": 404.559,
        "duration": 4.046
    },
    {
        "text": "not in the artificial asymmetries of squiggles and words.",
        "start": 408.605,
        "duration": 3.295
    },
    {
        "text": "When a student asks why the top likes to get added in one context but O-plussed ",
        "start": 412.9,
        "duration": 4.032
    },
    {
        "text": "in another, the teacher can point out the property that reflecting the triangle ",
        "start": 416.932,
        "duration": 4.033
    },
    {
        "text": "reciprocates the top, and then they can start addressing where that fact comes from.",
        "start": 420.965,
        "duration": 4.235
    },
    {
        "text": "My sincere hope is that students don't learn by symbolic patterns, ",
        "start": 426.04,
        "duration": 3.081
    },
    {
        "text": "but by substantive reasoning and re-derivation within their own heads.",
        "start": 429.121,
        "duration": 3.219
    },
    {
        "text": "But the fact is, most of us do first learn things by symbolic manipulation, ",
        "start": 432.94,
        "duration": 3.961
    },
    {
        "text": "so when there's an opportunity to significantly speed up that process, we should take it!",
        "start": 436.901,
        "duration": 4.639
    },
    {
        "text": "And if you agree with me that the triangle of power is clearly better than what ",
        "start": 442.04,
        "duration": 3.806
    },
    {
        "text": "we have already, start actually using it in your notes to see what it feels like.",
        "start": 445.846,
        "duration": 3.854
    },
    {
        "text": "Spread the word!",
        "start": 450.04,
        "duration": 0.66
    },
    {
        "text": "And, if you're a teacher, maybe start teaching this to your ",
        "start": 451.1,
        "duration": 2.24
    },
    {
        "text": "students so that we can get them hooked while they're young.",
        "start": 453.34,
        "duration": 2.24
    }
]