[
    {
        "text": "This is a footnote to the main video on Bayes' Theorem.",
        "start": 0.0,
        "duration": 2.8
    },
    {
        "text": "If your goal is simply to understand why it's true from a mathematical standpoint, ",
        "start": 3.48,
        "duration": 4.326
    },
    {
        "text": "there's actually a very quick way to see it based on breaking ",
        "start": 7.806,
        "duration": 3.232
    },
    {
        "text": "down how the word AND works in probability.",
        "start": 11.038,
        "duration": 2.242
    },
    {
        "text": "Let's say there are two events, A and B.",
        "start": 14.38,
        "duration": 2.66
    },
    {
        "text": "What's the probability that both of them happen?",
        "start": 17.28,
        "duration": 2.24
    },
    {
        "text": "On the one hand, you could start by thinking of the probability of A, ",
        "start": 20.12,
        "duration": 4.171
    },
    {
        "text": "the proportion of all possibilities where A is true, ",
        "start": 24.291,
        "duration": 3.158
    },
    {
        "text": "then multiply it by the proportion of those events where B is also true, ",
        "start": 27.449,
        "duration": 4.35
    },
    {
        "text": "which is known as the probability of B given A.",
        "start": 31.799,
        "duration": 2.801
    },
    {
        "text": "But it's strange for the formula to look asymmetric in A and B.",
        "start": 35.32,
        "duration": 3.36
    },
    {
        "text": "Presumably, we should also be able to think of it as the proportion ",
        "start": 39.14,
        "duration": 4.27
    },
    {
        "text": "of cases where B is true, among all possibilities, ",
        "start": 43.41,
        "duration": 3.203
    },
    {
        "text": "times the proportion of those where A is also true, the probability of A given B.",
        "start": 46.613,
        "duration": 5.087
    },
    {
        "text": "These are both the same, and the fact that they're both the same gives us a way ",
        "start": 52.36,
        "duration": 5.164
    },
    {
        "text": "to express P of A given B in terms of P of B given A, or the other way around.",
        "start": 57.524,
        "duration": 5.036
    },
    {
        "text": "So when one of these conditions is easier to put numbers to than the other, ",
        "start": 65.48,
        "duration": 4.106
    },
    {
        "text": "say when it's easier to think about the probability of seeing some evidence given ",
        "start": 69.586,
        "duration": 4.431
    },
    {
        "text": "a hypothesis rather than the other way around, this simple identity becomes a useful tool.",
        "start": 74.017,
        "duration": 4.863
    },
    {
        "text": "Nevertheless, even if this is somehow a more pure or quick way to understand the formula, ",
        "start": 79.9,
        "duration": 4.785
    },
    {
        "text": "the reason I chose to frame everything in terms of updating beliefs with ",
        "start": 84.685,
        "duration": 3.882
    },
    {
        "text": "evidence in the main video is to help with that third level of understanding, ",
        "start": 88.567,
        "duration": 4.147
    },
    {
        "text": "being able to recognize when this formula, among the wide landscape of ",
        "start": 92.714,
        "duration": 3.775
    },
    {
        "text": "available tools in math, happens to be the right one to use.",
        "start": 96.489,
        "duration": 3.191
    },
    {
        "text": "Otherwise, it's kind of easy to just look at it, nod along, and promptly forget.",
        "start": 100.54,
        "duration": 3.64
    },
    {
        "text": "And you know, while we're here, it's worth highlighting a common ",
        "start": 105.32,
        "duration": 3.958
    },
    {
        "text": "misconception that the probability of A and B is P of A times P of B.",
        "start": 109.278,
        "duration": 4.202
    },
    {
        "text": "For example, if you hear that 1 in 4 people die of heart disease, ",
        "start": 113.48,
        "duration": 3.941
    },
    {
        "text": "it's really tempting to think that that means the probability that both ",
        "start": 117.421,
        "duration": 4.3
    },
    {
        "text": "you and your brother die of heart disease is 1 in 4 times 1 in 4, or 1 in 16.",
        "start": 121.721,
        "duration": 4.599
    },
    {
        "text": "After all, the probability of two successive coin flips yielding tails is ½ times ½, ",
        "start": 127.08,
        "duration": 5.301
    },
    {
        "text": "and the probability of rolling two 1s on a pair of dice is 1 6th times 1 6th, right?",
        "start": 132.381,
        "duration": 5.239
    },
    {
        "text": "The issue is correlation.",
        "start": 139.18,
        "duration": 2.04
    },
    {
        "text": "If your brother dies of heart disease, and considering certain genetic and lifestyle ",
        "start": 141.78,
        "duration": 4.309
    },
    {
        "text": "links that are at play here, your chances of dying from a similar condition are higher.",
        "start": 146.089,
        "duration": 4.411
    },
    {
        "text": "A formula like this, as tempting and clean as it looks, is just flat out wrong.",
        "start": 151.12,
        "duration": 4.42
    },
    {
        "text": "What's going on with cases like flipping coins or rolling ",
        "start": 158.96,
        "duration": 3.182
    },
    {
        "text": "two dice is that each event is independent of the last.",
        "start": 162.142,
        "duration": 3.018
    },
    {
        "text": "So the probability of B given A is the same as the probability of B.",
        "start": 165.84,
        "duration": 4.16
    },
    {
        "text": "What happens to A does not affect B.",
        "start": 170.0,
        "duration": 2.38
    },
    {
        "text": "This is the definition of independence.",
        "start": 172.64,
        "duration": 1.74
    },
    {
        "text": "Keep in mind, many introductory probability examples are given in very gamified contexts, ",
        "start": 175.58,
        "duration": 5.319
    },
    {
        "text": "things with dice and coins, where genuine independence holds, ",
        "start": 180.899,
        "duration": 3.664
    },
    {
        "text": "but all those examples can skew your intuitions.",
        "start": 184.563,
        "duration": 2.837
    },
    {
        "text": "The irony is that some of the most interesting applications of probability, ",
        "start": 187.92,
        "duration": 3.874
    },
    {
        "text": "presumably the whole motivation for the kind of courses using these gamified examples, ",
        "start": 191.794,
        "duration": 4.435
    },
    {
        "text": "are only substantive when events aren't independent.",
        "start": 196.229,
        "duration": 2.651
    },
    {
        "text": "Bayes' theorem, which measures exactly how much one variable depends on another, ",
        "start": 198.88,
        "duration": 4.359
    },
    {
        "text": "is a perfect example of this.",
        "start": 203.239,
        "duration": 1.561
    }
]