[
    {
        "text": "Take 1 plus 2 plus 4 plus 8 and continue on and ",
        "start": 3.76,
        "duration": 3.695
    },
    {
        "text": "on adding the next power of 2 up to infinity.",
        "start": 7.455,
        "duration": 3.465
    },
    {
        "text": "This might seem crazy, but there's a sense in which this infinite sum equals negative 1.",
        "start": 11.7,
        "duration": 4.76
    },
    {
        "text": "If you're like me, this feels strange or obviously false when you first see it, ",
        "start": 17.26,
        "duration": 4.253
    },
    {
        "text": "but I promise you, by the end of this video you and I will make it make sense.",
        "start": 21.513,
        "duration": 4.147
    },
    {
        "text": "To do this, we need to back up, and you and I will walk through what it ",
        "start": 26.18,
        "duration": 3.806
    },
    {
        "text": "might feel like to discover convergent infinite sums, ",
        "start": 29.986,
        "duration": 2.854
    },
    {
        "text": "those ones that at least seem to make sense, to define what they really mean, ",
        "start": 32.84,
        "duration": 4.123
    },
    {
        "text": "then to discover this crazy equation and stumble upon new forms of math ",
        "start": 36.963,
        "duration": 3.806
    },
    {
        "text": "where it makes sense.",
        "start": 40.769,
        "duration": 1.111
    },
    {
        "text": "Imagine that you are an early mathematician in the process of discovering ",
        "start": 44.7,
        "duration": 4.259
    },
    {
        "text": "that ½ plus 1 fourth plus 1 eighth plus 1 sixteenth on and on up to infinity, ",
        "start": 48.959,
        "duration": 4.491
    },
    {
        "text": "whatever that means, equals 1, and imagine that you needed to define what it ",
        "start": 53.45,
        "duration": 4.432
    },
    {
        "text": "means to add infinitely many things for your friends to take you seriously.",
        "start": 57.882,
        "duration": 4.318
    },
    {
        "text": "What would that feel like?",
        "start": 62.92,
        "duration": 0.92
    },
    {
        "text": "Frankly, I have no idea, and I imagine that more than anything it ",
        "start": 64.44,
        "duration": 3.205
    },
    {
        "text": "feels like being wrong or stuck most of the time, ",
        "start": 67.645,
        "duration": 2.429
    },
    {
        "text": "but I'll give my best guess at one way that the successful parts of it might go.",
        "start": 70.074,
        "duration": 3.886
    },
    {
        "text": "One day, you are pondering the nature of distances between objects, ",
        "start": 74.86,
        "duration": 3.382
    },
    {
        "text": "and how no matter how close two things are, it seems that they can ",
        "start": 78.242,
        "duration": 3.334
    },
    {
        "text": "always be brought a little bit closer together without touching.",
        "start": 81.576,
        "duration": 3.184
    },
    {
        "text": "Fond of math as you are, you want to capture this paradoxical feeling with numbers, ",
        "start": 85.56,
        "duration": 4.127
    },
    {
        "text": "so you imagine placing the two objects on the number line, the first at 0, ",
        "start": 89.687,
        "duration": 3.686
    },
    {
        "text": "the second at 1.",
        "start": 93.373,
        "duration": 0.787
    },
    {
        "text": "Then, you march the first object towards the second, ",
        "start": 95.2,
        "duration": 2.835
    },
    {
        "text": "such that with each step, the distance between them is cut in half.",
        "start": 98.035,
        "duration": 3.585
    },
    {
        "text": "You keep track of the numbers this object touches during its march, ",
        "start": 104.14,
        "duration": 4.222
    },
    {
        "text": "writing down ½, ½ plus a fourth, ½ plus a fourth plus an eighth, and so on.",
        "start": 108.362,
        "duration": 4.658
    },
    {
        "text": "That is, each number is naturally written as a ",
        "start": 113.54,
        "duration": 2.8
    },
    {
        "text": "slightly longer sum with one more power of 2 in it.",
        "start": 116.34,
        "duration": 3.04
    },
    {
        "text": "As such, you're tempted to say that if these numbers approach anything, ",
        "start": 119.84,
        "duration": 3.828
    },
    {
        "text": "we should be able to write this thing down as a sum that contains the reciprocal of ",
        "start": 123.668,
        "duration": 4.467
    },
    {
        "text": "every power of 2.",
        "start": 128.135,
        "duration": 0.904
    },
    {
        "text": "On the other hand, we can see geometrically that these numbers approach 1, ",
        "start": 129.639,
        "duration": 4.69
    },
    {
        "text": "so what you want to say is that 1 and some kind of infinite sum are the same thing.",
        "start": 134.329,
        "duration": 5.191
    },
    {
        "text": "If your education was too formal, you'd write the statement off as ridiculous.",
        "start": 140.76,
        "duration": 3.4
    },
    {
        "text": "Clearly, you can't add infinitely many things.",
        "start": 144.54,
        "duration": 2.16
    },
    {
        "text": "No human, computer, or physical thing ever could perform such a task.",
        "start": 147.06,
        "duration": 3.54
    },
    {
        "text": "If, however, you approach math with a healthy irreverence, ",
        "start": 151.02,
        "duration": 3.012
    },
    {
        "text": "you'll stand brave in the face of ridiculousness and try to make sense ",
        "start": 154.032,
        "duration": 3.625
    },
    {
        "text": "out of this nonsense you wrote down, since it kind of feels like nature gave it to you.",
        "start": 157.657,
        "duration": 4.443
    },
    {
        "text": "So how exactly do you, dear mathematician, go about defining infinite sums?",
        "start": 162.54,
        "duration": 5.02
    },
    {
        "text": "Well practiced in math that you are, you know that finding the right ",
        "start": 168.36,
        "duration": 3.33
    },
    {
        "text": "definitions is less about generating new thoughts than it is about dissecting ",
        "start": 171.69,
        "duration": 3.766
    },
    {
        "text": "old thoughts, so you go back to how you came across this fuzzy discovery.",
        "start": 175.456,
        "duration": 3.524
    },
    {
        "text": "At no point did you actually perform infinitely many operations.",
        "start": 179.66,
        "duration": 3.64
    },
    {
        "text": "You had a list of numbers, a list that could keep going forever if you had the time, ",
        "start": 185.12,
        "duration": 4.76
    },
    {
        "text": "and each number came from a perfectly reasonable finite sum.",
        "start": 189.88,
        "duration": 3.36
    },
    {
        "text": "You noticed that the numbers in this list approach 1, but what do you mean by approach?",
        "start": 194.3,
        "duration": 4.3
    },
    {
        "text": "It's not just that the distance between each number and 1 gets smaller, ",
        "start": 200.86,
        "duration": 3.824
    },
    {
        "text": "because for that matter, the distance between each number and 2 also gets smaller.",
        "start": 204.684,
        "duration": 4.356
    },
    {
        "text": "After thinking about it, you realize what makes 1 special is that your ",
        "start": 209.58,
        "duration": 4.056
    },
    {
        "text": "numbers can get arbitrarily close to 1, which is to say, ",
        "start": 213.636,
        "duration": 3.256
    },
    {
        "text": "no matter how small your desired distance, one one hundredth, one one millionth, ",
        "start": 216.892,
        "duration": 4.627
    },
    {
        "text": "or one over the largest number you could write down, ",
        "start": 221.519,
        "duration": 3.028
    },
    {
        "text": "if you go down your list long enough, the numbers will eventually fall ",
        "start": 224.547,
        "duration": 4.056
    },
    {
        "text": "within that tiny tiny distance of 1.",
        "start": 228.603,
        "duration": 2.057
    },
    {
        "text": "Retrospectively, this might seem like the clear way to solidify what you mean ",
        "start": 233.28,
        "duration": 3.487
    },
    {
        "text": "by approach, but as a first-time endeavor, it's actually incredibly clever.",
        "start": 236.767,
        "duration": 3.353
    },
    {
        "text": "Now you pull out your pin, and scribble down the definition for ",
        "start": 241.42,
        "duration": 3.514
    },
    {
        "text": "what it means for an infinite sum to equal some number, say x.",
        "start": 244.934,
        "duration": 3.406
    },
    {
        "text": "It means that when you generate a list of numbers by cutting off your ",
        "start": 249.12,
        "duration": 4.128
    },
    {
        "text": "sum at finite points, the numbers in this list approach x in the sense ",
        "start": 253.248,
        "duration": 4.188
    },
    {
        "text": "that no matter how small the distance you choose, at some point down the list, ",
        "start": 257.436,
        "duration": 4.66
    },
    {
        "text": "all the numbers start falling within that distance of x.",
        "start": 262.096,
        "duration": 3.304
    },
    {
        "text": "In doing this, you just invented some math, but it never felt like ",
        "start": 266.86,
        "duration": 3.465
    },
    {
        "text": "you were pulling things out of thin air, you were just trying to ",
        "start": 270.325,
        "duration": 3.361
    },
    {
        "text": "justify what it was that the universe gave you in the first place.",
        "start": 273.686,
        "duration": 3.414
    },
    {
        "text": "You might wonder if you can find other, more general ",
        "start": 279.92,
        "duration": 2.372
    },
    {
        "text": "truths about these infinite sums that you just invented.",
        "start": 282.292,
        "duration": 2.508
    },
    {
        "text": "To do so, you look for where you made any arbitrary decisions.",
        "start": 285.36,
        "duration": 3.4
    },
    {
        "text": "For instance, when you were shrinking the distance between your objects, ",
        "start": 289.34,
        "duration": 3.824
    },
    {
        "text": "cutting the interval into pieces of size one half, one fourth, ",
        "start": 293.164,
        "duration": 3.3
    },
    {
        "text": "etc., you could have chosen a proportion other than one half.",
        "start": 296.464,
        "duration": 3.196
    },
    {
        "text": "You could have instead cut your interval into pieces of size 9 tenths and 1 tenth, ",
        "start": 300.34,
        "duration": 4.605
    },
    {
        "text": "and then cut that rightmost piece into the same proportions, ",
        "start": 304.945,
        "duration": 3.384
    },
    {
        "text": "giving you smaller pieces of size 9 one hundredths and one one hundredth, ",
        "start": 308.329,
        "duration": 4.106
    },
    {
        "text": "then cut that tiny piece of size one one hundredth similarly.",
        "start": 312.435,
        "duration": 3.385
    },
    {
        "text": "Continuing on and on, you'd see that nine tenths plus nine one ",
        "start": 316.42,
        "duration": 3.742
    },
    {
        "text": "hundredths plus nine one thousandths on and on up to infinity equals one, ",
        "start": 320.162,
        "duration": 4.396
    },
    {
        "text": "a fact more popularly written as point nine repeating equals one.",
        "start": 324.558,
        "duration": 3.862
    },
    {
        "text": "To all of your friends who insist that this doesn't equal 1 and it just approaches it, ",
        "start": 329.04,
        "duration": 4.191
    },
    {
        "text": "you can now just smile, because you know that with infinite sums, ",
        "start": 333.231,
        "duration": 3.18
    },
    {
        "text": "to approach and to equal mean the same thing.",
        "start": 336.411,
        "duration": 2.169
    },
    {
        "text": "To be general about it, let's say that you cut your interval into pieces of ",
        "start": 340.36,
        "duration": 4.509
    },
    {
        "text": "size p and one minus p, where p represents any number between zero and one.",
        "start": 344.869,
        "duration": 4.451
    },
    {
        "text": "Cutting the piece of size p in similar proportions, ",
        "start": 349.32,
        "duration": 3.729
    },
    {
        "text": "we now get pieces of size p times 1-p and p squared.",
        "start": 353.049,
        "duration": 3.731
    },
    {
        "text": "Continuing in this fashion, always cutting up the rightmost piece into those same ",
        "start": 359.22,
        "duration": 5.117
    },
    {
        "text": "proportions, you'll find that one minus p plus p times one minus p plus p squared ",
        "start": 364.337,
        "duration": 5.118
    },
    {
        "text": "times one minus p, on and on always adding p to the next power times one minus p, ",
        "start": 369.455,
        "duration": 5.118
    },
    {
        "text": "equals one.",
        "start": 374.573,
        "duration": 0.687
    },
    {
        "text": "Dividing both sides by 1-p, we get this nice formula.",
        "start": 376.2,
        "duration": 3.54
    },
    {
        "text": "In this formula, the universe has offered a weird form of nonsense.",
        "start": 383.98,
        "duration": 3.54
    },
    {
        "text": "Even though the way you discovered it only makes sense for values of p between 0 and 1, ",
        "start": 388.74,
        "duration": 4.545
    },
    {
        "text": "the right hand side still makes sense when you replace p with any other number, ",
        "start": 393.285,
        "duration": 4.133
    },
    {
        "text": "except maybe for 1.",
        "start": 397.418,
        "duration": 0.982
    },
    {
        "text": "For instance, plugging in negative one, the equation reads one minus one ",
        "start": 400.1,
        "duration": 5.736
    },
    {
        "text": "plus one minus one, on and on forever alternating between the two, ",
        "start": 405.836,
        "duration": 5.265
    },
    {
        "text": "equals one half, which feels pretty silly and kind of like the only thing it could be.",
        "start": 411.101,
        "duration": 6.759
    },
    {
        "text": "Plugging in two, the equation reads one plus two plus four plus eight, ",
        "start": 419.52,
        "duration": 4.792
    },
    {
        "text": "on and on to infinity, equals negative one, something which doesn't even seem reasonable.",
        "start": 424.312,
        "duration": 6.008
    },
    {
        "text": "On the one hand, Rigger would dictate that you ignore these, ",
        "start": 431.2,
        "duration": 2.887
    },
    {
        "text": "since the definition of infinite sums doesn't apply in these cases.",
        "start": 434.087,
        "duration": 3.173
    },
    {
        "text": "The list of numbers that you generate by cutting off ",
        "start": 437.74,
        "duration": 2.568
    },
    {
        "text": "the sum at finite points doesn't approach anything.",
        "start": 440.308,
        "duration": 2.472
    },
    {
        "text": "But you're a mathematician, not a robot, so you don't ",
        "start": 450.74,
        "duration": 2.964
    },
    {
        "text": "let the fact that something is nonsensical stop you.",
        "start": 453.704,
        "duration": 2.856
    },
    {
        "text": "I will leave this sum for another day, so that we can jump directly into this monster.",
        "start": 457.78,
        "duration": 4.54
    },
    {
        "text": "First, to clean things up, notice what you get when you cut off the sum at finite points.",
        "start": 463.36,
        "duration": 4.26
    },
    {
        "text": "One, three, seven, fifteen, thirty-one, they're all one less than a power of two.",
        "start": 468.22,
        "duration": 6.64
    },
    {
        "text": "In general, when you add up the first n powers of 2, ",
        "start": 475.68,
        "duration": 3.471
    },
    {
        "text": "you get 2 to the n plus 1 minus 1, which this animation hopefully makes clear.",
        "start": 479.151,
        "duration": 5.109
    },
    {
        "text": "You decide to humor the universe and pretend that these numbers, ",
        "start": 500.06,
        "duration": 3.592
    },
    {
        "text": "all 1 less than a power of 2, actually do approach negative 1.",
        "start": 503.652,
        "duration": 3.428
    },
    {
        "text": "It will prove to be cleaner if we add 1 to everything ",
        "start": 507.08,
        "duration": 3.435
    },
    {
        "text": "and say that the powers of 2 approach 0.",
        "start": 510.515,
        "duration": 2.544
    },
    {
        "text": "Is there any way that this can make sense?",
        "start": 515.299,
        "duration": 2.221
    },
    {
        "text": "In effect, what you're trying to do is make this formula more general, ",
        "start": 518.539,
        "duration": 3.738
    },
    {
        "text": "by saying that it applies to all numbers, not just those between 0 and 1.",
        "start": 522.277,
        "duration": 3.843
    },
    {
        "text": "Again, to make things more general, you look for ",
        "start": 526.8,
        "duration": 2.637
    },
    {
        "text": "any place where you made an arbitrary choice.",
        "start": 529.437,
        "duration": 2.423
    },
    {
        "text": "Here, that place turns out to be very sneaky, so sneaky in fact ",
        "start": 531.86,
        "duration": 4.063
    },
    {
        "text": "that it took mathematicians until the 20th century to find it.",
        "start": 535.923,
        "duration": 3.937
    },
    {
        "text": "It's the way that we define distance between two rational numbers.",
        "start": 541.44,
        "duration": 3.6
    },
    {
        "text": "That is to say, organizing them on a line might ",
        "start": 545.78,
        "duration": 3.11
    },
    {
        "text": "not be the only reasonable way to organize them.",
        "start": 548.89,
        "duration": 3.11
    },
    {
        "text": "The notion of distance is essentially a function that takes in ",
        "start": 555.46,
        "duration": 3.498
    },
    {
        "text": "two numbers and outputs a number indicating how far apart they are.",
        "start": 558.958,
        "duration": 3.722
    },
    {
        "text": "You could come up with a completely random notion of distance, ",
        "start": 564.26,
        "duration": 3.177
    },
    {
        "text": "where two is seven away from three, and one half is four fifths away from a hundred, ",
        "start": 567.437,
        "duration": 4.286
    },
    {
        "text": "and all sorts of things. But if you want to actually use a new distance function ",
        "start": 571.723,
        "duration": 4.085
    },
    {
        "text": "the way that you use the familiar distance function, ",
        "start": 575.808,
        "duration": 2.673
    },
    {
        "text": "it should share some of the same properties.",
        "start": 578.481,
        "duration": 2.219
    },
    {
        "text": "For example, the distance between two numbers shouldn't ",
        "start": 582.38,
        "duration": 2.72
    },
    {
        "text": "change if you shift them both by the same amount.",
        "start": 585.1,
        "duration": 2.38
    },
    {
        "text": "So zero and four should be the same distance away as one and five, or two and six, ",
        "start": 588.4,
        "duration": 5.065
    },
    {
        "text": "even if that same distance is something other than four as we're used to.",
        "start": 593.465,
        "duration": 4.455
    },
    {
        "text": "Keeping things general, the distance between two numbers ",
        "start": 599.12,
        "duration": 2.64
    },
    {
        "text": "shouldn't change if you add the same amount to both of them.",
        "start": 601.76,
        "duration": 2.78
    },
    {
        "text": "Let's call this property shift invariance.",
        "start": 605.04,
        "duration": 2.2
    },
    {
        "text": "There are other properties that you want your notion of distance to have as well, ",
        "start": 609.46,
        "duration": 4.931
    },
    {
        "text": "like the triangle inequality, but before we start worrying about those, ",
        "start": 614.391,
        "duration": 4.331
    },
    {
        "text": "let's start imagining what notion of distance could possibly make ",
        "start": 618.722,
        "duration": 3.969
    },
    {
        "text": "powers of two approach zero, and which is shift invariant.",
        "start": 622.691,
        "duration": 3.489
    },
    {
        "text": "At first you might toil for a while to find a frame of mind where this doesn't ",
        "start": 626.18,
        "duration": 4.501
    },
    {
        "text": "feel like utter nonsense, but with enough time and a bit of luck, ",
        "start": 630.681,
        "duration": 3.761
    },
    {
        "text": "you might think to organize your numbers into rooms, subrooms, sub-subrooms, and so on.",
        "start": 634.442,
        "duration": 4.958
    },
    {
        "text": "You think of zero as being in the same room as all of the powers of two greater than one. ",
        "start": 640.08,
        "duration": 5.751
    },
    {
        "text": "As being in the same sub-room as all powers of two greater than two. ",
        "start": 645.831,
        "duration": 4.409
    },
    {
        "text": "As being in the same sub-sub-room as powers of two greater than four, ",
        "start": 650.24,
        "duration": 4.473
    },
    {
        "text": "and so on, with infinitely many smaller and smaller rooms.",
        "start": 654.713,
        "duration": 3.707
    },
    {
        "text": "It's pretty hard to draw infinitely many things, so I'm only going to draw 4 room sizes, ",
        "start": 659.86,
        "duration": 4.28
    },
    {
        "text": "but keep in the back of your mind that this process should be able to go on forever.",
        "start": 664.14,
        "duration": 4.04
    },
    {
        "text": "If we think of every number as lying in a hierarchy of rooms, not just 0, ",
        "start": 669.62,
        "duration": 4.173
    },
    {
        "text": "shift invariance will tell us where all of the numbers must fall.",
        "start": 673.793,
        "duration": 3.667
    },
    {
        "text": "For instance, one should be as far away from three as two is from zero.",
        "start": 678.22,
        "duration": 4.06
    },
    {
        "text": "Likewise, the distance between zero and four should be the same ",
        "start": 684.12,
        "duration": 3.446
    },
    {
        "text": "as that between one and five, two and six, and three and seven.",
        "start": 687.566,
        "duration": 3.394
    },
    {
        "text": "Continuing like this, you'll see which rooms, sub-rooms, ",
        "start": 692.24,
        "duration": 3.575
    },
    {
        "text": "sub-sub-rooms, and so on, successive numbers must fall into.",
        "start": 695.815,
        "duration": 3.765
    },
    {
        "text": "You can also deduce where negative numbers must fall.",
        "start": 703.54,
        "duration": 3.36
    },
    {
        "text": "For example, negative one has to be in the same room as one, ",
        "start": 707.32,
        "duration": 4.187
    },
    {
        "text": "in the same sub-room as three, the same sub-sub-room as seven, and so on, ",
        "start": 711.507,
        "duration": 5.081
    },
    {
        "text": "always in smaller and smaller rooms with numbers one less than a power of two, ",
        "start": 716.588,
        "duration": 5.423
    },
    {
        "text": "because zero is in smaller and smaller rooms with the powers of two.",
        "start": 722.011,
        "duration": 4.669
    },
    {
        "text": "So, how do you turn this general idea of closeness based ",
        "start": 727.74,
        "duration": 3.359
    },
    {
        "text": "on rooms and sub-rooms into an actual distance function?",
        "start": 731.099,
        "duration": 3.301
    },
    {
        "text": "You can't take this drawing too literally, since it makes one look ",
        "start": 735.36,
        "duration": 3.2
    },
    {
        "text": "very close to fourteen and zero very far from thirteen, ",
        "start": 738.56,
        "duration": 2.674
    },
    {
        "text": "even though shift invariance should imply that they're the same distance away.",
        "start": 741.234,
        "duration": 3.726
    },
    {
        "text": "Again, in the actual process of discovery, you might toil away, ",
        "start": 746.54,
        "duration": 3.285
    },
    {
        "text": "scribbling through many sheets of paper, but if you have the idea that the ",
        "start": 749.825,
        "duration": 3.85
    },
    {
        "text": "only thing which should matter in determining the distance between two ",
        "start": 753.675,
        "duration": 3.645
    },
    {
        "text": "objects is the size of the smallest room they share, you might come up with the following.",
        "start": 757.32,
        "duration": 4.62
    },
    {
        "text": "Any numbers lying in different large yellow rooms are a distance 1 from each other.",
        "start": 763.24,
        "duration": 4.98
    },
    {
        "text": "Those which are in the same large room, but not in the ",
        "start": 770.54,
        "duration": 3.713
    },
    {
        "text": "same orange sub-room are a distance ½ from each other.",
        "start": 774.253,
        "duration": 3.647
    },
    {
        "text": "And those that are in the same orange sub-room, ",
        "start": 779.56,
        "duration": 3.368
    },
    {
        "text": "but not in the same sub-sub-room are a distance ¼ from each other.",
        "start": 782.928,
        "duration": 4.632
    },
    {
        "text": "And you continue like this, using the reciprocals of ",
        "start": 789.94,
        "duration": 2.947
    },
    {
        "text": "larger and larger powers of 2 to indicate closeness.",
        "start": 792.887,
        "duration": 2.893
    },
    {
        "text": "We won't do it in this video, but see if you can reason about which ",
        "start": 797.62,
        "duration": 3.754
    },
    {
        "text": "rooms other rational numbers like one third and one half should fall into,",
        "start": 801.374,
        "duration": 4.086
    },
    {
        "text": "And see if you can prove why this notion of distance satisfies many of the nice ",
        "start": 806.12,
        "duration": 4.174
    },
    {
        "text": "properties we expect from a distance function, like the triangle inequality.",
        "start": 810.294,
        "duration": 3.966
    },
    {
        "text": "Here, I'll just say that this notion of distance is a perfectly legitimate one, ",
        "start": 815.96,
        "duration": 4.146
    },
    {
        "text": "we call it the 2-adic metric, and it falls into a general family of distance ",
        "start": 820.106,
        "duration": 3.99
    },
    {
        "text": "functions called the p-adic metrics, where p stands for any prime number.",
        "start": 824.096,
        "duration": 3.784
    },
    {
        "text": "These metrics give rise to a completely new type of number, ",
        "start": 828.68,
        "duration": 3.138
    },
    {
        "text": "neither real nor complex, and have become a central notion in modern number theory.",
        "start": 831.818,
        "duration": 4.342
    },
    {
        "text": "Using the 2-adic metric, the fact that the sum of all powers ",
        "start": 838.54,
        "duration": 4.104
    },
    {
        "text": "of 2 equals negative 1 actually makes sense, because the numbers 1, ",
        "start": 842.644,
        "duration": 4.575
    },
    {
        "text": "3, 7, 15, 31, and so on, genuinely approach negative 1.",
        "start": 847.219,
        "duration": 3.701
    },
    {
        "text": "This parable does not actually portray the historical trajectory of discoveries, ",
        "start": 852.44,
        "duration": 3.997
    },
    {
        "text": "but nevertheless, I still think it's a good illustration of a ",
        "start": 856.437,
        "duration": 3.06
    },
    {
        "text": "recurring pattern in the discovery of math.",
        "start": 859.497,
        "duration": 2.123
    },
    {
        "text": "First, nature hands you something that's ill-defined or even nonsensical.",
        "start": 862.32,
        "duration": 4.18
    },
    {
        "text": "Then you define new concepts that make this fuzzy discovery make sense, ",
        "start": 867.48,
        "duration": 3.805
    },
    {
        "text": "and these new concepts tend to yield genuinely useful math and broaden your mind about ",
        "start": 871.285,
        "duration": 4.598
    },
    {
        "text": "traditional notions.",
        "start": 875.883,
        "duration": 1.057
    },
    {
        "text": "So, in answer to the age-old question of whether math is invention or discovery, ",
        "start": 877.58,
        "duration": 4.207
    },
    {
        "text": "my personal belief is that discovery of non-rigorous truths is what ",
        "start": 881.787,
        "duration": 3.532
    },
    {
        "text": "leads us to the construction of rigorous terms that are useful, ",
        "start": 885.319,
        "duration": 3.324
    },
    {
        "text": "opening the door for more fuzzy discoveries continuing the cycle.",
        "start": 888.643,
        "duration": 3.377
    }
]