[
    {
        "text": "This is a very famous cautionary tale in math, known as Moser's circle problem.",
        "start": 0.0,
        "duration": 4.26
    },
    {
        "text": "Some of you may have seen this before, but what I ",
        "start": 4.78,
        "duration": 2.15
    },
    {
        "text": "want to do here is really explain what's going on.",
        "start": 6.93,
        "duration": 2.15
    },
    {
        "text": "The way this starts is we take a circle and put two points on that ",
        "start": 9.74,
        "duration": 3.492
    },
    {
        "text": "circle and connect them with a line, that is a chord of the circle, ",
        "start": 13.232,
        "duration": 3.544
    },
    {
        "text": "and note that it divides the circle into two different regions.",
        "start": 16.776,
        "duration": 3.284
    },
    {
        "text": "If I add a third point and then connect that to the previous two points with two ",
        "start": 20.66,
        "duration": 4.353
    },
    {
        "text": "more chords, then these lines all divide the circle into four separate regions.",
        "start": 25.013,
        "duration": 4.247
    },
    {
        "text": "Then if you add a fourth point and connect that to the previous three, ",
        "start": 29.26,
        "duration": 3.797
    },
    {
        "text": "and you play the same game, you count up how many regions has this cut the circle into, ",
        "start": 33.057,
        "duration": 4.706
    },
    {
        "text": "you end up with eight.",
        "start": 37.763,
        "duration": 1.177
    },
    {
        "text": "Add a fifth point to the circle, connect it to the previous four, ",
        "start": 39.54,
        "duration": 3.225
    },
    {
        "text": "count up the total number of regions, and if you're careful with your counting, ",
        "start": 42.765,
        "duration": 3.909
    },
    {
        "text": "you'll get a total of sixteen.",
        "start": 46.674,
        "duration": 1.466
    },
    {
        "text": "Naturally, you can guess what might come next, but would you bet your life on it?",
        "start": 48.96,
        "duration": 3.32
    },
    {
        "text": "Add a sixth point, connect it to all the previous ones, ",
        "start": 52.54,
        "duration": 2.862
    },
    {
        "text": "and if you carefully count up all the different regions, ",
        "start": 55.402,
        "duration": 2.913
    },
    {
        "text": "you end up not with the power of two you might have expected, but just one shy of it.",
        "start": 58.315,
        "duration": 4.345
    },
    {
        "text": "Some of you might be raising your hand saying, ",
        "start": 64.04,
        "duration": 2.002
    },
    {
        "text": "doesn't it depend on where we put the points?",
        "start": 66.042,
        "duration": 1.918
    },
    {
        "text": "For example, watch how this middle region disappears if I ",
        "start": 68.86,
        "duration": 2.619
    },
    {
        "text": "place everything nice and symmetrically around the circle.",
        "start": 71.479,
        "duration": 2.621
    },
    {
        "text": "So yes, it does depend, but we're going to consider the cases ",
        "start": 74.32,
        "duration": 2.896
    },
    {
        "text": "where you never have any three lines intersecting with each other.",
        "start": 77.216,
        "duration": 3.084
    },
    {
        "text": "This would be the generic case if you just choose n random points, ",
        "start": 80.54,
        "duration": 3.274
    },
    {
        "text": "almost certainly you'll never have three lines coincide, ",
        "start": 83.814,
        "duration": 2.786
    },
    {
        "text": "but setting aside the technical nuances, the problem is such a tease, ",
        "start": 86.6,
        "duration": 3.421
    },
    {
        "text": "it looks so convincingly like powers of two until it just barely breaks.",
        "start": 90.021,
        "duration": 3.519
    },
    {
        "text": "And I have such a strange soft spot for this particular question.",
        "start": 93.92,
        "duration": 3.16
    },
    {
        "text": "When I was younger I wrote a poem about it and also a song.",
        "start": 97.36,
        "duration": 2.92
    },
    {
        "text": "And on the one hand it's kind of silly, because this is just one example of what ",
        "start": 100.74,
        "duration": 3.677
    },
    {
        "text": "the mathematician Richard Guy called the strong law of small numbers, ",
        "start": 104.417,
        "duration": 3.178
    },
    {
        "text": "summed up in the phrase, there aren't enough small numbers to meet the many demands ",
        "start": 107.595,
        "duration": 3.814
    },
    {
        "text": "made of them.",
        "start": 111.409,
        "duration": 0.591
    },
    {
        "text": "But I think what I really like about this problem is that if you sit down to try ",
        "start": 112.8,
        "duration": 3.945
    },
    {
        "text": "to work out what is the real pattern, what's actually going on here, one, ",
        "start": 116.745,
        "duration": 3.605
    },
    {
        "text": "it's just a really good exercise in problem solving, ",
        "start": 120.35,
        "duration": 2.582
    },
    {
        "text": "so it makes for a nice lesson right here, but also it's not just a coincidence ",
        "start": 122.932,
        "duration": 3.848
    },
    {
        "text": "that it starts off being powers of two.",
        "start": 126.78,
        "duration": 1.9
    },
    {
        "text": "There's a very good reason this happens.",
        "start": 129.039,
        "duration": 1.581
    },
    {
        "text": "And it's also not a coincidence that you seemingly randomly hit ",
        "start": 131.1,
        "duration": 2.932
    },
    {
        "text": "another power of two a little bit later on the tenth iteration.",
        "start": 134.032,
        "duration": 2.888
    },
    {
        "text": "So we've got this pattern, and what you want to find is what function describes it.",
        "start": 142.1,
        "duration": 4.2
    },
    {
        "text": "If you put n points on the boundary of a circle, ",
        "start": 146.54,
        "duration": 2.412
    },
    {
        "text": "and you connect them with all the possible chords, ",
        "start": 148.952,
        "duration": 2.511
    },
    {
        "text": "and you count how many regions the circle has been cut into, ",
        "start": 151.463,
        "duration": 3.003
    },
    {
        "text": "if the answer isn't a power of two, what is it?",
        "start": 154.466,
        "duration": 2.314
    },
    {
        "text": "What function of n should we plug in?",
        "start": 156.98,
        "duration": 1.68
    },
    {
        "text": "As always with math, problem solving rule number one if you're stuck is ",
        "start": 159.34,
        "duration": 3.927
    },
    {
        "text": "to try solving easier questions somehow related to the problem at hand.",
        "start": 163.267,
        "duration": 3.873
    },
    {
        "text": "It helps you get a foothold, and sometimes those ",
        "start": 167.48,
        "duration": 2.035
    },
    {
        "text": "answers are helpful in the final question.",
        "start": 169.515,
        "duration": 1.745
    },
    {
        "text": "In this case, two warm-up questions that come to mind are, ",
        "start": 171.72,
        "duration": 3.102
    },
    {
        "text": "how many total chords are there in this diagram, ",
        "start": 174.822,
        "duration": 2.576
    },
    {
        "text": "and at how many points within the circle do those chords intersect each other?",
        "start": 177.398,
        "duration": 4.102
    },
    {
        "text": "The first question is relatively friendly.",
        "start": 182.2,
        "duration": 1.74
    },
    {
        "text": "Every one of those chords corresponds uniquely with a pair of points on the circle.",
        "start": 184.42,
        "duration": 4.42
    },
    {
        "text": "So effectively what you want to do is count how many distinct pairs of points are there.",
        "start": 189.64,
        "duration": 4.16
    },
    {
        "text": "There's a function that does this, it's called n choose two.",
        "start": 194.3,
        "duration": 2.68
    },
    {
        "text": "By definition, this counts the number of distinct pairs that ",
        "start": 197.42,
        "duration": 3.35
    },
    {
        "text": "you can choose from a set of n items, where order doesn't matter.",
        "start": 200.77,
        "duration": 3.57
    },
    {
        "text": "To calculate it, the way you often think about it is that you have n choices ",
        "start": 205.0,
        "duration": 4.203
    },
    {
        "text": "for what your first item should be, and then you have n minus one options for ",
        "start": 209.203,
        "duration": 4.257
    },
    {
        "text": "what that second item should be, but simply multiplying those would over count, ",
        "start": 213.46,
        "duration": 4.367
    },
    {
        "text": "since for a given pair you would have two distinct ways to arrive at that pair.",
        "start": 217.827,
        "duration": 4.313
    },
    {
        "text": "And remember, we don't care about order.",
        "start": 222.68,
        "duration": 1.48
    },
    {
        "text": "To account for this, you divide by two.",
        "start": 224.74,
        "duration": 1.68
    },
    {
        "text": "So for example, seven choose two would look like seven times six divided by two, ",
        "start": 226.42,
        "duration": 4.838
    },
    {
        "text": "which is seven times three, or twenty-one, and if you count up the number ",
        "start": 231.258,
        "duration": 4.42
    },
    {
        "text": "of distinct pairs of seven items, there are indeed twenty-one of them.",
        "start": 235.678,
        "duration": 4.182
    },
    {
        "text": "Counting the number of intersection points in the diagram is a little bit trickier.",
        "start": 241.4,
        "duration": 3.54
    },
    {
        "text": "One idea might be that it should be the number of pairs of chords, ",
        "start": 245.34,
        "duration": 3.669
    },
    {
        "text": "since every intersection point comes from two different chords.",
        "start": 249.009,
        "duration": 3.451
    },
    {
        "text": "However, that would not quite be right, because the association is not unique.",
        "start": 253.02,
        "duration": 3.68
    },
    {
        "text": "You can find a pair of chords that don't intersect within the circle.",
        "start": 257.1,
        "duration": 3.16
    },
    {
        "text": "As I said, it's a little bit tricky.",
        "start": 260.98,
        "duration": 1.26
    },
    {
        "text": "I'd encourage you to try to pause and think about it for yourself, ",
        "start": 262.56,
        "duration": 3.114
    },
    {
        "text": "and if you do that, you give yourself a moment, ",
        "start": 265.674,
        "duration": 2.231
    },
    {
        "text": "maybe if you're a little bit lucky, here's one thing you might notice.",
        "start": 267.905,
        "duration": 3.255
    },
    {
        "text": "Every intersection point is uniquely associated ",
        "start": 271.9,
        "duration": 2.619
    },
    {
        "text": "with a quadruplet of points on the exterior.",
        "start": 274.519,
        "duration": 2.401
    },
    {
        "text": "For a given quadruplet, you look at the two kind of diagonal chords between them, ",
        "start": 277.72,
        "duration": 3.795
    },
    {
        "text": "and those will intersect within the circle, and it goes the other way around.",
        "start": 281.515,
        "duration": 3.565
    },
    {
        "text": "Every intersection point corresponds with some quadruplet of points.",
        "start": 285.38,
        "duration": 3.36
    },
    {
        "text": "So, what you want now is to count how many distinct ",
        "start": 290.66,
        "duration": 3.367
    },
    {
        "text": "ways can you choose four items given n total choices.",
        "start": 294.027,
        "duration": 3.433
    },
    {
        "text": "This is very similar to the previous question.",
        "start": 298.24,
        "duration": 2.14
    },
    {
        "text": "The function that answers it is called n choose four, ",
        "start": 300.76,
        "duration": 2.91
    },
    {
        "text": "which by definition counts the number of quadruplets from a set of size n, ",
        "start": 303.67,
        "duration": 4.042
    },
    {
        "text": "and the way to calculate it is similar to what we saw before.",
        "start": 307.712,
        "duration": 3.288
    },
    {
        "text": "You would think of having n choices for your first item, ",
        "start": 311.0,
        "duration": 3.18
    },
    {
        "text": "leaving you with n minus one choices for the next item, ",
        "start": 314.18,
        "duration": 3.124
    },
    {
        "text": "leaving you with n minus two choices for the third item, ",
        "start": 317.304,
        "duration": 3.181
    },
    {
        "text": "and n minus three choices for the last item.",
        "start": 320.485,
        "duration": 2.455
    },
    {
        "text": "That, however, would grossly overcount the total number, ",
        "start": 323.8,
        "duration": 2.861
    },
    {
        "text": "since all the different ways you can permute these four items would be counted separately.",
        "start": 326.661,
        "duration": 4.519
    },
    {
        "text": "To account for that, you divide out by the extent to which you've overcounted, ",
        "start": 331.64,
        "duration": 3.965
    },
    {
        "text": "the number of permutations of four items, which looks like four factorial.",
        "start": 335.605,
        "duration": 3.715
    },
    {
        "text": "For example, if you calculate four choose four, everything cancels and you just get one, ",
        "start": 340.12,
        "duration": 5.246
    },
    {
        "text": "and indeed there is a single intersection point in this diagram.",
        "start": 345.366,
        "duration": 3.774
    },
    {
        "text": "If you calculate six choose four, it works out to be 15, ",
        "start": 349.8,
        "duration": 3.332
    },
    {
        "text": "and if you look at this diagram and you count them all up, ",
        "start": 353.132,
        "duration": 3.45
    },
    {
        "text": "you would notice there are indeed 15 different intersection points.",
        "start": 356.582,
        "duration": 3.918
    },
    {
        "text": "And even if you would never want to count it up by hand, ",
        "start": 361.32,
        "duration": 3.059
    },
    {
        "text": "if we had a diagram that has 100 distinct points on the exterior, ",
        "start": 364.379,
        "duration": 3.543
    },
    {
        "text": "and we drew all of the connecting lines, you can conclude that there have ",
        "start": 367.922,
        "duration": 3.972
    },
    {
        "text": "to be 100 choose four, or just about four million intersection points ",
        "start": 371.894,
        "duration": 3.757
    },
    {
        "text": "somewhere in the middle.",
        "start": 375.651,
        "duration": 1.289
    },
    {
        "text": "You've probably guessed this, but these are more than just warm-up questions.",
        "start": 377.84,
        "duration": 3.04
    },
    {
        "text": "They give us the necessary information to answer the question we care about.",
        "start": 381.14,
        "duration": 3.46
    },
    {
        "text": "How many regions has the circle been cut into?",
        "start": 384.74,
        "duration": 2.24
    },
    {
        "text": "The trick is to use a very nice little fact about planar graphs.",
        "start": 387.4,
        "duration": 3.22
    },
    {
        "text": "Here I'm using the word graph in the sense of a diagram that has nodes ",
        "start": 391.08,
        "duration": 3.474
    },
    {
        "text": "and lines connecting them, and what it means to be planar is that you ",
        "start": 394.554,
        "duration": 3.426
    },
    {
        "text": "can draw this diagram without any of the lines intersecting with each other.",
        "start": 397.98,
        "duration": 3.72
    },
    {
        "text": "In graph theory lingo, you typically call those nodes vertices and the lines connecting ",
        "start": 402.28,
        "duration": 4.667
    },
    {
        "text": "them edges, and the wonderful fact that we can leverage is that if you count up the ",
        "start": 406.947,
        "duration": 4.456
    },
    {
        "text": "number of vertices, and then you subtract the total number of edges, ",
        "start": 411.403,
        "duration": 3.659
    },
    {
        "text": "and then you consider the number of regions that this graph has cut the plane into, ",
        "start": 415.062,
        "duration": 4.456
    },
    {
        "text": "including that infinite outer region, then always, ",
        "start": 419.518,
        "duration": 2.705
    },
    {
        "text": "no matter what planar graph you started with, you get two.",
        "start": 422.223,
        "duration": 3.077
    },
    {
        "text": "It's actually very fun.",
        "start": 425.84,
        "duration": 0.96
    },
    {
        "text": "Try this for yourself.",
        "start": 427.0,
        "duration": 0.78
    },
    {
        "text": "Draw any graph, make sure the lines don't intersect, ",
        "start": 428.12,
        "duration": 2.862
    },
    {
        "text": "and then count the number of vertices, subtract the number of edges, ",
        "start": 430.982,
        "duration": 3.725
    },
    {
        "text": "and count the number of regions that it's cut the plane into, ",
        "start": 434.707,
        "duration": 3.349
    },
    {
        "text": "and no matter what diagram you chose, the answer always works out to be two.",
        "start": 438.056,
        "duration": 4.104
    },
    {
        "text": "More commonly you would see this written as v minus e plus f is equal to two, ",
        "start": 443.18,
        "duration": 4.505
    },
    {
        "text": "since originally the equation described the vertices edges and faces of three-dimensional ",
        "start": 447.685,
        "duration": 5.199
    },
    {
        "text": "polyhedra, and if you want to know why this magical fact is true, ",
        "start": 452.884,
        "duration": 3.812
    },
    {
        "text": "you can think about building up your graph from a trivial case, ",
        "start": 456.696,
        "duration": 3.697
    },
    {
        "text": "where you have a single node and no edges.",
        "start": 460.393,
        "duration": 2.427
    },
    {
        "text": "So v would be equal to one, f would also be equal to one because of that ",
        "start": 463.46,
        "duration": 4.279
    },
    {
        "text": "infinite outer region, and e is zero, so the equation is obviously true.",
        "start": 467.739,
        "duration": 4.221
    },
    {
        "text": "Then if you build up your graph one edge at a time, ",
        "start": 472.6,
        "duration": 2.533
    },
    {
        "text": "one thing that could happen is that for each new edge you introduce a new vertex.",
        "start": 475.133,
        "duration": 3.947
    },
    {
        "text": "So e goes up by one, but v also goes up by one, leaving the equation balanced.",
        "start": 479.78,
        "duration": 5.0
    },
    {
        "text": "But if a new edge doesn't correspond to a new vertex, ",
        "start": 485.5,
        "duration": 3.139
    },
    {
        "text": "meaning it's connecting to a pre-existing vertex, ",
        "start": 488.639,
        "duration": 2.906
    },
    {
        "text": "that means that it's enclosed a new region of space, so e goes up by one, ",
        "start": 491.545,
        "duration": 4.302
    },
    {
        "text": "but f also goes up by one, which again leaves the equation balanced.",
        "start": 495.847,
        "duration": 3.953
    },
    {
        "text": "So as you build up some potentially complicated graph, ",
        "start": 500.92,
        "duration": 3.49
    },
    {
        "text": "v minus e plus f always stays fixed at two.",
        "start": 504.41,
        "duration": 2.73
    },
    {
        "text": "This equation has a name, it's called Euler's characteristic formula, ",
        "start": 507.6,
        "duration": 3.304
    },
    {
        "text": "and I remember when I made a video about this a while ago, ",
        "start": 510.904,
        "duration": 2.786
    },
    {
        "text": "I had some dumb joke in there about Euler's being German for beautiful, ",
        "start": 513.69,
        "duration": 3.399
    },
    {
        "text": "and there were a decent number of comments that were like, you know, ",
        "start": 517.089,
        "duration": 3.257
    },
    {
        "text": "Euler is actually a person, I speak German, and it doesn't mean beautiful.",
        "start": 520.346,
        "duration": 3.494
    },
    {
        "text": "Anyway, for our purposes, it gives us a tool for counting ",
        "start": 524.58,
        "duration": 3.246
    },
    {
        "text": "the number of regions that a planar graph has cut space into.",
        "start": 527.826,
        "duration": 3.414
    },
    {
        "text": "Rearranging a little, you would take the number ",
        "start": 531.72,
        "duration": 2.435
    },
    {
        "text": "of edges minus the number of vertices plus two.",
        "start": 534.155,
        "duration": 2.385
    },
    {
        "text": "This is exactly the tool that we want to understand our circle question, ",
        "start": 537.02,
        "duration": 3.821
    },
    {
        "text": "although in that case we don't care about the infinite outer region, ",
        "start": 540.841,
        "duration": 3.613
    },
    {
        "text": "so instead I'll write this as e minus v plus one.",
        "start": 544.454,
        "duration": 2.566
    },
    {
        "text": "And at first you might complain, but we can't use Euler's formula in this case, ",
        "start": 547.82,
        "duration": 3.978
    },
    {
        "text": "because it only applies to planar graphs, and in our case the ",
        "start": 551.798,
        "duration": 3.083
    },
    {
        "text": "lines absolutely intersect with each other.",
        "start": 554.881,
        "duration": 2.139
    },
    {
        "text": "We even counted how many times they intersect with each other.",
        "start": 557.2,
        "duration": 2.52
    },
    {
        "text": "But the key is to treat this as a new graph, where those intersection ",
        "start": 560.24,
        "duration": 3.902
    },
    {
        "text": "points are themselves vertices, so the total number of vertices here would not be n, ",
        "start": 564.142,
        "duration": 4.739
    },
    {
        "text": "but n plus the n choose 4 total intersection points.",
        "start": 568.881,
        "duration": 2.899
    },
    {
        "text": "That in turn chops up all of our chords into a larger number of edges, ",
        "start": 572.06,
        "duration": 3.755
    },
    {
        "text": "it's much more than just n choose 2, and initially it might seem really annoying and ",
        "start": 575.815,
        "duration": 4.495
    },
    {
        "text": "tricky to think about exactly how much it's chopped them up, ",
        "start": 580.31,
        "duration": 3.226
    },
    {
        "text": "but one way you can think about it is that every intersection point takes what started as ",
        "start": 583.536,
        "duration": 4.76
    },
    {
        "text": "two separate lines and then turns it into four lines.",
        "start": 588.296,
        "duration": 2.804
    },
    {
        "text": "So in effect, each intersection point adds two more edges.",
        "start": 591.1,
        "duration": 4.44
    },
    {
        "text": "For example, look at this simple diagram where ",
        "start": 596.62,
        "duration": 2.345
    },
    {
        "text": "we have three lines and two intersection points.",
        "start": 598.965,
        "duration": 2.395
    },
    {
        "text": "The total number of edges after the chopping would look like three plus two times two, ",
        "start": 602.02,
        "duration": 5.038
    },
    {
        "text": "or seven.",
        "start": 607.058,
        "duration": 0.522
    },
    {
        "text": "If you had four lines that intersected at three separate points, ",
        "start": 608.06,
        "duration": 3.994
    },
    {
        "text": "then the total number of little lines after chopping would be 4 plus 2 times 3, or 10.",
        "start": 612.054,
        "duration": 5.286
    },
    {
        "text": "And for the diagram we care about where we started off with n choose two ",
        "start": 617.34,
        "duration": 4.098
    },
    {
        "text": "separate lines and they're getting chopped up at n choose four points in the middle, ",
        "start": 621.438,
        "duration": 4.772
    },
    {
        "text": "you would end up with n choose two plus two times n choose four edges.",
        "start": 626.21,
        "duration": 3.93
    },
    {
        "text": "And actually there are a few more than that, because we're including the circle, ",
        "start": 630.68,
        "duration": 3.891
    },
    {
        "text": "we also need to count the n different arcs that sit on the outside of this diagram.",
        "start": 634.571,
        "duration": 3.989
    },
    {
        "text": "So with all of that you have the information you need to answer the original question. ",
        "start": 639.34,
        "duration": 4.483
    },
    {
        "text": "Pulling up our variant of Euler's formula that counts the number of regions we'll plug ",
        "start": 643.823,
        "duration": 4.483
    },
    {
        "text": "in the expression for the number of vertices which is n plus the n choose four ",
        "start": 648.306,
        "duration": 4.071
    },
    {
        "text": "intersection points, and you also plug in the slightly larger expression for the new ",
        "start": 652.377,
        "duration": 4.38
    },
    {
        "text": "number of edges n choose two plus two times n choose four plus n, ",
        "start": 656.757,
        "duration": 3.401
    },
    {
        "text": "and the expression has a lot of nice cancellation, ",
        "start": 660.158,
        "duration": 2.628
    },
    {
        "text": "for example you are adding an n but also subtracting an n and you're adding two copies ",
        "start": 662.786,
        "duration": 4.483
    },
    {
        "text": "of n choose four but subtracting another copy of n choose four and when all the dust ",
        "start": 667.269,
        "duration": 4.38
    },
    {
        "text": "settles the answer to the question is one plus n choose two plus n choose four.",
        "start": 671.649,
        "duration": 4.071
    },
    {
        "text": "On the one hand, you're done, you answered the question.",
        "start": 676.32,
        "duration": 3.06
    },
    {
        "text": "I give you one of these circle diagrams with n points on the boundary, ",
        "start": 679.94,
        "duration": 3.518
    },
    {
        "text": "and using this formula you can figure out how many regions the circle has been cut into.",
        "start": 683.458,
        "duration": 4.362
    },
    {
        "text": "But of course we're not really done, because that doesn't scratch the itch.",
        "start": 688.58,
        "duration": 2.62
    },
    {
        "text": "Why is it the case that this looks like powers of 2 and then falls short by just 1?",
        "start": 691.62,
        "duration": 4.56
    },
    {
        "text": "It's not just a coincidence, and the key to answering it is to consider Pascal's triangle.",
        "start": 696.6,
        "duration": 4.4
    },
    {
        "text": "You know this triangle, it's the one where each term looks ",
        "start": 701.7,
        "duration": 2.679
    },
    {
        "text": "like a sum of the two different terms above it, ",
        "start": 704.379,
        "duration": 2.18
    },
    {
        "text": "and there are basically two facts we need to bring in about this triangle.",
        "start": 706.559,
        "duration": 3.361
    },
    {
        "text": "The first is that every term inside this triangle ",
        "start": 710.52,
        "duration": 3.316
    },
    {
        "text": "looks like n choose k for some value of n and k.",
        "start": 713.836,
        "duration": 3.184
    },
    {
        "text": "That is, the answer to the question of how many ways can you select a ",
        "start": 717.64,
        "duration": 4.23
    },
    {
        "text": "subset of size k from a set of size n is visible within this triangle.",
        "start": 721.87,
        "duration": 4.23
    },
    {
        "text": "The way to think about it is by indexing the rows and columns starting from 0.",
        "start": 726.62,
        "duration": 3.48
    },
    {
        "text": "For example, if you count up to the 0, 1, 2, 3, 4, 5th row, ",
        "start": 730.54,
        "duration": 4.545
    },
    {
        "text": "you count in to the 0, 1, 2, 3rd element, you see 10.",
        "start": 735.085,
        "duration": 4.015
    },
    {
        "text": "And indeed, 5 choose 3 is equal to 10.",
        "start": 739.64,
        "duration": 2.4
    },
    {
        "text": "If you've never seen this before and you want to know why it's true, ",
        "start": 742.86,
        "duration": 2.995
    },
    {
        "text": "there's a really lovely argument, I'll leave it up as an exercise.",
        "start": 745.855,
        "duration": 2.865
    },
    {
        "text": "But moving on to the second thing that we need to know, ",
        "start": 749.32,
        "duration": 2.638
    },
    {
        "text": "notice what happens when you add up the rows of this triangle.",
        "start": 751.958,
        "duration": 2.922
    },
    {
        "text": "You get 1, and then 1 plus 1 is 2, 1 plus 2 plus 1 is 4, ",
        "start": 755.54,
        "duration": 4.102
    },
    {
        "text": "1 plus 3 plus 3 plus 1 is 8, and as you continue on, you always get powers of 2.",
        "start": 759.642,
        "duration": 5.758
    },
    {
        "text": "Maybe at this point you're a little gun-shy about jumping to conclusions about powers of ",
        "start": 766.18,
        "duration": 3.98
    },
    {
        "text": "2 too quickly, but in this case it's a genuine pattern, there's no trickery being pulled.",
        "start": 770.16,
        "duration": 3.98
    },
    {
        "text": "And there are a few ways that you can think about why there should be powers of 2 here.",
        "start": 774.56,
        "duration": 3.94
    },
    {
        "text": "But one that I like is to think about how as you go from that first row to the next one, ",
        "start": 779.08,
        "duration": 4.528
    },
    {
        "text": "it's like the number 1 is sort of donating two copies of itself into the next row.",
        "start": 783.608,
        "duration": 4.172
    },
    {
        "text": "Likewise, as you go from the second row to the third, ",
        "start": 788.58,
        "duration": 2.973
    },
    {
        "text": "each of those 1s is donating two copies of itself to the next row, and in general, ",
        "start": 791.553,
        "duration": 4.57
    },
    {
        "text": "as you go from one row to the next, each number donates two copies of itself ",
        "start": 796.123,
        "duration": 4.24
    },
    {
        "text": "to the one below.",
        "start": 800.363,
        "duration": 0.937
    },
    {
        "text": "So as you add up the totals for each of these rows, ",
        "start": 801.92,
        "duration": 2.667
    },
    {
        "text": "it stands to reason that those totals double on each iteration.",
        "start": 804.587,
        "duration": 3.233
    },
    {
        "text": "Circling back to our original question, think about what this means.",
        "start": 808.86,
        "duration": 3.22
    },
    {
        "text": "The answer to our question looked like 1 plus n choose 2 plus n choose 4.",
        "start": 812.7,
        "duration": 4.62
    },
    {
        "text": "In the context of Pascal's triangle, you could think about that as adding up the 0th, ",
        "start": 817.32,
        "duration": 5.396
    },
    {
        "text": "2nd, and 4th terms inside some row of that triangle.",
        "start": 822.716,
        "duration": 3.264
    },
    {
        "text": "For instance, when n is equal to 5, it looks like adding up 1 plus 10 plus 5.",
        "start": 826.8,
        "duration": 4.32
    },
    {
        "text": "Now, because each of those numbers is the sum of the two above it, ",
        "start": 831.7,
        "duration": 3.897
    },
    {
        "text": "this is the same thing as adding up the first 5 elements in the previous row, ",
        "start": 835.597,
        "duration": 4.538
    },
    {
        "text": "which in this case is adding up the entire previous row, hence why it's a power of 2.",
        "start": 840.135,
        "duration": 4.945
    },
    {
        "text": "Same deal for all the numbers that are 5 or less.",
        "start": 845.08,
        "duration": 2.64
    },
    {
        "text": "When you situate this formula inside Pascal's triangle, ",
        "start": 848.16,
        "duration": 2.89
    },
    {
        "text": "and you relate it to the previous row, what you're doing is adding up the entirety ",
        "start": 851.05,
        "duration": 4.285
    },
    {
        "text": "of that previous row.",
        "start": 855.335,
        "duration": 1.085
    },
    {
        "text": "The point at which this breaks is for n equals 6, because in that case, ",
        "start": 857.32,
        "duration": 3.747
    },
    {
        "text": "when you relate this to the previous row, adding up the first 5 elements of that row, ",
        "start": 861.067,
        "duration": 4.475
    },
    {
        "text": "it doesn't cover the whole thing.",
        "start": 865.542,
        "duration": 1.718
    },
    {
        "text": "It falls short specifically by just 1, which is why we miss the power of 2, ",
        "start": 867.52,
        "duration": 4.634
    },
    {
        "text": "and why it falls short specifically by just 1.",
        "start": 872.154,
        "duration": 2.806
    },
    {
        "text": "Also, notice what happens when we plug in n equals 10.",
        "start": 875.68,
        "duration": 2.68
    },
    {
        "text": "Looking down at the 10th row, and relating those terms to the previous one, ",
        "start": 878.74,
        "duration": 4.184
    },
    {
        "text": "adding the first 5 elements of the 9th row is exactly half of that row, ",
        "start": 882.924,
        "duration": 3.965
    },
    {
        "text": "and because the triangle is symmetric, this means that when you add them up, ",
        "start": 886.889,
        "duration": 4.24
    },
    {
        "text": "you get exactly half of a power of 2, which itself of course is another power of 2.",
        "start": 891.129,
        "duration": 4.571
    },
    {
        "text": "And as a challenge problem for you, I don't actually know ",
        "start": 896.24,
        "duration": 2.806
    },
    {
        "text": "if this is the last time you'll ever see a power of 2.",
        "start": 899.046,
        "duration": 2.614
    },
    {
        "text": "Maybe one of you out there who's cleverer with diaphantine ",
        "start": 902.18,
        "duration": 2.525
    },
    {
        "text": "equations than I am can come up with some clever proof.",
        "start": 904.705,
        "duration": 2.355
    },
    {
        "text": "Stepping back, to summarize, we started by counting the total number of ",
        "start": 909.34,
        "duration": 3.792
    },
    {
        "text": "chords and the total number of intersection points, which, ",
        "start": 913.132,
        "duration": 3.108
    },
    {
        "text": "by thinking about the right associations, is the same as computing n choose ",
        "start": 916.24,
        "duration": 4.004
    },
    {
        "text": "2 and n choose 4.",
        "start": 920.244,
        "duration": 0.896
    },
    {
        "text": "Bringing in Euler's formula, this let us get an exact closed ",
        "start": 921.52,
        "duration": 3.186
    },
    {
        "text": "form expression for the number of regions inside the circle.",
        "start": 924.706,
        "duration": 3.134
    },
    {
        "text": "Then connecting that with Pascal's triangle gives us a very visceral ",
        "start": 927.84,
        "duration": 4.129
    },
    {
        "text": "connection with the powers of 2 and why they break when they do.",
        "start": 931.969,
        "duration": 3.831
    },
    {
        "text": "So yes, Moser's circle problem is a cautionary tale about being wary of patterns ",
        "start": 937.28,
        "duration": 4.336
    },
    {
        "text": "without proof, but at a deeper level, it also tells us that what's sometimes ",
        "start": 941.616,
        "duration": 4.122
    },
    {
        "text": "chalked up to be coincidence still leaves room for satisfying understandings.",
        "start": 945.738,
        "duration": 4.122
    }
]