[
    {
        "text": "Math is sometimes a real tease.",
        "start": 3.979,
        "duration": 2.221
    },
    {
        "text": "It seduces us with the beauty of reasoning geometrically in two and three ",
        "start": 6.82,
        "duration": 3.683
    },
    {
        "text": "dimensions where there's this really nice back and forth between pairs or ",
        "start": 10.503,
        "duration": 3.684
    },
    {
        "text": "triplets of numbers and spatial stuff that our visual cortex is good at processing.",
        "start": 14.187,
        "duration": 4.133
    },
    {
        "text": "For example, if you think about a circle with radius 1 centered at the origin, ",
        "start": 19.14,
        "duration": 5.147
    },
    {
        "text": "you are in effect conceptualizing every possible pair of numbers x and y that ",
        "start": 24.287,
        "duration": 5.081
    },
    {
        "text": "satisfy a certain numerical property that x squared plus y squared is 1.",
        "start": 29.368,
        "duration": 4.692
    },
    {
        "text": "And the usefulness here is that a lot of facts that look opaque in a ",
        "start": 35.02,
        "duration": 4.091
    },
    {
        "text": "purely analytic context become quite clear geometrically and vice versa.",
        "start": 39.111,
        "duration": 4.269
    },
    {
        "text": "Honestly, this channel has been the direct beneficiary of this back ",
        "start": 44.26,
        "duration": 4.047
    },
    {
        "text": "and forth since it offers such a rich library of that special category ",
        "start": 48.307,
        "duration": 4.226
    },
    {
        "text": "of cleverness that involves connecting two seemingly disparate ideas.",
        "start": 52.533,
        "duration": 4.107
    },
    {
        "text": "And I don't just mean the general back and forth between ",
        "start": 57.3,
        "duration": 2.406
    },
    {
        "text": "pairs or triplets of numbers and spatial reasoning.",
        "start": 59.706,
        "duration": 2.154
    },
    {
        "text": "I mean this specific one between sums of squares and circles and spheres.",
        "start": 62.22,
        "duration": 4.06
    },
    {
        "text": "It's at the heart of the video I made showing how pi is connected to number theory ",
        "start": 67.12,
        "duration": 4.382
    },
    {
        "text": "and primes and the one showing how to visualize all possible Pythagorean triples.",
        "start": 71.502,
        "duration": 4.278
    },
    {
        "text": "It also underlies the video on the Borsuk-Ulam theorem being used to solve ",
        "start": 76.38,
        "duration": 4.196
    },
    {
        "text": "what was basically a counting puzzle by using topological facts about spheres.",
        "start": 80.576,
        "duration": 4.364
    },
    {
        "text": "There is no doubt that the ability to frame analytic ",
        "start": 85.64,
        "duration": 3.048
    },
    {
        "text": "facts geometrically is very useful for math.",
        "start": 88.688,
        "duration": 2.532
    },
    {
        "text": "But it's all a tease because when you start asking questions about ",
        "start": 91.72,
        "duration": 3.842
    },
    {
        "text": "quadruplets or quintuplets or 100 tuples of numbers it's frustrating.",
        "start": 95.562,
        "duration": 3.958
    },
    {
        "text": "The constraints on our physical space seem to have constrained ",
        "start": 100.28,
        "duration": 3.78
    },
    {
        "text": "our intuitions about geometry and we lose this back and forth.",
        "start": 104.06,
        "duration": 3.72
    },
    {
        "text": "I mean it is completely reasonable to imagine that there are problems out ",
        "start": 108.52,
        "duration": 4.164
    },
    {
        "text": "there that would have clever and illuminating solutions if only we knew how ",
        "start": 112.684,
        "duration": 4.278
    },
    {
        "text": "to conceptualize say lists of 10 numbers as individual points in some space.",
        "start": 116.962,
        "duration": 4.278
    },
    {
        "text": "For mathematicians or computer scientists or physicists problems that are ",
        "start": 122.22,
        "duration": 4.249
    },
    {
        "text": "framed in terms of lists of numbers lists of more than three numbers are a ",
        "start": 126.469,
        "duration": 4.307
    },
    {
        "text": "regular part of the job and the standard approach to actually doing math in ",
        "start": 130.776,
        "duration": 4.364
    },
    {
        "text": "higher dimensions is to use two and three dimensions for analogy but to ",
        "start": 135.14,
        "duration": 4.134
    },
    {
        "text": "fundamentally reason about things just analytically somewhat analogous to a ",
        "start": 139.274,
        "duration": 4.364
    },
    {
        "text": "pilot relying primarily on instruments and not sight while flying through the clouds.",
        "start": 143.638,
        "duration": 4.882
    },
    {
        "text": "Now what I want to offer here is a hybrid between the purely geometric and ",
        "start": 148.88,
        "duration": 4.228
    },
    {
        "text": "the purely analytic views a method for making the analytic reasoning a little ",
        "start": 153.108,
        "duration": 4.398
    },
    {
        "text": "more visual in a way that generalizes to arbitrarily high dimensions and to ",
        "start": 157.506,
        "duration": 4.284
    },
    {
        "text": "drive home the value of a tactic like this I want to share with you a very ",
        "start": 161.79,
        "duration": 4.229
    },
    {
        "text": "famous example where analogies with two and three dimensions cannot help ",
        "start": 166.019,
        "duration": 4.116
    },
    {
        "text": "because of something extremely counterintuitive that only happens in higher dimensions.",
        "start": 170.135,
        "duration": 4.905
    },
    {
        "text": "The hope though is that what I show you here helps to make that phenomenon more intuitive.",
        "start": 175.9,
        "duration": 4.78
    },
    {
        "text": "The focus throughout will be on higher dimensional spheres for example ",
        "start": 182.1,
        "duration": 4.437
    },
    {
        "text": "when we talk about a four-dimensional sphere say with radius one centered ",
        "start": 186.537,
        "duration": 4.625
    },
    {
        "text": "at the origin what that actually is is the set of all quadruplets of ",
        "start": 191.162,
        "duration": 4.312
    },
    {
        "text": "numbers xyzw where the sum of the squares of these numbers is one.",
        "start": 195.474,
        "duration": 4.126
    },
    {
        "text": "What I have pictured here now is multiple three-dimensional slices of a 4d sphere ",
        "start": 200.3,
        "duration": 5.124
    },
    {
        "text": "projected back into three dimensions but it's confusing and even if you do wrap your head ",
        "start": 205.424,
        "duration": 5.624
    },
    {
        "text": "around it it just pushes the question back to how you would think about a five or six or ",
        "start": 211.048,
        "duration": 5.561
    },
    {
        "text": "a seven dimensional sphere and more importantly squinting your eyes to understand a ",
        "start": 216.609,
        "duration": 5.249
    },
    {
        "text": "projection like this is not very reflective of what doing math with a 4d sphere actually ",
        "start": 221.858,
        "duration": 5.562
    },
    {
        "text": "entails.",
        "start": 227.42,
        "duration": 0.5
    },
    {
        "text": "Instead the basic idea here will be to get very literal ",
        "start": 229.02,
        "duration": 2.873
    },
    {
        "text": "about it and to think about four separate numbers.",
        "start": 231.893,
        "duration": 2.567
    },
    {
        "text": "I like to picture four vertical number lines with sliders to represent each number.",
        "start": 235.3,
        "duration": 4.1
    },
    {
        "text": "Each configuration of these sliders is a point in 4d space, ",
        "start": 240.24,
        "duration": 4.003
    },
    {
        "text": "a quadruplet of numbers, and what it means to be on a 4d unit sphere ",
        "start": 244.243,
        "duration": 4.605
    },
    {
        "text": "centered at the origin is that the sum of the squares of these four values is one.",
        "start": 248.848,
        "duration": 5.472
    },
    {
        "text": "Our goal is to understand which movements of these ",
        "start": 256.579,
        "duration": 3.586
    },
    {
        "text": "sliders correspond to movements on the sphere.",
        "start": 260.165,
        "duration": 3.235
    },
    {
        "text": "To do that it helps if we knock things down to ",
        "start": 265.5,
        "duration": 1.965
    },
    {
        "text": "two dimensions where we can actually see the circle.",
        "start": 267.465,
        "duration": 2.175
    },
    {
        "text": "So ask yourself what's a nice way to think about ",
        "start": 270.52,
        "duration": 3.018
    },
    {
        "text": "this relation that x squared plus y squared is one?",
        "start": 273.538,
        "duration": 3.142
    },
    {
        "text": "Well I like to think of the value of x squared as the real estate belonging ",
        "start": 278.04,
        "duration": 4.272
    },
    {
        "text": "to x and likewise the value of y squared is the real estate belonging to y ",
        "start": 282.312,
        "duration": 4.215
    },
    {
        "text": "and that they have a total of one unit of real estate to share between them.",
        "start": 286.527,
        "duration": 4.273
    },
    {
        "text": "So moving around on the circle corresponds to a constant ",
        "start": 291.54,
        "duration": 3.611
    },
    {
        "text": "exchange of real estate between the two variables.",
        "start": 295.151,
        "duration": 3.169
    },
    {
        "text": "Part of the reason I choose this term is that it lets us make a very ",
        "start": 299.52,
        "duration": 3.956
    },
    {
        "text": "useful analogy that real estate is cheap near zero and more expensive ",
        "start": 303.476,
        "duration": 4.014
    },
    {
        "text": "away from To see this, consider starting off in a position where x equals 1 and y is 0, ",
        "start": 307.49,
        "duration": 5.046
    },
    {
        "text": "meaning x has all of the real estate to itself, ",
        "start": 312.536,
        "duration": 2.752
    },
    {
        "text": "which in our usual geometric picture means we're on the rightmost point of the circle.",
        "start": 315.288,
        "duration": 4.932
    },
    {
        "text": "If you move x down just a bit to 0.9 the value of x squared changes to 0.81, ",
        "start": 321.24,
        "duration": 6.58
    },
    {
        "text": "so it has in effect given up 0.19 units of real estate.",
        "start": 327.82,
        "duration": 4.7
    },
    {
        "text": "But for y squared to increase by that same amount, ",
        "start": 333.24,
        "duration": 3.52
    },
    {
        "text": "y has to move an entire 0.44 units away from 0, ",
        "start": 336.76,
        "duration": 3.313
    },
    {
        "text": "more than four times the amount that x moved.",
        "start": 340.073,
        "duration": 3.107
    },
    {
        "text": "In other words, x changed a little to give up expensive real estate so ",
        "start": 343.94,
        "duration": 3.976
    },
    {
        "text": "that y could move a lot and gain the same value of cheap real estate.",
        "start": 347.916,
        "duration": 3.864
    },
    {
        "text": "In terms of the usual circle drawing, this corresponds ",
        "start": 352.78,
        "duration": 2.878
    },
    {
        "text": "to the steep slope near the right side.",
        "start": 355.658,
        "duration": 2.042
    },
    {
        "text": "A small nudge in x allows for a very big change to y.",
        "start": 358.18,
        "duration": 3.46
    },
    {
        "text": "Moving forward, let's add some tick marks to these lines to ",
        "start": 362.44,
        "duration": 3.686
    },
    {
        "text": "indicate what 0.05 units of real estate looks like at each point.",
        "start": 366.126,
        "duration": 3.994
    },
    {
        "text": "That is, how much would x have to change so that the value of x squared changes by 0.05?",
        "start": 370.58,
        "duration": 5.88
    },
    {
        "text": "As you walk around the circle, the trade-off in value between x squared and y ",
        "start": 377.74,
        "duration": 4.317
    },
    {
        "text": "squared gives this piston looking dance motion, ",
        "start": 382.057,
        "duration": 2.658
    },
    {
        "text": "where the sliders are moving more slowly away from zero because real estate is ",
        "start": 384.715,
        "duration": 4.373
    },
    {
        "text": "more expensive in those regions.",
        "start": 389.088,
        "duration": 1.772
    },
    {
        "text": "There are just more tick marks to cover per unit distance.",
        "start": 391.42,
        "duration": 2.78
    },
    {
        "text": "Also, a nice side effect of the term real estate is that it aligns naturally ",
        "start": 395.42,
        "duration": 4.368
    },
    {
        "text": "with the fact that it comes in units of distance squared, ",
        "start": 399.788,
        "duration": 3.291
    },
    {
        "text": "so the square root of the total real estate among all coordinates gives us the ",
        "start": 403.079,
        "duration": 4.482
    },
    {
        "text": "distance from the origin.",
        "start": 407.561,
        "duration": 1.419
    },
    {
        "text": "For a unit sphere in three dimensions, the set of all triplets x, y, ",
        "start": 410.54,
        "duration": 3.888
    },
    {
        "text": "z where the sum of their squares is one, all we have to do is add a third slider for z, ",
        "start": 414.428,
        "duration": 4.959
    },
    {
        "text": "but these three sliders still only have the one unit of real estate to share between them.",
        "start": 419.387,
        "duration": 5.073
    },
    {
        "text": "To get a feel for this, imagine holding x in place at 0.5, ",
        "start": 425.18,
        "duration": 4.078
    },
    {
        "text": "where it occupies 0.25 units of real estate.",
        "start": 429.258,
        "duration": 3.042
    },
    {
        "text": "What this means is that y and z can move around in the same piston dance ",
        "start": 433.16,
        "duration": 4.504
    },
    {
        "text": "motion we saw before as they trade off the remaining 0.75 units of real estate.",
        "start": 437.664,
        "duration": 4.876
    },
    {
        "text": "In terms of our typical way of visualizing a sphere, ",
        "start": 443.5,
        "duration": 3.309
    },
    {
        "text": "this corresponds to slicing the sphere along the plane where x is ",
        "start": 446.809,
        "duration": 4.121
    },
    {
        "text": "0.5 and looking at the circle formed by all of the choices for y and z on that sphere.",
        "start": 450.93,
        "duration": 5.37
    },
    {
        "text": "As you increase the value of x, the amount of real estate left ",
        "start": 457.6,
        "duration": 3.654
    },
    {
        "text": "over for y and z is smaller, and this more constrained piston ",
        "start": 461.254,
        "duration": 3.596
    },
    {
        "text": "dance is what it feels like for the circular slice to be smaller.",
        "start": 464.85,
        "duration": 3.77
    },
    {
        "text": "Eventually, once x reaches the value 1, there's no real estate left over, ",
        "start": 469.5,
        "duration": 4.37
    },
    {
        "text": "so you reach this singularity point where y and z are both forced to be 0.",
        "start": 473.87,
        "duration": 4.37
    },
    {
        "text": "The feeling here is a bit like being a bug on the surface of the sphere.",
        "start": 479.56,
        "duration": 3.56
    },
    {
        "text": "You are unable to see the whole sphere all at once.",
        "start": 483.48,
        "duration": 3.08
    },
    {
        "text": "Instead, you're just sitting on a single point, ",
        "start": 487.02,
        "duration": 2.369
    },
    {
        "text": "and you have some sense for what local movements are allowed.",
        "start": 489.389,
        "duration": 3.011
    },
    {
        "text": "In four dimensions and higher, we lose the crutch of the global view that a spatial ",
        "start": 495.68,
        "duration": 4.615
    },
    {
        "text": "visual offers, but the fundamental rules of this real estate exchange remain the same.",
        "start": 500.295,
        "duration": 4.725
    },
    {
        "text": "If you fix one slider in place and watch the other three trade off, ",
        "start": 505.7,
        "duration": 3.898
    },
    {
        "text": "this is basically what it means to take a slice of the 4d sphere to get a ",
        "start": 509.598,
        "duration": 4.243
    },
    {
        "text": "small 3d sphere, in much the same way that fixing one of the sliders for the ",
        "start": 513.841,
        "duration": 4.415
    },
    {
        "text": "three-dimensional case give us a circular slice when the remaining two were free to vary.",
        "start": 518.256,
        "duration": 5.104
    },
    {
        "text": "Now watching these sliders move about and thinking about the real ",
        "start": 524.9,
        "duration": 3.679
    },
    {
        "text": "estate exchange is pretty fun, but it runs the risk of being aimless ",
        "start": 528.579,
        "duration": 3.847
    },
    {
        "text": "unless we have an actual high-dimensional puzzle to sink our teeth into.",
        "start": 532.426,
        "duration": 4.014
    },
    {
        "text": "So let's set aside the sliders for just a moment and bring in a very ",
        "start": 536.72,
        "duration": 4.026
    },
    {
        "text": "classic example of something that seems reasonable and even dull in two ",
        "start": 540.746,
        "duration": 4.201
    },
    {
        "text": "and three dimensions, but which is totally out of whack in higher dimensions.",
        "start": 544.947,
        "duration": 4.493
    },
    {
        "text": "To start, take a 2x2 box centered at the origin.",
        "start": 550.66,
        "duration": 3.44
    },
    {
        "text": "Its corners are on the vertices 1,1, 1,-1,-1,1, and 1,-1.",
        "start": 554.88,
        "duration": 5.76
    },
    {
        "text": "Draw four circles, each with radius 1, centered at these four vertices, ",
        "start": 561.52,
        "duration": 4.828
    },
    {
        "text": "so each one is tangent to two of its neighbors.",
        "start": 566.348,
        "duration": 3.152
    },
    {
        "text": "Now I want you to think of the circle centered at the origin which is just ",
        "start": 570.56,
        "duration": 3.911
    },
    {
        "text": "large enough to be touching those corner circles, tangent to each one of them.",
        "start": 574.471,
        "duration": 4.069
    },
    {
        "text": "What we want to do for this setup and for its analogies in ",
        "start": 579.36,
        "duration": 3.368
    },
    {
        "text": "higher dimensions is find the radius of that inner circle.",
        "start": 582.728,
        "duration": 3.312
    },
    {
        "text": "Here in two dimensions we can use the Pythagorean theorem to see that the distance ",
        "start": 588.04,
        "duration": 4.455
    },
    {
        "text": "from the origin to the corner of the box is the square root of 2, which is around 1.414.",
        "start": 592.495,
        "duration": 4.725
    },
    {
        "text": "Then you can subtract off this portion here, the radius of the corner circle, ",
        "start": 598.32,
        "duration": 7.915
    },
    {
        "text": "which by definition is 1, and that is 1,414.",
        "start": 606.235,
        "duration": 4.465
    },
    {
        "text": "No surprises here, that seems pretty reasonable.",
        "start": 611.54,
        "duration": 2.28
    },
    {
        "text": "Now do something analogous in three dimensions.",
        "start": 615.06,
        "duration": 2.02
    },
    {
        "text": "Draw a 2x2x2 cube whose corners have vertices 1,1,1,1,1,-1, on and on and on, ",
        "start": 617.74,
        "duration": 5.715
    },
    {
        "text": "and then we're going to take eight different spheres, each of which has a radius 1, ",
        "start": 623.455,
        "duration": 6.156
    },
    {
        "text": "and center them on these vertices so that each one is tangent to three of its neighbors.",
        "start": 629.611,
        "duration": 6.449
    },
    {
        "text": "Now again, think about the sphere centered at the origin which is ",
        "start": 637.22,
        "duration": 3.563
    },
    {
        "text": "just large enough to be barely touching those eight corner spheres.",
        "start": 640.783,
        "duration": 3.617
    },
    {
        "text": "As before, we can start by thinking about the distance from ",
        "start": 645.16,
        "duration": 3.53
    },
    {
        "text": "the origin to the corner of the box, say the corner at 1,1,1.",
        "start": 648.69,
        "duration": 3.59
    },
    {
        "text": "By the way, I guess I still haven't yet explicitly said that the ",
        "start": 653.28,
        "duration": 3.643
    },
    {
        "text": "way distances work in higher dimensions is always to add up the ",
        "start": 656.923,
        "duration": 3.588
    },
    {
        "text": "squares of the components in each direction and take the square root.",
        "start": 660.511,
        "duration": 3.869
    },
    {
        "text": "If you've never seen why this follows from the Pythagorean theorem just in the ",
        "start": 665.04,
        "duration": 3.871
    },
    {
        "text": "two-dimensional case, it's actually a really fun puzzle to think about, ",
        "start": 668.911,
        "duration": 3.528
    },
    {
        "text": "and I've left the relevant image up on the screen for any of you who want to pause ",
        "start": 672.439,
        "duration": 4.067
    },
    {
        "text": "and ponder on it.",
        "start": 676.506,
        "duration": 0.834
    },
    {
        "text": "Anyway, in our case the distance between the origin and the corner 1,1,1 is the square ",
        "start": 678.08,
        "duration": 5.278
    },
    {
        "text": "root of 1 squared plus 1 squared plus 1 squared, or square root of 3, which is about 1.73.",
        "start": 683.358,
        "duration": 5.462
    },
    {
        "text": "So the radius of that inner sphere is going to be this quantity ",
        "start": 689.88,
        "duration": 3.85
    },
    {
        "text": "minus the radius of a corner sphere, which by definition is 1.",
        "start": 693.73,
        "duration": 3.73
    },
    {
        "text": "And again, 0.73 seems like a reasonable radius for that inner sphere.",
        "start": 698.16,
        "duration": 4.9
    },
    {
        "text": "But what happens to that inner radius as you increase dimensions?",
        "start": 703.82,
        "duration": 3.22
    },
    {
        "text": "Obviously the reason I bring this up is that something surprising will happen, ",
        "start": 708.1,
        "duration": 3.742
    },
    {
        "text": "and some of you might see where this is going, ",
        "start": 711.842,
        "duration": 2.227
    },
    {
        "text": "but I actually don't want it to feel like a surprise.",
        "start": 714.069,
        "duration": 2.511
    },
    {
        "text": "As fun as it is to wow people with counterintuitive facts and math, ",
        "start": 717.18,
        "duration": 3.861
    },
    {
        "text": "the goal here is genuine understanding, not shock.",
        "start": 721.041,
        "duration": 2.839
    },
    {
        "text": "For higher dimensions we'll be using sliders to get a gut feel for what's going on, ",
        "start": 724.5,
        "duration": 4.203
    },
    {
        "text": "but since it's kind of a different way of viewing things it helps to get a running start ",
        "start": 728.703,
        "duration": 4.453
    },
    {
        "text": "by looking back at how to analyze the two and three-dimensional cases in the context of ",
        "start": 733.156,
        "duration": 4.403
    },
    {
        "text": "sliders.",
        "start": 737.559,
        "duration": 0.401
    },
    {
        "text": "First things first, how do you think about a circle centered at a corner like 1,-1?",
        "start": 739.1,
        "duration": 5.06
    },
    {
        "text": "Well previously, for a circle centered at the origin, ",
        "start": 745.18,
        "duration": 3.129
    },
    {
        "text": "the amount of real estate belonging to both x and y was dependent on their ",
        "start": 748.309,
        "duration": 4.346
    },
    {
        "text": "distance from the number 0.",
        "start": 752.655,
        "duration": 1.565
    },
    {
        "text": "And it's the same basic idea here as you move around the center, ",
        "start": 755.14,
        "duration": 2.901
    },
    {
        "text": "it's just that the real estate might be dependent on the distance between each coordinate ",
        "start": 758.041,
        "duration": 4.017
    },
    {
        "text": "and some other number.",
        "start": 762.058,
        "duration": 0.982
    },
    {
        "text": "So for this circle, centered at 1,-1, the amount of real ",
        "start": 763.72,
        "duration": 3.842
    },
    {
        "text": "estate belonging to x is the square of its distance from 1.",
        "start": 767.562,
        "duration": 3.978
    },
    {
        "text": "Likewise, the real estate belonging to y is the square of its distance from negative 1.",
        "start": 772.28,
        "duration": 5.14
    },
    {
        "text": "Other than that, the look and feel with this piston ",
        "start": 778.1,
        "duration": 2.445
    },
    {
        "text": "dance trade-off is completely the same.",
        "start": 780.545,
        "duration": 1.835
    },
    {
        "text": "For simplicity, we'll only focus on one of these circles, the one centered at 1,-1.",
        "start": 783.48,
        "duration": 4.34
    },
    {
        "text": "Now ask yourself, what does it mean to find a circle centered at the origin large ",
        "start": 788.78,
        "duration": 4.222
    },
    {
        "text": "enough to be tangent to this guy when we're thinking just in terms of sliders?",
        "start": 793.002,
        "duration": 4.018
    },
    {
        "text": "Well notice how this point of tangency happens ",
        "start": 800.12,
        "duration": 2.685
    },
    {
        "text": "when the x and y coordinates are both the same.",
        "start": 802.805,
        "duration": 2.685
    },
    {
        "text": "Or phrased differently, at the point of this corner circle closest to the origin, ",
        "start": 806.31,
        "duration": 5.182
    },
    {
        "text": "the real estate is shared evenly between x and y.",
        "start": 811.492,
        "duration": 3.098
    },
    {
        "text": "This will be important for later, so let's really dig in and think about why it's true.",
        "start": 815.41,
        "duration": 3.68
    },
    {
        "text": "Imagine perturbing that point slightly, maybe moving x a little closer to 0, ",
        "start": 820.07,
        "duration": 4.232
    },
    {
        "text": "which means y would have to move a little away from 0.",
        "start": 824.302,
        "duration": 2.968
    },
    {
        "text": "The change in x would have to be a little smaller than the change in y, ",
        "start": 827.91,
        "duration": 3.987
    },
    {
        "text": "since the real estate it gains by moving farther away from 1 is more ",
        "start": 831.897,
        "duration": 3.822
    },
    {
        "text": "expensive than the real estate that y loses by getting closer to 1.",
        "start": 835.719,
        "duration": 3.711
    },
    {
        "text": "But from the perspective of the origin point 0,0 that trade-off is reversed.",
        "start": 840.31,
        "duration": 4.3
    },
    {
        "text": "The resulting change to x squared is smaller than the resulting change to y squared, ",
        "start": 845.33,
        "duration": 5.994
    },
    {
        "text": "since when real estate is measured with respect to 0,0, ",
        "start": 851.324,
        "duration": 3.949
    },
    {
        "text": "that move of y towards 1 is the more expensive one.",
        "start": 855.273,
        "duration": 3.597
    },
    {
        "text": "What this means is that any slight perturbation away from this point where ",
        "start": 860.15,
        "duration": 4.373
    },
    {
        "text": "real estate is shared evenly results in an increasing distance from the origin.",
        "start": 864.523,
        "duration": 4.607
    },
    {
        "text": "The reason we care is that this point is tangent to the inner circle, ",
        "start": 870.47,
        "duration": 3.566
    },
    {
        "text": "so we can also think about it as being a point of the inner circle.",
        "start": 874.036,
        "duration": 3.414
    },
    {
        "text": "And this will be very useful for higher dimensions.",
        "start": 878.13,
        "duration": 1.94
    },
    {
        "text": "It gives us a reference point to understanding the radius of that inner circle.",
        "start": 880.53,
        "duration": 3.94
    },
    {
        "text": "Specifically, you can ask how much real estate is shared between x and y at ",
        "start": 885.29,
        "duration": 4.598
    },
    {
        "text": "this point when real estate measurements are done with respect to the origin 0,0.",
        "start": 889.888,
        "duration": 4.902
    },
    {
        "text": "For example, down here in two dimensions both x and y dip below ",
        "start": 895.89,
        "duration": 5.004
    },
    {
        "text": "0.5 in this configuration, so the total value x squared plus y ",
        "start": 900.894,
        "duration": 4.927
    },
    {
        "text": "squared is going to be less than 0.5 squared plus 0.5 squared.",
        "start": 905.821,
        "duration": 4.849
    },
    {
        "text": "Comparing to this halfway point is really going to come in handy ",
        "start": 911.67,
        "duration": 2.772
    },
    {
        "text": "for wrapping our mind around what happens in higher dimensions.",
        "start": 914.442,
        "duration": 2.688
    },
    {
        "text": "Taking things one step at a time, let's bump it up to three dimensions.",
        "start": 918.01,
        "duration": 2.74
    },
    {
        "text": "Consider the corner sphere with radius 1 centered at 1,1,1.",
        "start": 922.69,
        "duration": 3.58
    },
    {
        "text": "The point on that sphere that's closest to the origin corresponds to the configuration ",
        "start": 926.97,
        "duration": 5.423
    },
    {
        "text": "of sliders where x, y, and z are all reaching down toward 0 and equal to each other.",
        "start": 932.393,
        "duration": 5.237
    },
    {
        "text": "Again, they all have to go a little beyond that halfway point because the ",
        "start": 938.45,
        "duration": 5.567
    },
    {
        "text": "position 0.5 only accounts for 0.5 squared, or 0.25 units of real estate.",
        "start": 944.017,
        "duration": 5.493
    },
    {
        "text": "So with all three coordinates getting a third of a unit of real estate, ",
        "start": 950.63,
        "duration": 3.83
    },
    {
        "text": "they need to be farther out.",
        "start": 954.46,
        "duration": 1.49
    },
    {
        "text": "And again, since this is a point where the corner sphere is tangent to the inner sphere, ",
        "start": 956.75,
        "duration": 4.274
    },
    {
        "text": "it's also a point of the inner sphere.",
        "start": 961.024,
        "duration": 1.826
    },
    {
        "text": "So with reference to the origin 0,0,0, think about the amount of real estate ",
        "start": 963.61,
        "duration": 5.172
    },
    {
        "text": "shared between x, y, and z in this position corresponding to the tangent point.",
        "start": 968.782,
        "duration": 5.308
    },
    {
        "text": "It's definitely less than 0.75 since all three of these are smaller than 0.5, ",
        "start": 974.83,
        "duration": 6.6
    },
    {
        "text": "so each one has less than 0.25 units of real estate.",
        "start": 981.43,
        "duration": 4.4
    },
    {
        "text": "And again, we sit back and feel comfortable with this result, right?",
        "start": 986.89,
        "duration": 3.06
    },
    {
        "text": "The inner sphere is smaller than the corner spheres.",
        "start": 990.07,
        "duration": 2.52
    },
    {
        "text": "But things get interesting when we move up into four dimensions.",
        "start": 993.55,
        "duration": 2.72
    },
    {
        "text": "Our 2x2x2x2 box is going to have 16 vertices at 1111, 111-1, ",
        "start": 997.95,
        "duration": 6.344
    },
    {
        "text": "and so on, with all possible binary combinations of 1 and negative 1.",
        "start": 1004.294,
        "duration": 7.176
    },
    {
        "text": "What this means is that there are 16 unit spheres centered at these corners, ",
        "start": 1012.31,
        "duration": 4.231
    },
    {
        "text": "each one tangent to four of its neighbors.",
        "start": 1016.541,
        "duration": 2.309
    },
    {
        "text": "As before, we'll just be focusing on one of them, the one centered at 1111.",
        "start": 1020.15,
        "duration": 4.4
    },
    {
        "text": "The point of the sphere closest to the origin corresponds to the configuration ",
        "start": 1024.99,
        "duration": 5.045
    },
    {
        "text": "of sliders where all four coordinates reach exactly halfway between 1 and 0.",
        "start": 1030.035,
        "duration": 4.855
    },
    {
        "text": "And that's because when one of the coordinates is 0.5 units away from 1, ",
        "start": 1035.77,
        "duration": 4.804
    },
    {
        "text": "it has 0.25 units of real estate with respect to the point 1.",
        "start": 1040.574,
        "duration": 4.015
    },
    {
        "text": "We do the same trick as before, thinking of this now as a point ",
        "start": 1045.369,
        "duration": 3.01
    },
    {
        "text": "of the inner sphere and measuring things with respect to the origin, ",
        "start": 1048.379,
        "duration": 3.244
    },
    {
        "text": "but you can already see what's cool about four dimensions.",
        "start": 1051.623,
        "duration": 2.727
    },
    {
        "text": "As you switch to thinking of real estate with respect to 0000, ",
        "start": 1054.93,
        "duration": 4.1
    },
    {
        "text": "it's still the case that each of these four coordinates has 0.25 units of real estate, ",
        "start": 1059.03,
        "duration": 5.664
    },
    {
        "text": "making for a total of one shared between the four coordinates.",
        "start": 1064.694,
        "duration": 4.036
    },
    {
        "text": "In other words, that inner sphere is precisely the same size as the corner spheres.",
        "start": 1070.11,
        "duration": 4.6
    },
    {
        "text": "This matches with what you see numerically, by the way, ",
        "start": 1075.67,
        "duration": 3.142
    },
    {
        "text": "where you can compute the distance between the origin and the corner, 1111, ",
        "start": 1078.812,
        "duration": 4.264
    },
    {
        "text": "is the square root of 4, and then when you subtract off the radius of one of the ",
        "start": 1083.076,
        "duration": 4.546
    },
    {
        "text": "corner spheres, what you get is 1.",
        "start": 1087.622,
        "duration": 1.908
    },
    {
        "text": "But there's something much more satisfying about seeing it, rather than just computing it.",
        "start": 1090.43,
        "duration": 4.36
    },
    {
        "text": "In particular, here's a cool aspect of the fact that that inner sphere has radius 1.",
        "start": 1095.59,
        "duration": 3.98
    },
    {
        "text": "Move things around so that all of the real estate goes to the coordinate x, ",
        "start": 1100.19,
        "duration": 4.328
    },
    {
        "text": "and you'll end up at the point 1, 0, 0, 0.",
        "start": 1104.518,
        "duration": 2.392
    },
    {
        "text": "This point is actually touching the 2x2x2x2 box, ",
        "start": 1107.49,
        "duration": 3.24
    },
    {
        "text": "and when you're stuck thinking in the two or three dimensional cases, ",
        "start": 1110.73,
        "duration": 4.628
    },
    {
        "text": "this fact that the inner sphere has radius 1, the same size as the corner spheres, ",
        "start": 1115.358,
        "duration": 5.489
    },
    {
        "text": "and that it touches the box, well it just seems too big.",
        "start": 1120.847,
        "duration": 3.703
    },
    {
        "text": "But it's important to realize this is fundamentally a four-dimensional phenomenon, ",
        "start": 1125.29,
        "duration": 4.597
    },
    {
        "text": "and you just can't cram it down into smaller dimensions.",
        "start": 1129.887,
        "duration": 3.103
    },
    {
        "text": "But things get weirder.",
        "start": 1134.17,
        "duration": 0.9
    },
    {
        "text": "Let's knock it up to five dimensions.",
        "start": 1135.35,
        "duration": 1.4
    },
    {
        "text": "In this case we have quite a few corner spheres, 32 in total, ",
        "start": 1137.37,
        "duration": 3.503
    },
    {
        "text": "but again for simplicity we'll only be thinking about the ones centered at 11111.",
        "start": 1140.873,
        "duration": 4.577
    },
    {
        "text": "Think about the point of the sphere closest to the origin, ",
        "start": 1146.19,
        "duration": 3.036
    },
    {
        "text": "where all five coordinates are equally splitting the one unit of shared real estate.",
        "start": 1149.226,
        "duration": 4.324
    },
    {
        "text": "This time each coordinate is a little higher than 0.5.",
        "start": 1154.43,
        "duration": 3.68
    },
    {
        "text": "If they reach down to 0.5, each one would have 0.25 units of real estate, ",
        "start": 1158.53,
        "duration": 5.384
    },
    {
        "text": "giving a total of 1.25, which is too much.",
        "start": 1163.914,
        "duration": 3.056
    },
    {
        "text": "But the tables are turned when you view this as a point on the inner sphere, ",
        "start": 1167.75,
        "duration": 4.373
    },
    {
        "text": "because with respect to the origin, this configuration has much more than one unit of ",
        "start": 1172.123,
        "duration": 4.885
    },
    {
        "text": "real estate.",
        "start": 1177.008,
        "duration": 0.682
    },
    {
        "text": "Not only is every coordinate more than 0.5 units away from 0, ",
        "start": 1180.13,
        "duration": 3.773
    },
    {
        "text": "but the larger number of dimensions means that there's more total real estate when ",
        "start": 1183.903,
        "duration": 5.051
    },
    {
        "text": "you add it all up.",
        "start": 1188.954,
        "duration": 1.096
    },
    {
        "text": "Specifically you can compute that the radius of that inner sphere is about 1.24.",
        "start": 1190.65,
        "duration": 5.04
    },
    {
        "text": "The intuitive feel for what that means is that the sliders can roam over ",
        "start": 1196.53,
        "duration": 4.045
    },
    {
        "text": "more territory than what just a single unit of real estate would allow.",
        "start": 1200.575,
        "duration": 3.935
    },
    {
        "text": "One fun way to see what this means is to adjust everything ",
        "start": 1205.61,
        "duration": 2.7
    },
    {
        "text": "so that all of the real estate goes to just one coordinate.",
        "start": 1208.31,
        "duration": 2.7
    },
    {
        "text": "Because this coordinate can reach beyond one, what you are seeing is ",
        "start": 1212.01,
        "duration": 4.337
    },
    {
        "text": "that this five dimensional inner sphere actually pokes outside the box.",
        "start": 1216.347,
        "duration": 4.463
    },
    {
        "text": "But to really get a feel for how strange things become, ",
        "start": 1222.67,
        "duration": 2.83
    },
    {
        "text": "as a last example I want to jump up into ten dimensions.",
        "start": 1225.5,
        "duration": 2.83
    },
    {
        "text": "Remember, all this means is that points have ten coordinates.",
        "start": 1229.13,
        "duration": 2.98
    },
    {
        "text": "For a sphere with radius 1, a single unit of real ",
        "start": 1232.77,
        "duration": 2.728
    },
    {
        "text": "estate must be shared among all ten of those coordinates.",
        "start": 1235.498,
        "duration": 3.112
    },
    {
        "text": "As always, the point of this corner sphere closest to the origin ",
        "start": 1239.63,
        "duration": 3.522
    },
    {
        "text": "is the one where all ten coordinates split the real estate evenly.",
        "start": 1243.152,
        "duration": 3.578
    },
    {
        "text": "And here you can really see just how far away this feels from the origin.",
        "start": 1247.45,
        "duration": 3.86
    },
    {
        "text": "Or phrased differently, that inner sphere is allowed ",
        "start": 1252.23,
        "duration": 3.003
    },
    {
        "text": "to have a very large amount of real estate.",
        "start": 1255.233,
        "duration": 2.437
    },
    {
        "text": "In fact, you can compute that the radius of the inner sphere is about 2.16.",
        "start": 1258.69,
        "duration": 5.0
    },
    {
        "text": "And viewed from this perspective, where you have ten full dimensions to share ",
        "start": 1264.75,
        "duration": 4.261
    },
    {
        "text": "that real estate, doesn't it actually feel somewhat reasonable that the inner ",
        "start": 1269.011,
        "duration": 4.262
    },
    {
        "text": "sphere should have a radius more than twice as big as all those corner spheres?",
        "start": 1273.273,
        "duration": 4.317
    },
    {
        "text": "To get a sense for just how big this inner sphere is, ",
        "start": 1278.83,
        "duration": 3.342
    },
    {
        "text": "look back in two dimensions and imagine a 4x4 box bounding all four circles ",
        "start": 1282.172,
        "duration": 4.705
    },
    {
        "text": "from the outside.",
        "start": 1286.877,
        "duration": 1.053
    },
    {
        "text": "Or go to three dimensions and imagine a 4x4x4 box ",
        "start": 1288.75,
        "duration": 3.403
    },
    {
        "text": "bounding all of those corner spheres from the outside.",
        "start": 1292.153,
        "duration": 3.677
    },
    {
        "text": "Way up here in ten dimensions, that quote-unquote inner sphere is actually large enough ",
        "start": 1296.35,
        "duration": 5.707
    },
    {
        "text": "to poke outside of that outer bounding box, since it has a diameter bigger than four.",
        "start": 1302.057,
        "duration": 5.513
    },
    {
        "text": "I know that seems crazy, but you have to realize that the face of the box is ",
        "start": 1310.07,
        "duration": 4.883
    },
    {
        "text": "always two units away from the origin, no matter how high the dimension is.",
        "start": 1314.953,
        "duration": 4.757
    },
    {
        "text": "And fundamentally it's because it only involves moving along a single axis.",
        "start": 1320.17,
        "duration": 4.08
    },
    {
        "text": "But the point 1111111111, which determines the inner sphere's radius, ",
        "start": 1325.03,
        "duration": 4.364
    },
    {
        "text": "is actually really far away from the center, all the way up here in ten dimensions.",
        "start": 1329.394,
        "duration": 5.176
    },
    {
        "text": "And it's because all ten of those dimensions add ",
        "start": 1335.25,
        "duration": 2.961
    },
    {
        "text": "a full unit of real estate for that point.",
        "start": 1338.211,
        "duration": 2.539
    },
    {
        "text": "And of course as you keep upping the dimensions, ",
        "start": 1342.39,
        "duration": 2.479
    },
    {
        "text": "that inner sphere just keeps growing without bound.",
        "start": 1344.869,
        "duration": 2.581
    },
    {
        "text": "Not only is it poking outside of these boxes, but the proportion of the inner sphere ",
        "start": 1347.95,
        "duration": 5.522
    },
    {
        "text": "lying inside the box decreases exponentially towards zero as the dimension keeps ",
        "start": 1353.472,
        "duration": 5.263
    },
    {
        "text": "increasing.",
        "start": 1358.735,
        "duration": 0.715
    },
    {
        "text": "So taking a step back, one of the things I like about using this slider method ",
        "start": 1361.61,
        "duration": 3.774
    },
    {
        "text": "for teaching is that when I shared it with a few friends, ",
        "start": 1365.384,
        "duration": 2.772
    },
    {
        "text": "the way they started to talk about higher dimensions became a little less ",
        "start": 1368.156,
        "duration": 3.535
    },
    {
        "text": "metaphysical and started to sound more like how you would hear a mathematician ",
        "start": 1371.691,
        "duration": 3.775
    },
    {
        "text": "talk about the topic.",
        "start": 1375.466,
        "duration": 1.004
    },
    {
        "text": "Rather than skeptically asking whether or not ten-dimensional space is a real thing, ",
        "start": 1377.01,
        "duration": 4.795
    },
    {
        "text": "recognizing that it's exactly as real as numbers are, ",
        "start": 1381.805,
        "duration": 3.047
    },
    {
        "text": "people would actually probe at what other properties high-dimensional ",
        "start": 1384.852,
        "duration": 3.95
    },
    {
        "text": "spheres have and what other shapes feel like in terms of sliders.",
        "start": 1388.802,
        "duration": 3.668
    },
    {
        "text": "This box situation is just one in a number of things that feel very ",
        "start": 1393.45,
        "duration": 3.729
    },
    {
        "text": "crazy about higher dimensional spheres, and it's really fun to ",
        "start": 1397.179,
        "duration": 3.456
    },
    {
        "text": "think about these others in the context of sliders and real estate.",
        "start": 1400.635,
        "duration": 3.675
    },
    {
        "text": "It's obviously limited, I mean you're a bug on the surface of these objects, ",
        "start": 1405.23,
        "duration": 3.579
    },
    {
        "text": "only getting a feel for one point at a time and for the rules of movement.",
        "start": 1408.809,
        "duration": 3.441
    },
    {
        "text": "Also, geometry can be quite nice when it's coordinate-free, ",
        "start": 1413.23,
        "duration": 3.279
    },
    {
        "text": "and this is the opposite of that, but it does give a foothold ",
        "start": 1416.509,
        "duration": 3.389
    },
    {
        "text": "into thinking about high-dimensional shapes a little more concretely.",
        "start": 1419.898,
        "duration": 3.772
    },
    {
        "text": "Now you could say that viewing things with sliders is no ",
        "start": 1426.03,
        "duration": 2.95
    },
    {
        "text": "different from thinking about things purely analytically.",
        "start": 1428.98,
        "duration": 2.95
    },
    {
        "text": "I mean, it's honestly little more than representing each coordinate literally, ",
        "start": 1432.49,
        "duration": 3.727
    },
    {
        "text": "it's kind of the most obvious thing you might do.",
        "start": 1436.217,
        "duration": 2.313
    },
    {
        "text": "But this small move makes it much more possible to play with the thought of a ",
        "start": 1439.25,
        "duration": 4.218
    },
    {
        "text": "high-dimensional point, and even little things like thinking about the squares ",
        "start": 1443.468,
        "duration": 4.273
    },
    {
        "text": "of coordinates as real estate can shed light on some seemingly strange aspects ",
        "start": 1447.741,
        "duration": 4.273
    },
    {
        "text": "of high dimensions, like just how far away the corner of a box is from its center.",
        "start": 1452.014,
        "duration": 4.436
    },
    {
        "text": "If anything, the fact that it's such a direct representation of a ",
        "start": 1457.29,
        "duration": 3.688
    },
    {
        "text": "purely analytic description is exactly what makes it such a faithful ",
        "start": 1460.978,
        "duration": 3.856
    },
    {
        "text": "reflection of what genuinely doing math in higher dimensions entails.",
        "start": 1464.834,
        "duration": 3.856
    },
    {
        "text": "We're still flying in the clouds, trusting the instruments of analytic reasoning, ",
        "start": 1469.39,
        "duration": 4.113
    },
    {
        "text": "but this is a redesign of those instruments, one which better takes advantage of ",
        "start": 1473.503,
        "duration": 4.063
    },
    {
        "text": "the fact that such a large portion of our brains goes towards image processing.",
        "start": 1477.566,
        "duration": 3.964
    },
    {
        "text": "I mean, just because you can't visualize something ",
        "start": 1482.41,
        "duration": 2.295
    },
    {
        "text": "doesn't mean you can't still think about it visually.",
        "start": 1484.705,
        "duration": 2.385
    }
]